import os
import sys
import django


current_dir = os.path.dirname(os.path.abspath(__file__))
parent_dir = os.path.abspath(os.path.join(current_dir, ".."))
sys.path.append(parent_dir)

os.environ.setdefault("DJANGO_SETTINGS_MODULE", "djangoServer.settings")

django.setup()

from recommend.models import *
# from djangoServer.recommend.models import Ingredient, IngredientGroup

arr01 = [
["사과", "배"],
["귤", "오렌지", "한라봉", "천혜향"],
["단감", "홍시", "곶감", "감말랭이"],
["복숭아", "자두"],
["토마토", "방울토마토"],
["포도", "샤인머스켓"],
["수박", "멜론", "참외"],
["딸기", "산딸기", "블루베리", "복분자", "오디"],
["바나나", "오렌지", "파인애플"],
["자몽", "레몬", "라임", "유자", "석류"],
["매실", "살구"],
["건포도", "곶감", "건시", "감말랭이", "푸룬", "건블루베리", "건크랜베리", "건파인애플", "건살구", "건무화과", "건망고"],
"망고",
"체리",
"아보카도",
"오미자",
"무화과",
"모과",
"대추",
"키위"
]
arr02 = [
["두부", "순두부", "콩나물", "숙주나물"],
["감자","고구마","옥수수"],
["당근", "무"],
["우엉", "연근", "마", "야콘", "비트"],
["오이", "고추", "건고추", "피망", "파프리카"],
["가지", "호박", "애호박", "단호박", "늙은호박"],
["도라지", "더덕"],
["마늘", "깐마늘", "다진마늘", "대파", "쪽파", "양파", "생강", "다진생강"],
["배추", "무", "부추", "대파"],
["시금치", "미나리", "고사리", "배추", "부추"],
["아욱", "토란"],
["두릅", "죽순"],
["브로콜리", "콜리플라워", "콜라비"],
["상추", "깻잎"],
["상추", "배추", "양상추", "양배추"],
["새송이버섯", "느타리버섯", "양송이버섯"],
["고구마", "고구마말랭이"],
"아스파라거스",
"청경채",
"알로에",
"쑥갓"
]
arr03 = [
["백미", "현미", "찹쌀", "흑미"],

["콩", "팥", "보리"],

["수수", "조", "깨"],

["기장", "율무", "녹두", "귀리"],

["카카오닙스", "오트밀", "퀴노아", "치아씨드", "햄프씨드", "렌틸콩"],

["땅콩", "호두"],
 
["밤", "잣", "은행"],

["아몬드", "피스타치오"],

["호박씨", "해바라기씨"],

"캐슈넛",

"헤이즐넛",

"도토리"
]
arr04 = [
### 소고기

["소 양지", "소 사태"],

["소 등심", "소 안심", "소 목심", "소 채끝"],

["소 사골", "소꼬리", "우족"],

["소 앞다리살", "우둔", "설도", "소 다짐육"],

["소갈비", "양념갈비", "LA갈비"],

["소곱창", "소대창", "소막창", "돼지곱창", "돼지막창", "돼지대창"], ##돼지고기

"스테이크",

### 돼지고기

["삼겹살", "목살", "항정살", "갈매기살"],

["돼지 앞다리살", "돼지 뒷다리살", "돼지 사태살", "돼지 다짐육"],

["돼지 등심", "돼지 안심", "돼지 갈비", "돼지 등갈비", "돼지 등심 덧살"],

"훈제 삼겹살",

"돈까스",

"오돌뼈",

### 닭고기

["백숙용 닭고기", "볶음탕용 닭고기"],

["닭가슴살", "닭 안심"],

["닭다리", "닭 날개"],

["닭발", "모래집"],

### 오리고기

["생오리고기", "훈제오리", "오리로스"],

### 양고기

["양갈비", "양꼬치살", "양어깨살"],

### 달걀

["달걀", "구운달걀", "메추리알"]
]
arr05 = [
["고등어", "자반고등어", "갈치", "꽁치"],

["조기", "굴비", "도미"],

["장어", "연어", "훈제연어"],

["삼치", "대구", "생태", "동태"],

["우럭", "광어", "홍어"], 

["참치", "메로"],

["전어", "민어", "병어"],

["가자미", "도다리", "가오리"],

["오징어", "한치", "낙지", "쭈꾸미", "문어", "해파리"],

["새우", "꽃게", "대게", "홍게", "랍스터", "킹크랩"],

["전복", "굴"],

["홍합", "바지락", "꼬막"],

["소라", "고둥", "다슬기", "우렁이", "골뱅이"],

["조개", "가리비", "조개살", "조개관자"],

["멸치", "건새우", "건홍합", "다시팩", "해물가루"],

["도시락김","전장김", "생김", "김자반"],

["생미역", "건미역", "생다시마", "건다시마"],

["매생이", "톳"],

["건오징어", "진미채", "쥐포", "어포", "황태채", "황태포", "과메기"],

["날치알", "성게알", "곤이"],

["멍게", "해삼", "개불"]
]
arr06 = [
["흰우유", "딸기우유", "초코우유", "커피우유", "바나나우유"],

["요구르트", "요거트", "요거트파우더"],

["크림치즈", "피자치즈"],

["버터", "마가린"], 

["생크림", "휘핑크림"],

"두유",

"연유"
]
arr07 = [
"포기김치",
"맛김치",
"볶음김치",
"겉절이김치",
"묵은지",
"깍두기",
"총각김치",
"열무김치",
"동치미",
"갓김치",
"고들빼기김치",
"오이소박이",
]
arr08 = [
["소면", "중면", "칼국수", "수제비", "우동", "콩국수", "메밀", "쫄면", "당면"],

["쌀국수", "월남쌈", "또띠아"],

["스파게티", "페투치네", "링귀니", "펜네", "파르펠레", "리가토니", "푸실리", "로티니"],

"사리면"
]
arr09 = [
["참치통조림", "연어통조림"],

["햄통조림", "돈육통조림", "닭가슴살통조림", "우육통조림"], 

["고등어통조림", "꽁치통조림"],

["골뱅이통조림", "번데기통조림"],

["옥수수통조림", "콩통조림"],

["피클", "올리브절임", "케이퍼절임", "할라피뇨", "아티초크절임"],
]
arr10 = [
["대두유", "옥수수유", "올리브유", "아보카도 오일", "포도씨유", "카놀라유"],

["참기름", "들기름"],

["양조간장", "진간장", "국간장"],

["케첩", "마요네즈", "머스타드"],

["고추장", "된장", "쌈장"],

["청국장", "낫또"],

["토마토소스", "크림소스", "로제소스"],

["돈가스소스", "스테이크소스"],

["칠리소스", "살사소스", "핫소스"],

["오리엔탈드레싱", "발사믹드레싱", "시저드레싱", "아일랜드드레싱", "참깨드레싱", "흑임자드레싱"],

["물엿", "올리고당", "조청"],

["멸치액젓", "까나리액젓"],

"굴소스",

"식초",

"미림",

"꿀",
]
arr11 = [
"식빵",

["앙금", "스프링클", "아이싱칼라", "베이킹초콜릿", "쿠키크런치", "초코크런치", "베이킹파우더", "베이킹소다", "이스트"],

["호빵", "찐빵", "호떡"],

["딸기잼", "블루베리잼", "사과잼"],

["땅콩버터잼", "초코잼"]
]

group_id = 0

for arr in [arr01,arr02,arr03,arr04,arr05,arr06,arr07,arr08,arr09,arr10,arr11]:
    for lst in arr:
        if type(lst) == list:
            group_id += 1
            for ingr in lst:
                ingr_inst = Ingredient.objects.get(ingr_name=ingr)
                # print(ingr_inst.ingr_name)
                IngredientGroup.objects.create(
                    ingr_id = ingr_inst.ingr_id,
                    group_id = group_id
                )
        else:
            continue



# write(arr01, "subcate_01.txt")
# write(arr03, "subcate_03.txt")
# write(arr04, "subcate_04.txt")
# write(arr05, "subcate_05.txt")
# write(arr06, "subcate_06.txt")
# write(arr07, "subcate_07.txt")
# write(arr08, "subcate_08.txt")
# write(arr09, "subcate_09.txt")
# write(arr10, "subcate_10.txt")
# write(arr11, "subcate_11.txt")

## 메모장의 내용 읽기
# with open(file_path, 'r') as file:
#     # contents = 
#     for subcate in file.readlines():
#         print(subcate, end='')