-- 1501
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1501, '달걀', '60g'),
       (1501, '설탕', '40g'),
       (1501, '꿀', '10g'),
       (1501, '박력분', '65g'),
       (1501, '벚꽃 파우더', '3g'),
       (1501, '아몬드가루', '10g'),
       (1501, '베이킹파우더', '2g'),
       (1501, '소금', '1꼬집'),
       (1501, '녹인 무염버터', '50g'),
       (1501, '벚꽃에센스', '2방울'),
       (1501, '백옥앙금', '100g'),
       (1501, '염지벛꽃', '6개'),
       (1501, '벚꽃 파우더', '적당량'),
       (1501, '코팅용초콜릿', '적당량');

-- 1502
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1502, '우유', '50g'),
       (1502, '물', '50g'),
       (1502, '버터', '50g'),
       (1502, '소금', '1g'),
       (1502, '박력분', '80g'),
       (1502, '달걀', '130g'),
       (1502, '버터', '30g'),
       (1502, '설탕', '30g'),
       (1502, '박력분', '30g'),
       (1502, '우유', '300g'),
       (1502, '바닐라빈', '1/2개'),
       (1502, '설탕', '60g'),
       (1502, '노른자', '60g'),
       (1502, '박력분', '12g'),
       (1502, '옥수수전분', '12g'),
       (1502, '버터', '18g'),
       (1502, '생크림', '200g'),
       (1502, '코팅용초콜릿', '150g'),
       (1502, '아몬드 슬라이스', '50g'),
       (1502, '냉동딸기', '100g'),
       (1502, '설탕', '60g'),
       (1502, '레몬즙', '약간'),
       (1502, '플레인 요거트', '100g'),
       (1502, '우유', '150ml'),
       (1502, '얼음', '50g');

-- 1503
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1503, '땅콩', '2종이컵'),
       (1503, '소금', '1숟가락'),
       (1503, '설탕', '1숟가락'),
       (1503, '식용유', '4숟가락');

-- 1504
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1504, '소고기 다짐육', '150g'),
       (1504, '만두피', '10장'),
       (1504, '양파', '1/4개'),
       (1504, '피망', '1/4개'),
       (1504, '토마토소스', '7큰술'),
       (1504, '올리브오일', '1큰술'),
       (1504, '식용유', '2큰술');

-- 1505
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1505, '돼지목살', '400g'),
       (1505, '레드향', '1개'),
       (1505, '설탕', '1숟가락'),
       (1505, '소금', '약간'),
       (1505, '후추', '약간'),
       (1505, '맛술', '1숟가락'),
       (1505, '레드향', '1개'),
       (1505, '간장', '1숟가락'),
       (1505, '설탕', '1숟가락'),
       (1505, '머스터드', '1/2숟가락');

-- 1506
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1506, '다이제', '6개'),
       (1506, '녹인 무염버터', '25g'),
       (1506, '크림치즈', '200g'),
       (1506, '설탕', '80g'),
       (1506, '플레인요거트', '100g'),
       (1506, '생크림', '200g'),
       (1506, '레몬즙', '2큰술'),
       (1506, '판젤라틴', '7g'),
       (1506, '라즈베리퓨레', '60g'),
       (1506, '딸기퓨레', '60g'),
       (1506, '설탕', '20g'),
       (1506, '레몬즙', '5g'),
       (1506, '판젤라틴', '5g');

-- 1507
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1507, '팽이버섯', '200g'),
       (1507, '두반장', '2숟가락'),
       (1507, '건고추', '2개'),
       (1507, '다진 마늘', '1숟가락'),
       (1507, '대파', '1대'),
       (1507, '물', '1숟가락'),
       (1507, '홍고추', '1개'),
       (1507, '고추기름', '2숟가락'),
       (1507, '식용유', '2숟가락'),
       (1507, '간장', '1/2숟가락'),
       (1507, '식초', '1숟가락'),
       (1507, '맛술', '1숟가락');

-- 1508
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1508, '버터', '60g'),
       (1508, '피넛버터', '75g'),
       (1508, '설탕', '45g'),
       (1508, '황설탕', '45g'),
       (1508, '달걀', '30g'),
       (1508, '박력분', '80g'),
       (1508, '베이킹파우더', '2g'),
       (1508, '소금', '약간'),
       (1508, '그래놀라', '50g');

-- 1509
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1509, '빠네', '1개'),
       (1509, '버터', '1/2종이컵'),
       (1509, '다진 마늘', '2숟가락'),
       (1509, '크림치즈', '5숟가락'),
       (1509, '꿀', '2숟가락'),
       (1509, '파슬리 가루', '약간'),
       (1509, '휘핑크림', '적당량'),
       (1509, '캐러멜 소스', '적당량'),
       (1509, '아몬드 슬라이스', '약간');

-- 1510
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1510, '불린 쌀', '30g'),
       (1510, '닭고기 안심', '20g'),
       (1510, '물', '250ml'),
       (1510, '불린 쌀', '30g'),
       (1510, '닭안심', '20g'),
       (1510, '단호박', '10g'),
       (1510, '물', '250ml'),
       (1510, '불린 쌀', '30g'),
       (1510, '닭안심', '20g'),
       (1510, '애호박', '10g'),
       (1510, '물', '250ml');

-- 1511
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1511, '주꾸미', '200g'),
       (1511, '냉이', '100g'),
       (1511, '소금', '1숟가락'),
       (1511, '밀가루', '적당량'),
       (1511, '올리브오일', '4숟가락'),
       (1511, '간 검정깨', '2숟가락'),
       (1511, '레몬즙', '1숟가락'),
       (1511, '설탕', '1숟가락'),
       (1511, '땅콩버터', '1숟가락'),
       (1511, '후추', '약간'),
       (1511, '주꾸미', '300g'),
       (1511, '칼국수', '1인분'),
       (1511, '애호박', '1/4개'),
       (1511, '당근', '1/4개'),
       (1511, '대파', '1/2대'),
       (1511, '부추', '적당량'),
       (1511, '참기름', '약간'),
       (1511, '소금', '1숟가락'),
       (1511, '밀가루', '적당량'),
       (1511, '식용유', '약간'),
       (1511, '페페론치노', '약간'),
       (1511, '고추장', '1숟가락'),
       (1511, '간장', '3숟가락'),
       (1511, '고춧가루', '3숟가락'),
       (1511, '다진마늘', '1숟가락'),
       (1511, '청주', '1숟가락'),
       (1511, '후추', '약간'),
       (1511, '주꾸미', '400g'),
       (1511, '봄동', '1/2개'),
       (1511, '무', '1토막'),
       (1511, '숙주', '1줌'),
       (1511, '미나리', '1줌'),
       (1511, '홍고추', '1개'),
       (1511, '청양고추', '1개'),
       (1511, '대파', '1/2대'),
       (1511, '느타리버섯', '1/2개'),
       (1511, '멸치 다시마 육수', '1L'),
       (1511, '간장', '1숟가락'),
       (1511, '맛술', '1숟가락'),
       (1511, '후추', '약간'),
       (1511, '소금', '1/2숟가락'),
       (1511, '간장', '1숟가락'),
       (1511, '레몬즙', '1숟가락'),
       (1511, '고추냉이', '약간');

-- 1512
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1512, '통 더덕', '2개'),
       (1512, '마늘', '1쪽'),
       (1512, '설탕', '5g'),
       (1512, '식초', '5ml'),
       (1512, '대파', '1토막'),
       (1512, '소금', '5g'),
       (1512, '깨소금', '5g'),
       (1512, '고춧가루', '20g');

-- 1513
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1513, '수프 가루', '1봉'),
       (1513, '육포', '1조각'),
       (1513, '감자칩', '1종이컵'),
       (1513, '뜨거운 물', '1+1/2종이컵'),
       (1513, '꿀호떡', '2개'),
       (1513, '반숙란', '1개'),
       (1513, '소시지', '1개'),
       (1513, '슬라이스 치즈', '2장');

-- 1514
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1514, '무염버터', '50g'),
       (1514, '황설탕', '45g'),
       (1514, '달걀', '25g'),
       (1514, '소금', '1꼬집'),
       (1514, '바닐라익스트랙', '약간'),
       (1514, '박력분', '80g'),
       (1514, '베이킹소다', '1/4t'),
       (1514, '초코칩', '20g'),
       (1514, '무염버터', '50g'),
       (1514, '황설탕', '45g'),
       (1514, '달걀', '25g'),
       (1514, '소금', '1꼬집'),
       (1514, '바닐라익스트랙', '약간'),
       (1514, '박력분', '70g'),
       (1514, '코코아파우더', '10g'),
       (1514, '베이킹소다', '1/4t'),
       (1514, '초코칩', '20g');

-- 1515
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1515, '스파게티', '1인분'),
       (1515, '새우', '3마리'),
       (1515, '바지락', '7개'),
       (1515, '방울토마토', '5개'),
       (1515, '마늘', '3쪽'),
       (1515, '페페론치노', '2개'),
       (1515, '화이트와인', '1/2종이컵'),
       (1515, '소금', '약간'),
       (1515, '후추', '약간'),
       (1515, '올리브 오일', '약간'),
       (1515, '파마산 치즈', '약간'),
       (1515, '냉이', '1줌'),
       (1515, '올리브 오일', '1/2종이컵'),
       (1515, '파마산치즈가루', '1종이컵'),
       (1515, '소금', '약간'),
       (1515, '후추', '약간');

-- 1516
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1516, '황태채', '100g'),
       (1516, '꽈리고추', '1종이컵'),
       (1516, '통깨', '약간'),
       (1516, '간장', '2숟가락'),
       (1516, '설탕', '1숟가락'),
       (1516, '맛술', '2숟가락'),
       (1516, '다진 마늘', '1/2숟가락'),
       (1516, '다진 대파', '1숟가락'),
       (1516, '참기름', '1숟가락'),
       (1516, '후추', '약간');

-- 1517
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1517, '소고기 다짐육', '250g'),
       (1517, '돼지고기 다짐육', '150g'),
       (1517, '베이컨', '2장'),
       (1517, '달걀', '1개'),
       (1517, '당근', '1조각'),
       (1517, '샐러리', '2줄기'),
       (1517, '양파', '1/2개'),
       (1517, '식빵', '2장'),
       (1517, '머스터드', '1/3숟가락'),
       (1517, '토마토케첩', '2숟가락'),
       (1517, '타바스코 소스', '1/3숟가락'),
       (1517, '타임', '약간'),
       (1517, '소금', '약간'),
       (1517, '후추', '약간'),
       (1517, '토마토케첩', '4숟가락'),
       (1517, '우스터 소스', '1숟가락'),
       (1517, '머스터드', '1숟가락'),
       (1517, '올리고당', '1+1/2숟가락'),
       (1517, '토마토 소스', '1종이컵'),
       (1517, '다진 양파', '4숟가락'),
       (1517, '다진 마늘', '1숟가락'),
       (1517, '바질 가루', '약간'),
       (1517, '크러쉬드페퍼', '1/3숟가락'),
       (1517, '올리브유', '1숟가락');

-- 1518
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1518, '달걀흰자', '110g'),
       (1518, '설탕', '40g'),
       (1518, '아몬드가루', '75g'),
       (1518, '슈가파우더', '55g'),
       (1518, '박력분', '20g'),
       (1518, '설탕', '100g'),
       (1518, '생크림', '100g'),
       (1518, '소금', '1꼬집'),
       (1518, '버터', '150g'),
       (1518, '설탕', '75g'),
       (1518, '달걀노른자', '45g'),
       (1518, '물', '30g');

-- 1519
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1519, '닭정육', '200g'),
       (1519, '밥', '2공기'),
       (1519, '양파', '1/2개'),
       (1519, '식용유', '적당량'),
       (1519, '간장', '1/2종이컵'),
       (1519, '황설탕', '1/4종이컵'),
       (1519, '물엿', '5숟가락'),
       (1519, '다진 마늘', '2숟가락'),
       (1519, '생강즙', '1숟가락'),
       (1519, '후추', '약간'),
       (1519, '핫 소스', '1숟가락'),
       (1519, '고추기름', '6숟가락'),
       (1519, '고운 고춧가루', '3숟가락'),
       (1519, '물엿', '5숟가락'),
       (1519, '다진 마늘', '2숟가락'),
       (1519, '생강즙', '1숟가락'),
       (1519, '마자오', '2g'),
       (1519, '화자오', '2g'),
       (1519, '팔각 가루', '약간'),
       (1519, '굴 소스', '3숟가락'),
       (1519, '꿀', '1숟가락'),
       (1519, '마요네즈', '7숟가락'),
       (1519, '마라 소스', '3숟가락');

-- 1520
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1520, '양송이버섯', '넉넉히'),
       (1520, '다진돼지고기', '300g'),
       (1520, '빵가루', '적당량'),
       (1520, '베이컨', '3줄'),
       (1520, '식용유', '약간'),
       (1520, '굴소스', '2숟가락'),
       (1520, '맛술', '1숟가락'),
       (1520, '설탕', '1숟가락'),
       (1520, '다진마늘', '1숟가락'),
       (1520, '소금', '약간'),
       (1520, '후추', '약간');

-- 1521
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1521, '도토리묵', '1모'),
       (1521, '달래', '30g'),
       (1521, '김가루', '약간'),
       (1521, '통깨', '약간'),
       (1521, '간장', '3숟가락'),
       (1521, '고춧가루', '1숟가락'),
       (1521, '설탕', '1숟가락'),
       (1521, '다진 마늘', '1숟가락'),
       (1521, '참기름', '1숟가락'),
       (1521, '통깨', '1/2숟가락');

-- 1522
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1522, '마카롱믹스', '220g'),
       (1522, '화이트크림', '50g'),
       (1522, '짤주머니', '2장'),
       (1522, '마카롱 도안', '1장'),
       (1522, '따뜻한 물', '3큰술'),
       (1522, '초코잼', NULL),
       (1522, '초코펜', NULL),
       (1522, '스프링클', '적당량');

-- 1523
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1523, '불린 쌀', '30g'),
       (1523, '닭안심', '20g'),
       (1523, '당근', '10g'),
       (1523, '물', '250ml'),
       (1523, '불린 쌀', '30g'),
       (1523, '소안심', '20g'),
       (1523, '브로콜리', '10g'),
       (1523, '물', '250ml');

-- 1524
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1524, '곱창', '적당량'),
       (1524, '청주', '1숟가락'),
       (1524, '마늘', '10개'),
       (1524, '청양고추', '3개'),
       (1524, '곰탕라면 스프', '1/2개'),
       (1524, '후추', '약간'),
       (1524, '식용유', '약간'),
       (1524, '스파게티', '1인분'),
       (1524, '빵', '4조각');

-- 1525
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1525, '소고기', '100g'),
       (1525, '간장', '50ml'),
       (1525, '대파', '1토막'),
       (1525, '마늘', '2쪽'),
       (1525, '후추', '2g'),
       (1525, '설탕', '10g'),
       (1525, '깨소금', '5g'),
       (1525, '참기름', '10ml'),
       (1525, '배', '1/8개'),
       (1525, '식용유', '10ml'),
       (1525, '잣', '5개'),
       (1525, 'A4용지', '1장');

-- 1526
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1526, '카스텔라', '1개'),
       (1526, '연두부', '4모'),
       (1526, '크림치즈', '300g'),
       (1526, '초콜릿', '2개'),
       (1526, '설탕', '2숟가락'),
       (1526, '인스턴트커피가루', '3봉'),
       (1526, '뜨거운 물', '1/2종이컵');

-- 1527
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1527, '무염버터', '153g'),
       (1527, '흑설탕', '98g'),
       (1527, '설탕', '98g'),
       (1527, '달걀', '1개'),
       (1527, '페퍼민트 티백', '1개'),
       (1527, '중력분', '195g'),
       (1527, '코코아파우더', '15g'),
       (1527, '베이킹소다', '3g'),
       (1527, '소금', '1g'),
       (1527, '민트초콜릿', '130g');

-- 1528
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1528, '빠네 빵', '1개'),
       (1528, '소고기', '200g'),
       (1528, '양파', '1개'),
       (1528, '느타리 버섯', '1줌'),
       (1528, '발사믹비네거', '2숟가락'),
       (1528, '설탕', '1숟가락'),
       (1528, '베이컨', '2줄'),
       (1528, '체다치즈', '3장'),
       (1528, '올리브유', '약간'),
       (1528, '소금', '약간'),
       (1528, '후추', '약간'),
       (1528, '홀그레인', '2숟가락'),
       (1528, '마요네즈', '5숟가락'),
       (1528, '꿀', '1숟가락'),
       (1528, '소금', '약간'),
       (1528, '후추', '약간');

-- 1529
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1529, '두부', '1모'),
       (1529, '피망', '1/3개'),
       (1529, '파프리카', '1/3개'),
       (1529, '양파', '1/4개'),
       (1529, '비엔나소시지', '1종이컵'),
       (1529, '옥수수통조림', '3숟가락'),
       (1529, '피자치즈', '1종이컵'),
       (1529, '소금', '약간'),
       (1529, '후추', '약간'),
       (1529, '토마토소스', '4숟가락'),
       (1529, '파슬리가루', '약간');

-- 1530
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1530, '해물', '250g'),
       (1530, '표고버섯', '3개'),
       (1530, '대파', '1대'),
       (1530, '양파', '1/2개'),
       (1530, '떡볶이떡', '300g'),
       (1530, '참기름', '2/3숟가락'),
       (1530, '통깨', '약간'),
       (1530, '간장', '2숟가락'),
       (1530, '굴소스', '1숟가락'),
       (1530, '칠리소스', '1숟가락'),
       (1530, '설탕', '2/3숟가락'),
       (1530, '맛술', '2숟가락'),
       (1530, '다진 마늘', '1숟가락'),
       (1530, '물', '5숟가락'),
       (1530, '후추', '약간');

-- 1531
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1531, '우유', '60g'),
       (1531, '물', '90g'),
       (1531, '버터', '60g'),
       (1531, '소금', '1g'),
       (1531, '박력분', '90g'),
       (1531, '달걀', '160g'),
       (1531, '아몬드분태', '적당량'),
       (1531, '우유', '320g'),
       (1531, '생크림', '80g'),
       (1531, '바닐라빈', '1/2개'),
       (1531, '노른자', '88g'),
       (1531, '설탕', '88g'),
       (1531, '옥수수전분', '16g'),
       (1531, '박력분', '20g'),
       (1531, '버터', '25g'),
       (1531, '생크림', '200g'),
       (1531, '완성된크렘파티시엘', NULL);

-- 1532
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1532, '소고기', '400g'),
       (1532, '깻잎', '적당량'),
       (1532, '부추', '200g'),
       (1532, '들기름', '약간'),
       (1532, '소금', '약간'),
       (1532, '후추', '약간'),
       (1532, '멸치 다시마 육수', '2종이컵'),
       (1532, '된장', '3숟가락'),
       (1532, '쌈장', '1/2숟가락'),
       (1532, '고춧가루', '1숟가락'),
       (1532, '다진 마늘', '1숟가락'),
       (1532, '애호박', '1/4개'),
       (1532, '두부', '1/2모'),
       (1532, '청양고추', '1개'),
       (1532, '양파', '1/4개'),
       (1532, '땅콩버터', '4숟가락'),
       (1532, '식초', '1숟가락'),
       (1532, '설탕', '2숟가락'),
       (1532, '마요네즈', '1숟가락'),
       (1532, '부순 깨', '1숟가락');

-- 1533
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1533, '참치', '150g'),
       (1533, '양파', '1개'),
       (1533, '감자', '2개'),
       (1533, '대파', '1대'),
       (1533, '청양고추', '1개'),
       (1533, '홍고추', '1개'),
       (1533, '두부', '1/2모'),
       (1533, '물', '2종이컵'),
       (1533, '고추장', '2숟가락'),
       (1533, '설탕', '1/2숟가락'),
       (1533, '다진 마늘', '1숟가락'),
       (1533, '국간장', '2숟가락'),
       (1533, '맛술', '1숟가락'),
       (1533, '소금', '약간');

-- 1534
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1534, '쇠고기', '100g'),
       (1534, '우동면', '1개'),
       (1534, '양파', '1/4개'),
       (1534, '대파', '1/2대'),
       (1534, '고형카레', '1조각'),
       (1534, '멸치다시마육수', '2종이컵'),
       (1534, '맛술', '1숟가락'),
       (1534, '소금', '약간'),
       (1534, '후추', '약간');

-- 1535
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1535, '감자튀김', '적당량'),
       (1535, '베이컨', '5줄'),
       (1535, '꿀', '3숟가락'),
       (1535, '파마산 치즈가루', '1숟가락'),
       (1535, '파슬리 가루', '약간'),
       (1535, '식용유', '약간'),
       (1535, '우유', '1종이컵'),
       (1535, '설탕', '1숟가락'),
       (1535, '슬라이스 치즈', '5장'),
       (1535, '다진 마늘', '1/2숟가락'),
       (1535, '소금', '약간');

-- 1536
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1536, '불린 쌀', '30g'),
       (1536, '소안심', '20g'),
       (1536, '무', '20g'),
       (1536, '물', '300ml'),
       (1536, '불린 쌀', '30g'),
       (1536, '소안심', '20g'),
       (1536, '애호박', '10g'),
       (1536, '물', '250ml'),
       (1536, '불린 쌀', '30g'),
       (1536, '소안심', '20g'),
       (1536, '단호박', '10g'),
       (1536, '물', '250ml');

-- 1537
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1537, '달걀', '3개'),
       (1537, '생크림', '4숟가락'),
       (1537, '설탕', '4숟가락'),
       (1537, '버터', '약간'),
       (1537, '메이플 시럽', '적당량'),
       (1537, '과일', '적당량');

-- 1538
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1538, '오징어', '1마리'),
       (1538, '소금', '5g'),
       (1538, '진간장', '10ml'),
       (1538, '설탕', '20g'),
       (1538, '참기름', '10ml'),
       (1538, '깨소금', '5g'),
       (1538, '청고추', '1개'),
       (1538, '홍고추', '1개'),
       (1538, '양파', '1/3개'),
       (1538, '마늘', '2쪽'),
       (1538, '대파', '1토막'),
       (1538, '생강', '5g'),
       (1538, '고춧가루', '15g'),
       (1538, '고추장', '50g'),
       (1538, '후추', '2g'),
       (1538, '식용유', '30ml');

-- 1539
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1539, '인절미떡', '3개'),
       (1539, '꿀', '1숟가락'),
       (1539, '소시지', '2개'),
       (1539, '스트링치즈', '1/2개'),
       (1539, '감자', '1개'),
       (1539, '다진 양파', '1/4개'),
       (1539, '마요네즈', '3숟가락'),
       (1539, '설탕', '1숟가락'),
       (1539, '소금', '약간'),
       (1539, '후추', '약간'),
       (1539, '고구마', '1개'),
       (1539, '마요네즈', '2숟가락'),
       (1539, '요거트', '2숟가락'),
       (1539, '꿀', '1숟가락'),
       (1539, '소금', '약간'),
       (1539, '밥', '3숟가락'),
       (1539, '스팸', '1조각'),
       (1539, '소고기', '30g'),
       (1539, '올리브유', '1/2숟가락'),
       (1539, '고수 뿌리', '1개'),
       (1539, '후추', '약간'),
       (1539, '소금', '약간');

-- 1540
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1540, '새우', '8마리'),
       (1540, '아보카도', '1개'),
       (1540, '샐러리', '1대'),
       (1540, '마요네즈', '3숟가락'),
       (1540, '연유', '2숟가락'),
       (1540, '레몬즙', '1숟가락'),
       (1540, '홀그레인머스터드', '1/2숟가락'),
       (1540, '소금', '약간'),
       (1540, '후추', '약간');

-- 1541
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1541, '대패삼겹살', '100g'),
       (1541, '떡볶이 떡', '2종이컵'),
       (1541, '어묵', '2장'),
       (1541, '양파', '1/4개'),
       (1541, '대파', '1/2대'),
       (1541, '물', '3종이컵'),
       (1541, '식용유', '약간'),
       (1541, '고추장', '3숟가락'),
       (1541, '고춧가루', '1/2숟가락'),
       (1541, '설탕', '1숟가락'),
       (1541, '청주', '1숟가락'),
       (1541, '다진 마늘', '1숟가락'),
       (1541, '소금', '약간'),
       (1541, '참기름', '약간'),
       (1541, '후추', '약간');

-- 1542
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1542, '우엉', '300g'),
       (1542, '전분가루', '2숟가락'),
       (1542, '땅콩', '1/3종이컵'),
       (1542, '간장', '1+1/2숟가락'),
       (1542, '설탕', '1숟가락'),
       (1542, '올리고당', '2숟가락'),
       (1542, '맛술', '1숟가락'),
       (1542, '참기름', '1/2숟가락');

-- 1543
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1543, '생닭', '1kg'),
       (1543, '소금', '약간'),
       (1543, '찹쌀 밥', '1공기'),
       (1543, '참기름', '1/2숟가락'),
       (1543, '간장', '1/2숟가락'),
       (1543, '물', '3리터'),
       (1543, '소금', '1/2숟가락'),
       (1543, '대파', '1대'),
       (1543, '통후추', '5알'),
       (1543, '고추기름', '1/2숟가락'),
       (1543, '간장', '2숟가락'),
       (1543, '식초', '1숟가락'),
       (1543, '설탕', '1숟가락'),
       (1543, '연겨자', '약간');

-- 1544
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1544, '만두', '8개'),
       (1544, '달걀', '2개'),
       (1544, '튀김가루', '1/2종이컵'),
       (1544, '빵가루', '1종이컵'),
       (1544, '마요네즈', '6숟가락'),
       (1544, '다진 피클', '1숟가락'),
       (1544, '다진 양파', '2숟가락'),
       (1544, '레몬즙', '1숟가락'),
       (1544, '꿀', '2숟가락'),
       (1544, '후추', '약간'),
       (1544, '파슬리가루', '약간');

-- 1545
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1545, '제누와즈 1호', '2cm 두께 3장'),
       (1545, '마라시노체리', '6개'),
       (1545, '시럽', '100g'),
       (1545, '달걀흰자', '140g'),
       (1545, '설탕', '170g'),
       (1545, '물', '50g'),
       (1545, '무염버터', '450g'),
       (1545, '바닐라익스트랙', '약간'),
       (1545, '색소', '약간');

-- 1546
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1546, '애호박', '1개'),
       (1546, '양파', '1/4개'),
       (1546, '명란', '1+1/2숟가락'),
       (1546, '편마늘', '2숟가락'),
       (1546, '맛술', '1숟가락'),
       (1546, '참기름', '1숟가락'),
       (1546, '홍고추', '1/2개');

-- 1547
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1547, '식빵', '8장'),
       (1547, '양배추', '5장'),
       (1547, '당근', '1/4개'),
       (1547, '양파', '1/2개'),
       (1547, '부추', '1줌'),
       (1547, '달걀', '1개'),
       (1547, '빵가루', '적당량'),
       (1547, '식용유', '약간'),
       (1547, '카레 가루', '4숟가락'),
       (1547, '물', '2숟가락'),
       (1547, '굴 소스', '1숟가락'),
       (1547, '소금', '약간'),
       (1547, '후추', '약간');

-- 1548
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1548, '진저브레드쿠키믹스', '250g'),
       (1548, '초코펜 다크', '1개'),
       (1548, '쿠키커터', '1개'),
       (1548, '달걀노른자', '1개'),
       (1548, '식용유', '80ml'),
       (1548, '우유', '15ml');

-- 1549
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1549, '꽃게', '450g'),
       (1549, '양파', '1/4개'),
       (1549, '청양고추', '1개'),
       (1549, '대파', '1/2대'),
       (1549, '통깨', '약간'),
       (1549, '고춧가루', '5숟가락'),
       (1549, '간장', '3숟가락'),
       (1549, '다진 마늘', '1숟가락'),
       (1549, '맛술', '1숟가락'),
       (1549, '고추장', '2숟가락'),
       (1549, '올리고당', '2숟가락'),
       (1549, '설탕', '1숟가락');

-- 1550
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1550, '불린 쌀', '30g'),
       (1550, '소안심', '20g'),
       (1550, '물', '250ml'),
       (1550, '불린 쌀', '30g'),
       (1550, '소안심', '20g'),
       (1550, '청경채', '10g'),
       (1550, '물', '250ml'),
       (1550, '불린 쌀', '30g'),
       (1550, '소안심', '20g'),
       (1550, '양배추', '10g'),
       (1550, '물', '250ml');

-- 1551
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1551, '족발', '1팩'),
       (1551, '곰탕 라면', '1개'),
       (1551, '반숙란', '1개'),
       (1551, '된장', '1숟가락'),
       (1551, '대파', '1대'),
       (1551, '물', '2+1/2종이컵');

-- 1552
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1552, '더덕', '3개'),
       (1552, '진간장', '10ml'),
       (1552, '대파', '1토막'),
       (1552, '마늘', '1쪽'),
       (1552, '고추장', '30g'),
       (1552, '설탕', '5g'),
       (1552, '깨소금', '5g'),
       (1552, '참기름', '10ml'),
       (1552, '소금', '10g'),
       (1552, '식용유', '10ml');

-- 1553
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1553, '무염버터', '115g'),
       (1553, '황설탕', '100g'),
       (1553, '물엿', '15g'),
       (1553, '달걀', '1개'),
       (1553, '바닐라익스트랙', '1t'),
       (1553, '중력분', '100g'),
       (1553, '통밀가루', '55g'),
       (1553, '카카오닙스', '50g'),
       (1553, '베이킹파우더', '2g'),
       (1553, '소금', '1g'),
       (1553, '몰티져스', '적당량');

-- 1554
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1554, '라면', '1개'),
       (1554, '대파', '1대'),
       (1554, '편마늘', '1숟가락'),
       (1554, '양파', '1/4개'),
       (1554, '해물', '1종이컵'),
       (1554, '간장', '1숟가락'),
       (1554, '땅콩버터', '1숟가락'),
       (1554, '맛술', '1숟가락'),
       (1554, '설탕', '1/2숟가락'),
       (1554, '스리라차소스', '1숟가락'),
       (1554, '쪽파', '1줄기'),
       (1554, '통깨', '약간');

-- 1555
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1555, '두릅', '5개'),
       (1555, '다진소고기', '100g'),
       (1555, '밥', '1공기'),
       (1555, '소금', '약간'),
       (1555, '참기름', '1/2숟가락'),
       (1555, '간장', '1숟가락'),
       (1555, '다진 마늘', '1/2숟가락'),
       (1555, '맛술', '1숟가락'),
       (1555, '설탕', '1/3숟가락'),
       (1555, '참기름', '1/2숟가락'),
       (1555, '통깨', '약간'),
       (1555, '고추장', '1숟가락'),
       (1555, '올리고당', '1숟가락'),
       (1555, '참기름', '1/2숟가락');

-- 1556
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1556, '간장', '1종이컵'),
       (1556, '설탕', '1/2종이컵'),
       (1556, '식초', '1/4종이컵'),
       (1556, '물', '2종이컵'),
       (1556, '마늘', '5통'),
       (1556, '통후추', '5알'),
       (1556, '건고추', '1개'),
       (1556, '설탕', '1/2종이컵'),
       (1556, '식초', '1/3종이컵'),
       (1556, '다시마', '4조각'),
       (1556, '소금', '1/4숟가락'),
       (1556, '새우', '4마리'),
       (1556, '단촛물', '1/2종이컵'),
       (1556, '밥', '4공기'),
       (1556, '고추냉이', '');

-- 1557
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1557, '모시조개', '300g'),
       (1557, '마늘', '5개'),
       (1557, '양파', '1/4개'),
       (1557, '올리브오일', '5숟가락'),
       (1557, '페페론치노', '5개'),
       (1557, '소금', '적당량'),
       (1557, '후추', '약간'),
       (1557, '밀가루', '2종이컵'),
       (1557, '소금', '약간'),
       (1557, '따뜻한물', '1/2종이컵'),
       (1557, '올리브오일', '1숟가락');

-- 1558
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1558, '귤', '적당량'),
       (1558, '청포도', '적당량'),
       (1558, '블루베리', '적당량'),
       (1558, '설탕', '2종이컵'),
       (1558, '물', '1종이컵'),
       (1558, '물엿', '2숟가락');

-- 1559
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1559, '달걀흰자', '140g'),
       (1559, '설탕', '270g'),
       (1559, '레몬즙', '약간'),
       (1559, '색소', '약간');

-- 1560
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1560, '감자', '6개'),
       (1560, '달걀', '4개'),
       (1560, '당근', '1/2개'),
       (1560, '청양고추', '3개'),
       (1560, '마요네즈', '10숟가락'),
       (1560, '머스터드', '3숟가락'),
       (1560, '후추', '약간');

-- 1561
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1561, '낙지', '4마리'),
       (1561, '소금', '적당량'),
       (1561, '참기름', '2숟가락'),
       (1561, '쪽파', '2줄'),
       (1561, '통깨', '약간'),
       (1561, '고추장', '4숟가락'),
       (1561, '고춧가루', '1숟가락'),
       (1561, '다진 마늘', '1숟가락'),
       (1561, '올리고당', '2숟가락'),
       (1561, '맛술', '1숟가락'),
       (1561, '참기름', '약간');

-- 1562
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1562, '두부', '1모'),
       (1562, '간장', '1종이컵'),
       (1562, '올리고당', '1/2종이컵'),
       (1562, '매실액', '1/2종이컵'),
       (1562, '물', '1/2종이컵'),
       (1562, '다진 마늘', '1숟가락'),
       (1562, '후추', '약간'),
       (1562, '통깨', '1/2숟가락'),
       (1562, '양파', '1/4개'),
       (1562, '청양고추', '1개'),
       (1562, '홍고추', '1개');

-- 1563
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1563, '양파', '1/2개'),
       (1563, '마늘', '2개'),
       (1563, '새우', '1종이컵'),
       (1563, '스파게티면', '1인분'),
       (1563, '소금', '약간'),
       (1563, '후추', '약간'),
       (1563, '올리브유', '적당량'),
       (1563, '시금치', '1줌'),
       (1563, '우유', '1종이컵'),
       (1563, '생크림', '1/2종이컵'),
       (1563, '파마산치즈가루', '약간');

-- 1564
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1564, '사과', '20g'),
       (1564, '불린 쌀', '30g'),
       (1564, '물', '400ml'),
       (1564, '배', '20g'),
       (1564, '불린 쌀', '30g'),
       (1564, '물', '400ml');

-- 1565
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1565, '박력분', '75g'),
       (1565, '중력분', '60g'),
       (1565, '베이킹파우더', '1/3숟가락'),
       (1565, '설탕', '25g'),
       (1565, '소금', '약간'),
       (1565, '달걀', '1개'),
       (1565, '우유', '2/3종이컵'),
       (1565, '녹인버터', '15g'),
       (1565, '바닐라에센스', '약간'),
       (1565, '체다치즈', '3장'),
       (1565, '소시지', '2개');

-- 1566
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1566, '소고기', '90g'),
       (1566, '배', '1/4개'),
       (1566, '잣', '5개'),
       (1566, '소금', '5g'),
       (1566, '마늘', '3쪽'),
       (1566, '대파', '2토막'),
       (1566, '검은 후추가루', '2g'),
       (1566, '참기름', '10ml'),
       (1566, '설탕', '30g'),
       (1566, '깨소금', '5g'),
       (1566, 'A4용지', '1장');

-- 1567
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1567, '돼지고기앞다리살', '300g'),
       (1567, '파채', '1줌'),
       (1567, '콩나물', '1줌'),
       (1567, '참기름', '약간'),
       (1567, '통깨', '약간'),
       (1567, '간장', '3숟가락'),
       (1567, '고추장', '2숟가락'),
       (1567, '올리고당', '3숟가락'),
       (1567, '고춧가루', '2숟가락'),
       (1567, '다진 마늘', '1숟가락'),
       (1567, '매실액', '1숟가락'),
       (1567, '맛술', '1숟가락'),
       (1567, '후추', '약간');

-- 1568
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1568, '불닭 볶음면', '1개'),
       (1568, '달걀', '5개'),
       (1568, '소금', '약간'),
       (1568, '후추', '약간'),
       (1568, '식용유', '약간'),
       (1568, '피자 치즈', '1개'),
       (1568, '소시지', '1개');

-- 1569
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1569, '대파', '3대'),
       (1569, '대패 삼겹살', '200g'),
       (1569, '페퍼론치노', '5개'),
       (1569, '소금', '약간'),
       (1569, '후추', '약간'),
       (1569, '식용유', '약간'),
       (1569, '간장', '1숟가락'),
       (1569, '설탕', '1숟가락'),
       (1569, '미림', '1숟가락'),
       (1569, '청주', '1숟가락'),
       (1569, '베이컨', '적당량');

-- 1570
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1570, '돼지고기 뒷다리살', '300g'),
       (1570, '버터', '2숟가락'),
       (1570, '다진 마늘', '1숟가락'),
       (1570, '양파', '1개'),
       (1570, '샐러리', '1/2대'),
       (1570, '큐민가루', '1/2작은술'),
       (1570, '바질', '2잎'),
       (1570, '넛맥', '1/2작은술'),
       (1570, '후추가루', '약간'),
       (1570, '황설탕', '1숟가락'),
       (1570, '파프리카 파우더', '1/4숟가락'),
       (1570, '고운 고춧가루', '1/2숟가락'),
       (1570, '우스타 소스', '1숟가락'),
       (1570, '토마토', '2개'),
       (1570, '홀 토마토', '1/2캔'),
       (1570, '믹서로 간 빨강 파프리카', '1/2개'),
       (1570, '당근', '1/2개'),
       (1570, '감자', '1개'),
       (1570, '물', '2종이컵'),
       (1570, '월계수잎', '1장'),
       (1570, '소금', '1/4숟가락'),
       (1570, '케첩', '1숟가락'),
       (1570, '사워크림', '적당량'),
       (1570, '케첩', '적당량'),
       (1570, '타임', '3줄기');

-- 1571
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1571, '진미채', '150g'),
       (1571, '다진마늘', '1숟가락'),
       (1571, '고추장', '3숟가락'),
       (1571, '고춧가루', '2+1/2숟가락'),
       (1571, '유자청', '3숟가락'),
       (1571, '올리고당', '1숟가락'),
       (1571, '통깨', '약간');

-- 1572
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1572, '박력분', '180g'),
       (1572, '발효버터', '90g'),
       (1572, '달걀노른자', '24g'),
       (1572, '물', '36g'),
       (1572, '소금', '2g'),
       (1572, '달걀', '165g'),
       (1572, '설탕', '225g'),
       (1572, '옥수수전분', '10g'),
       (1572, '레몬즙', '120g'),
       (1572, '무염버터', '100g'),
       (1572, '레몬제스트', '2개분'),
       (1572, '달걀흰자', '95g'),
       (1572, '설탕', '21g'),
       (1572, '설탕', '140g'),
       (1572, '물', '50g');

-- 1573
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1573, '설탕', '2종이컵'),
       (1573, '소다', '1/6숟가락'),
       (1573, '스콘', '2개'),
       (1573, '우유', '3종이컵'),
       (1573, '커피', '1/4종이컵'),
       (1573, '얼그레이', '2개');

-- 1574
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1574, '달걀흰자', '100g'),
       (1574, '설탕', '110g'),
       (1574, '레몬즙', '약간');

-- 1575
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1575, '밥', '1+1/2공기'),
       (1575, '김치', '1종이컵'),
       (1575, '돼지고기앞다리살', '100g'),
       (1575, '멸치다시백', '1개'),
       (1575, '물', '4종이컵'),
       (1575, '달걀', '2개'),
       (1575, '고춧가루', '1숟가락'),
       (1575, '국간장', '1숟가락'),
       (1575, '다진마늘', '1/2숟가락'),
       (1575, '소금', '약간');

-- 1576
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1576, '콜리플라워', '10g'),
       (1576, '불린 쌀', '30g'),
       (1576, '물', '400ml'),
       (1576, '불린 쌀', '30g'),
       (1576, '청경채', '10g'),
       (1576, '물', '400ml'),
       (1576, '배추', '20g'),
       (1576, '불린 쌀', '30g'),
       (1576, '물', '400ml');

-- 1577
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1577, '다이제 스티브', '150g'),
       (1577, '녹인 무염버터', '45g'),
       (1577, '우유', '450g'),
       (1577, '다크초콜릿커버춰', '112g'),
       (1577, '달걀노른자', '4개'),
       (1577, '황설탕', '90g'),
       (1577, '옥수수전분', '22g'),
       (1577, '소금', '약간'),
       (1577, '바닐라익스트랙', '약간'),
       (1577, '생크림', '250g'),
       (1577, '설탕', '20g');

-- 1578
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1578, '삼겹살', '2kg'),
       (1578, '소금', '1숟가락'),
       (1578, '후추', '1숟가락'),
       (1578, '흑설탕', '1숟가락'),
       (1578, '파프리카가루', '1숟가락'),
       (1578, '오레가노', '1/4숟가락'),
       (1578, '바질', '1/4숟가락'),
       (1578, '케찹', '4숟가락'),
       (1578, '우스타소스', '1숟가락'),
       (1578, '물엿', '1숟가락');

-- 1579
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1579, '옛날국수 소면', '100g'),
       (1579, '양파', '1/4개'),
       (1579, '당근', '1/8개'),
       (1579, '대파 또는 부추', '20g'),
       (1579, '통깨', '1/2작은숟가락'),
       (1579, '삼겹살 양파절임소스', '9숟가락'),
       (1579, '참기름', '3숟가락'),
       (1579, '꿀', '1숟가락'),
       (1579, '다진 마늘', '1작은숟가락');

-- 1580
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1580, '통도라지', '3개'),
       (1580, '소금', '5g'),
       (1580, '고추장', '20g'),
       (1580, '설탕', '10g'),
       (1580, '식초', '15ml'),
       (1580, '대파', '1토막'),
       (1580, '마늘', '1쪽'),
       (1580, '깨소금', '5g'),
       (1580, '고춧가루', '10g');

-- 1581
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1581, '묵은지', '10장'),
       (1581, '밥', '2공기'),
       (1581, '설탕', '1큰술'),
       (1581, '참기름', '1큰술'),
       (1581, '다진묵은지줄기', ''),
       (1581, '설탕', '약간'),
       (1581, '참기름', '2숟가락'),
       (1581, '통깨', '2숟가락'),
       (1581, '청양고추', '3개'),
       (1581, '다진 대파', '2숟가락'),
       (1581, '다진 마늘', '1숟가락'),
       (1581, '참기름', '1숟가락'),
       (1581, '깨', '2숟가락'),
       (1581, '된장', '4숟가락'),
       (1581, '고추장', '1숟가락');

-- 1582
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1582, '봄동', '300g'),
       (1582, '통깨', '약간'),
       (1582, '액젓', '2숟가락'),
       (1582, '고춧가루', '1숟가락'),
       (1582, '다진 마늘', '1/2숟가락'),
       (1582, '설탕', '1/2숟가락'),
       (1582, '매실액', '1/2숟가락'),
       (1582, '참기름', '1숟가락');

-- 1583
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1583, '건 미역', '20g'),
       (1583, '무', '200g'),
       (1583, '당근', '1/3개'),
       (1583, '소금', '1숟가락'),
       (1583, '다진 마늘', '1/2숟가락'),
       (1583, '식초', '2숟가락'),
       (1583, '통깨', '1숟가락'),
       (1583, '설탕', '1/2숟가락'),
       (1583, '연겨자', '1/2숟가락'),
       (1583, '소금', '약간'),
       (1583, '식초', '1숟가락'),
       (1583, '설탕', '1/2숟가락'),
       (1583, '소금', '1/2숟가락'),
       (1583, '매생이', '120g'),
       (1583, '굴', '150g'),
       (1583, '홍고추', '1개'),
       (1583, '부침가루', '2/3종이컵'),
       (1583, '물', '1종이컵'),
       (1583, '국간장', '1/2숟가락'),
       (1583, '밀가루', '적당량'),
       (1583, '식용유', '적당량'),
       (1583, '밥', '1공기'),
       (1583, '염장 다시마', '200g'),
       (1583, '낙지 젓갈', '5숟가락'),
       (1583, '통깨', '약간'),
       (1583, '고춧가루', '1/2숟가락'),
       (1583, '다진마늘', '1숟가락'),
       (1583, '다진청양고추', '1숟가락'),
       (1583, '다진양파', '1숟가락'),
       (1583, '부순깨', '약간'),
       (1583, '참기름', '약간');

-- 1584
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1584, '비빔라면', ''),
       (1584, '김칫국물', '1국자'),
       (1584, '비빔라면소스', ''),
       (1584, '식초', '1숟가락');

-- 1585
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1585, '밤', '100g'),
       (1585, '물', '200g'),
       (1585, '통팥조림', '100g'),
       (1585, '바닐라 아이스크림', '3스쿱'),
       (1585, '밤 팥 앙금 소스', '2숟가락');

-- 1586
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1586, '닭다리살', '300g'),
       (1586, '당근', '1/4개'),
       (1586, '양파', '1/2개'),
       (1586, '마늘', '5톨'),
       (1586, '샐러리', '1대'),
       (1586, '스트링치즈', '3개'),
       (1586, '로즈마리', '약간'),
       (1586, '올리브유', '약간'),
       (1586, '소금', '약간'),
       (1586, '후추', '약간'),
       (1586, '올리고당', '3숟가락');

-- 1587
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1587, '달걀노른자', '120g'),
       (1587, '설탕', '15g'),
       (1587, '꿀', '50g'),
       (1587, '달걀흰자', '160g'),
       (1587, '설탕', '80g'),
       (1587, '박력분', '70g'),
       (1587, '무염버터', '20g'),
       (1587, '우유', '30g'),
       (1587, '생크림', '300g'),
       (1587, '연유', '30g'),
       (1587, '설탕', '30g'),
       (1587, '바닐라빈', '1/2개');

-- 1588
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1588, '호떡 믹스', '1개'),
       (1588, '따뜻한 물', '1종이컵');

-- 1589
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1589, '대창', '250g'),
       (1589, '양파', '1/3개'),
       (1589, '꽈리고추', '2개'),
       (1589, '새송이버섯', '1/2개'),
       (1589, '달걀 노른자', '1개'),
       (1589, '밥', '1공기'),
       (1589, '고추냉이', '약간'),
       (1589, '식용유', '약간'),
       (1589, '데리야끼소스', '3숟가락'),
       (1589, '맛술', '1/2숟가락');

-- 1590
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1590, '청양고추', '4개'),
       (1590, '어묵', '2장'),
       (1590, '당근', '1/4개'),
       (1590, '김밥용김', '4장'),
       (1590, '밥', '3공기'),
       (1590, '참기름', '1숟가락'),
       (1590, '통깨', '1숟가락'),
       (1590, '간장', '2숟가락'),
       (1590, '검은깨', '1숟가락'),
       (1590, '소금', '약간');

-- 1591
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1591, '꼬막캔', '200g'),
       (1591, '중국당면', '150g'),
       (1591, '대파', '1대'),
       (1591, '양파', '1/3개'),
       (1591, '부추', '20g'),
       (1591, '고추기름', '2숟가락'),
       (1591, '식용유', '약간'),
       (1591, '마늘', '3톨'),
       (1591, '치킨파우더', '1숟가락'),
       (1591, '물', '2종이컵'),
       (1591, '간장', '1숟가락'),
       (1591, '굴소스', '1숟가락'),
       (1591, '맛술', '1숟가락'),
       (1591, '청주', '1숟가락'),
       (1591, '설탕', '1/2숟가락'),
       (1591, '고춧가루', '2숟가락'),
       (1591, '참기름', '약간'),
       (1591, '후추', '약간');

-- 1592
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1592, '브로콜리', '5g'),
       (1592, '불린 쌀', '1숟가락'),
       (1592, '생수', '10숟가락'),
       (1592, '불린 쌀', '30g'),
       (1592, '고구마', '20g'),
       (1592, '당근', '10g'),
       (1592, '물', '250ml'),
       (1592, '오이', '20g'),
       (1592, '불린 쌀', '30g'),
       (1592, '물', '400ml');

-- 1593
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1593, '인절미', '적당량'),
       (1593, '꿀', ''),
       (1593, '휘핑크림', ''),
       (1593, '우유', '');

-- 1594
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1594, '소고기', '80g'),
       (1594, '미나리', '30g'),
       (1594, '홍고추', '1개'),
       (1594, '달걀', '2개'),
       (1594, '고추장', '15g'),
       (1594, '식초', '5ml'),
       (1594, '설탕', '5g'),
       (1594, '소금', '5g'),
       (1594, '식용유', '10ml');

-- 1595
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1595, '떡국떡', '3종이컵'),
       (1595, '명란젓', '2개'),
       (1595, '달걀', '2개'),
       (1595, '멸치다시마육수', '4종이컵'),
       (1595, '대파', '1/2대'),
       (1595, '애호박', '1/4개'),
       (1595, '청양고추', '1개'),
       (1595, '홍고추', '1개'),
       (1595, '국간장', '1숟가락'),
       (1595, '만두', '4개'),
       (1595, '만개한알', '1알');

-- 1596
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1596, '김말이', '400g'),
       (1596, '물만두', '270g'),
       (1596, '떡볶이 떡', '300g'),
       (1596, '식용유', '적당량'),
       (1596, '다진 마늘', '1숟가락'),
       (1596, '꿀', '3숟가락'),
       (1596, '간장', '1/2숟가락'),
       (1596, '물', '3숟가락'),
       (1596, '파슬리 가루', '약간'),
       (1596, '고추장', '2숟가락'),
       (1596, '케첩', '2숟가락'),
       (1596, '설탕', '1숟가락'),
       (1596, '후추', '약간'),
       (1596, '물', '3숟가락'),
       (1596, '짜장 소스', '1봉'),
       (1596, '올리고당', '1숟가락'),
       (1596, '물', '4숟가락'),
       (1596, '간장', '1/2숟가락');

-- 1597
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1597, '킬바사소시지', '4개'),
       (1597, '불닭볶음면', '1봉'),
       (1597, '김치', '적당량'),
       (1597, '밥', '적당량'),
       (1597, '허니 머스터드', '적당량'),
       (1597, '할라피뇨소스', '적당량'),
       (1597, '체다치즈 소스', '적당량');

-- 1598
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1598, '참치 통조림', '1개'),
       (1598, '두부', '1모'),
       (1598, '양파', '1/4개'),
       (1598, '당근', '1/4개'),
       (1598, '전분 가루', '적당량'),
       (1598, '달걀', '1개'),
       (1598, '간장', '1/2숟가락'),
       (1598, '소금', '약간'),
       (1598, '후추', '약간'),
       (1598, '식용유', '약간');

-- 1599
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1599, '딸기', '300g'),
       (1599, '설탕', '20g'),
       (1599, '레몬즙', '20g'),
       (1599, '마스카포네 치즈', '90g'),
       (1599, '연유', '60g'),
       (1599, '생크림', '30g'),
       (1599, '레몬즙', '20g'),
       (1599, '애플민트', '약간');

-- 1600
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1600, '라면', '2개'),
       (1600, '대파', '1/4대'),
       (1600, '버터', '1숟가락'),
       (1600, '굴소스', '1숟가락'),
       (1600, '마요네즈', ''),
       (1600, '청양고추', '1개');

-- 1611
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1611, '닭봉', '500g'),
       (1611, '우유', '2종이컵'),
       (1611, '소금', '약간'),
       (1611, '후추', '약간'),
       (1611, '식용유', '적당량'),
       (1611, '핫 소스', '3숟가락'),
       (1611, '식초', '1숟가락'),
       (1611, '우스터소스', '1숟가락'),
       (1611, '파프리카 파우더', '1/2숟가락'),
       (1611, '칠리 파우더', '1/2숟가락'),
       (1611, '다진 마늘', '1/2숟가락'),
       (1611, '후추', '약간');

-- 1612
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1612, '생크림', '100g'),
       (1612, '설탕', '2숟가락'),
       (1612, '밤', '100g'),
       (1612, '황설탕', '30g'),
       (1612, '꿀', '2숟가락'),
       (1612, '식빵', '');

-- 1613
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1613, '오예스', '8개'),
       (1613, '초콜릿', ''),
       (1613, '생크림', '300g'),
       (1613, '다크초코릿', '80g');

-- 1614
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1614, '제누와즈 쇼콜라 1호', '1개'),
       (1614, '다크초콜릿', '80g'),
       (1614, '생크림', '80g'),
       (1614, '가나슈', '40g'),
       (1614, '생크림', '100g'),
       (1614, '생크림', '180g'),
       (1614, '연유', '20g'),
       (1614, '물', '60g'),
       (1614, '설탕', '30g');

-- 1615
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1615, '소고기', '300g'),
       (1615, '아스파라거스', '2개'),
       (1615, '방울토마토', '4개'),
       (1615, '마늘', '4개'),
       (1615, '버터', '1숟가락'),
       (1615, '소금', '약간'),
       (1615, '후추', '약간'),
       (1615, '올리브유', '1숟가락'),
       (1615, '로즈마리', '약간'),
       (1615, '간장', '2숟가락'),
       (1615, '굴소스', '1숟가락'),
       (1615, '맛술', '2숟가락'),
       (1615, '설탕', '2숟가락'),
       (1615, '물', '1/4종이컵');

-- 1616
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1616, '라면', '1개'),
       (1616, '라면스프', '1숟가락'),
       (1616, '3분 카레', '1개'),
       (1616, '슬라이스치즈', '1장'),
       (1616, '물', '2종이컵'),
       (1616, '파슬리가루', '약간');

-- 1617
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1617, '홍합', '400g'),
       (1617, '손질 오징어', '1마리'),
       (1617, '새우', '4마리'),
       (1617, '순토마토퓨레', '1.5컵'),
       (1617, '물', '2컵'),
       (1617, '양파', '1/2개'),
       (1617, '마늘', '3톨'),
       (1617, '청양고추', '1개'),
       (1617, '올리브오일', '2큰술'),
       (1617, '소금', '약간'),
       (1617, '이탈리안 파슬리', '약간'),
       (1617, '후추', '약간');

-- 1618
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1618, '날치알', '160g'),
       (1618, '크래미', '90g'),
       (1618, '깻잎', '10장'),
       (1618, '김밥용단무지', '7줄'),
       (1618, '오이', '1개'),
       (1618, '무순', '1/2팩'),
       (1618, '잘게 썬 김치', '1컵'),
       (1618, '들기름', '적당량'),
       (1618, '레몬주스', '2숟가락'),
       (1618, '밥', '4공기'),
       (1618, '설탕', '1/6숟가락'),
       (1618, '고춧가루', '1/6숟가락'),
       (1618, '다진마늘', '1/3숟가락'),
       (1618, '깨', '1/3숟가락'),
       (1618, '참기름', '1/3숟가락'),
       (1618, '고추장', '2숟가락'),
       (1618, '설탕', '1/3숟가락'),
       (1618, '다진마늘', '1/3숟가락'),
       (1618, '깨', '1/3숟가락'),
       (1618, '참기름', '1/3숟가락');

-- 1619
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1619, '양배추', '20g'),
       (1619, '불린 쌀', '30g'),
       (1619, '물', '400ml'),
       (1619, '무', '20g'),
       (1619, '불린 쌀', '30g'),
       (1619, '물', '400ml');

-- 1620
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1620, '박력분', '165g'),
       (1620, '설탕', '120g'),
       (1620, '흑설탕', '100g'),
       (1620, '코코아파우더', '63g'),
       (1620, '베이킹소다', '5g'),
       (1620, '기네스 맥주', '144g'),
       (1620, '다크초콜릿커버춰', '48g'),
       (1620, '달걀', '2개'),
       (1620, '버터밀크', '150g'),
       (1620, '포도씨유', '126g'),
       (1620, '바닐라익스트랙', '약간'),
       (1620, '슈가파우더', '130g'),
       (1620, '기네스 맥주', '1~2T');

-- 1621
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1621, '매생이', ''),
       (1621, '소금', ''),
       (1621, '스파게티면', '100g'),
       (1621, '매생이', '50g'),
       (1621, '방울토마토', '4개'),
       (1621, '마늘', '2쪽'),
       (1621, '페퍼론치노', '3개'),
       (1621, '올리브유', '약간'),
       (1621, '후추', '약간'),
       (1621, '달걀', '6개'),
       (1621, '매생이', '1/2종이컵'),
       (1621, '소금', '약간'),
       (1621, '맛술', '1/2숟가락'),
       (1621, '매생이', '50g'),
       (1621, '불린 쌀', '1+1/2종이컵'),
       (1621, '참기름', '2숟가락'),
       (1621, '물', '5종이컵'),
       (1621, '소금', '약간'),
       (1621, '국간장', '약간');

-- 1622
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1622, '소고기', '70g'),
       (1622, '두부', '30g'),
       (1622, '밀가루', '20g'),
       (1622, '달걀', '1개'),
       (1622, '대파', '1토막'),
       (1622, '후추', '2g'),
       (1622, '참기름', '5ml'),
       (1622, '소금', '5g'),
       (1622, '마늘', '1쪽'),
       (1622, '식용유', '30ml'),
       (1622, '깨소금', '5g'),
       (1622, '설탕', '5g');

-- 1623
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1623, '다진 소고기', '300g'),
       (1623, '다진 돼지고기', '100g'),
       (1623, '다진 양파', '3숟가락'),
       (1623, '다진 샐러리', '3숟가락'),
       (1623, '소금', '약간'),
       (1623, '후추', '약간'),
       (1623, '달걀', '1/2개'),
       (1623, '다진 마늘', '1/2숟가락'),
       (1623, '파마산 치즈가루', '2숟가락'),
       (1623, '빵가루', '4숟가락'),
       (1623, '양파', '1/4개'),
       (1623, '양송이버섯', '3개'),
       (1623, '표고버섯', '2개'),
       (1623, '케찹', '4숟가락'),
       (1623, '우스터소스', '3숟가락'),
       (1623, '다진마늘', '1숟가락'),
       (1623, '간장', '2숟가락'),
       (1623, '레드와인', '2숟가락'),
       (1623, '물', '2/3종이컵'),
       (1623, '소금', '약간'),
       (1623, '후추', '약간'),
       (1623, '식용유', '약간'),
       (1623, '달걀', '1개');

-- 1624
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1624, '귤', '10개'),
       (1624, '한천가루', '1숟가락'),
       (1624, '설탕', '1숟가락'),
       (1624, '올리고당', '3숟가락');

-- 1625
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1625, '오징어', '1마리'),
       (1625, '모시조개', '5개'),
       (1625, '대파', '1대'),
       (1625, '칵테일 새우', '5개'),
       (1625, '청경채', '2개'),
       (1625, '알배추', '1/8개'),
       (1625, '면', '2개'),
       (1625, '스프', '3개'),
       (1625, '다진마늘', '1숟가락'),
       (1625, '양파', '1/2개'),
       (1625, '식용유', '약간'),
       (1625, '청양고추', '2개'),
       (1625, '물', '5종이컵');

-- 1626
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1626, '밀크 초콜릿', '2종이컵'),
       (1626, '화이트초콜릿', '2종이컵'),
       (1626, '딸기 초콜릿', '2종이컵'),
       (1626, '파인애플', '3조각'),
       (1626, '딸기', '적당량'),
       (1626, '자몽', '1/2개'),
       (1626, '오렌지', '1/2개'),
       (1626, '블루베리', '1/2종이컵'),
       (1626, '프레젤 과자', '적당량'),
       (1626, '오레오 과자', '적당량'),
       (1626, '피스타치오', '적당량'),
       (1626, '타임', '적당량');

-- 1627
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1627, '닭볶음탕용 닭', '600g'),
       (1627, '물', '4종이컵'),
       (1627, '감자', '1개'),
       (1627, '당근', '1/4개'),
       (1627, '양파', '1/2개'),
       (1627, '대파', '1대'),
       (1627, '마른 고추', '2개'),
       (1627, '물', '6종이컵'),
       (1627, '청주', '2숟가락'),
       (1627, '소금', '1/3숟가락'),
       (1627, '후추', '약간'),
       (1627, '고추장', '4숟가락'),
       (1627, '고춧가루', '1숟가락'),
       (1627, '간장', '2숟가락'),
       (1627, '설탕', '1숟가락'),
       (1627, '다진마늘', '1숟가락'),
       (1627, '다진 생강', '약간'),
       (1627, '소금', '약간'),
       (1627, '후추', '약간');

-- 1628
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1628, '흑설탕', '3숟가락'),
       (1628, '습식 찹쌀가루', '3종이컵'),
       (1628, '밀가루 중력분', '3숟가락'),
       (1628, '꽃소금', '1/2티스푼'),
       (1628, '베이킹소다', '약간'),
       (1628, '베이킹파우더', '2/3숟가락'),
       (1628, '뜨거운 물', '1/2종이컵'),
       (1628, '설탕', '1숟가락'),
       (1628, '계피가루', '약간'),
       (1628, '당근', '1개'),
       (1628, '분당', '3스푼'),
       (1628, '크림치즈', '4숟가락'),
       (1628, '버터', '2숟가락'),
       (1628, '식용유', ''),
       (1628, '설탕', '');

-- 1629
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1629, '라면', '2개'),
       (1629, '양파', '2개'),
       (1629, '스프', '3개'),
       (1629, '삼겹살', '3줄'),
       (1629, '올리브유', '약간');

-- 1630
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1630, '박력분', '200g'),
       (1630, '베이킹파우더', '8g'),
       (1630, '설탕', '45g'),
       (1630, '소금', '1꼬집'),
       (1630, '무염버터', '60g'),
       (1630, '달걀', '50g'),
       (1630, '우유', '10g'),
       (1630, '생크림', '50g'),
       (1630, '반건조무화과', '70g'),
       (1630, '피칸', '20g'),
       (1630, '우유', '약간');

-- 1631
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1631, '양배추', '1/4개'),
       (1631, '물', '1/4종이컵'),
       (1631, '다진 돼지고기', '1종이컵'),
       (1631, '다진 소고기', '1종이컵'),
       (1631, '다진 양파', '1/4개'),
       (1631, '다진 베이컨', '2줄'),
       (1631, '달걀', '1/2개'),
       (1631, '빵가루', '4숟가락'),
       (1631, '소금', '약간'),
       (1631, '후추', '약간'),
       (1631, '바질 가루', '약간'),
       (1631, '토마토소스', '1종이컵'),
       (1631, '다진 마늘', '1숟가락'),
       (1631, '설탕', '1숟가락');

-- 1632
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1632, '불린 찹쌀', '1/2종이컵'),
       (1632, '팥', ''),
       (1632, '건표고', '40g'),
       (1632, '식용유', '1숟가락'),
       (1632, '다시마물', '1/3종이컵'),
       (1632, '참기름', '1숟가락'),
       (1632, '국간장', '2숟가락'),
       (1632, '다진 마늘', '1/2숟가락'),
       (1632, '다진 파', '1/2숟가락'),
       (1632, '건 가지', '30g'),
       (1632, '식용유', '1숟가락'),
       (1632, '다시마물', '1/3종이컵'),
       (1632, '참기름', '1/2숟가락'),
       (1632, '국간장', '2숟가락');
-- 나머지 재료들도 유사한 쿼리로 추가할 수 있음

-- 1633
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1633, '감자', '3개'),
       (1633, '달걀', '2개'),
       (1633, '오이', '1/2개'),
       (1633, '사과', '1/4개'),
       (1633, '슬라이스햄', '40g'),
       (1633, '상추', '10장'),
       (1633, '모닝빵', '10개'),
       (1633, '소금', '1/2숟가락'),
       (1633, '홀그레인머스타드', '2숟가락'),
       (1633, '마요네즈', '4숟가락'),
       (1633, '플레인요거트', '3숟가락'),
       (1633, '설탕', '1/2숟가락');

-- 1634
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1634, '당근', '1개'),
       (1634, '파프리카', '1/2개'),
       (1634, '양상추', '1/4통'),
       (1634, '땅콩가루', '1숟가락'),
       (1634, '간장', '1숟가락'),
       (1634, '고춧가루', '1/2숟가락'),
       (1634, '다진 마늘', '약간'),
       (1634, '꿀', '2숟가락'),
       (1634, '올리브유', '4숟가락'),
       (1634, '레몬즙', '2숟가락');

-- 1635
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1635, '호떡 믹스 가루', '540g'),
       (1635, '양파', '1/2개'),
       (1635, '햄', '130g'),
       (1635, '파프리카', '1/2개'),
       (1635, '통조림옥수수', '5숟가락'),
       (1635, '토마토소스', '1/2종이컵'),
       (1635, '피자치즈', '적당량'),
       (1635, '따뜻한물', '1+1/4종이컵'),
       (1635, '식용유', '적당량');

-- 1636
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1636, '생 홍합', '100g'),
       (1636, '대파', '1토막'),
       (1636, '검은 후추', '2g'),
       (1636, '참기름', '5ml'),
       (1636, '진간장', '40ml'),
       (1636, '생강', '15g'),
       (1636, '설탕', '10g'),
       (1636, '잣', '5개'),
       (1636, 'A4용지', '1장');

-- 1637
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1637, '오징어', '1/2마리'),
       (1637, '콩나물', '1줌'),
       (1637, '밥', '2공기'),
       (1637, '당근', '1/4개'),
       (1637, '새싹채소', '2줌'),
       (1637, '참기름', '1숟가락'),
       (1637, '통깨', '약간'),
       (1637, '고추장', '1숟가락'),
       (1637, '설탕', '1/2숟가락'),
       (1637, '맛술', '1숟가락'),
       (1637, '간장', '1숟가락'),
       (1637, '고춧가루', '1/2숟가락'),
       (1637, '올리고당', '1/2숟가락'),
       (1637, '다진 마늘', '1/2숟가락');

-- 1638
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1638, '어묵', '4장'),
       (1638, '탈각 새우', '2종이컵'),
       (1638, '홍고추', '1개'),
       (1638, '청양고추', '1개'),
       (1638, '밀가루', '1/2종이컵'),
       (1638, '달걀', '1개'),
       (1638, '빵가루', '1/2종이컵'),
       (1638, '식용유', '약간'),
       (1638, '달걀 흰자', '2숟가락'),
       (1638, '전분가루', '2숟가락'),
       (1638, '청주', '1숟가락'),
       (1638, '소금', '약간'),
       (1638, '후추', '약간');

-- 1639
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1639, '돼지고기', '500g'),
       (1639, '청주', '3숟가락'),
       (1639, '대파', '1대'),
       (1639, '생강', '1알'),
       (1639, '마늘', '3개'),
       (1639, '팔각', '1개'),
       (1639, '전분', '2숟가락'),
       (1639, '물', '2숟가락'),
       (1639, '노두유', '2숟가락'),
       (1639, '간장', '2숟가락'),
       (1639, '꿀', '1숟가락'),
       (1639, '물', '3컵'),
       (1639, '치킨파우더', '1숟가락'),
       (1639, '간장', '6숟가락'),
       (1639, '설탕', '2숟가락'),
       (1639, '노두유', '1/2숟가락'),
       (1639, '팔각', '1개');

-- 1640
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1640, '다진 소고기', '400g'),
       (1640, '큐민가루', '1/4숟가락'),
       (1640, '다진마늘', '1숟가락'),
       (1640, '스리라차 소스', '1숟가락'),
       (1640, '파프리카 파우더', '1/2숟가락'),
       (1640, '계피가루', '약간'),
       (1640, '소금', '약간'),
       (1640, '후추', '약간'),
       (1640, '고수', '2뿌리'),
       (1640, '올리브유', '약간'),
       (1640, '마요네즈', '5숟가락'),
       (1640, '스리라차 소스', '1숟가락');

INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1641, '바지락', '100g'),
       (1641, '모시조개', '100g'),
       (1641, '홍합', '100g'),
       (1641, '미나리', '1줌'),
       (1641, '쪽파', '2줄기'),
       (1641, '홍고추', '1개'),
       (1641, '화이트와인', '1/4종이컵'),
       (1641, '소금', '약간'),
       (1641, '후추', '약간'),

       (1642, '김밥김', '2장'),
       (1642, '밥', '2공기'),
       (1642, '단무지', '2줄'),
       (1642, '갓 피클', '100g'),
       (1642, '돼지고기', '100g'),
       (1642, '당근', '100g'),
       (1642, '달걀', '1개'),
       (1642, '소금', '1/4숟가락'),
       (1642, '참깨', '1숟가락'),
       (1642, '참기름', '1숟가락'),
       (1642, '간장', '1숟가락'),
       (1642, '다진 마늘', '1/4숟가락'),
       (1642, '맛술', '1숟가락'),
       (1642, '설탕', '1/2숟가락'),
       (1642, '후추', '약간'),

       (1643, '시금치', '60g'),
       (1643, '새우', '6마리'),
       (1643, '양파', '1/2개'),
       (1643, '새송이버섯', '1/2개'),
       (1643, '마늘', '1개'),
       (1643, '달걀', '5개'),
       (1643, '생크림', '3T'),
       (1643, '파마산치즈가루', '15g'),
       (1643, '모짜렐라 치즈', '50g'),
       (1643, '버터', '1T'),
       (1643, '올리브오일', '적당량'),
       (1643, '소금', '약간'),
       (1643, '후추', '약간'),

       (1644, '달걀', '150g'),
       (1644, '설탕', '90g'),
       (1644, '박력분', '75g'),
       (1644, '코코아파우더', '15g'),
       (1644, '버터', '15g'),

       (1645, '닭다리살', '500g'),
       (1645, '가래떡', '1줄'),
       (1645, '청양고추', '1개'),
       (1645, '청주', '1숟가락'),
       (1645, '소금', '약간'),
       (1645, '후추', '약간'),
       (1645, '고추장', '1숟가락'),
       (1645, '고춧가루', '1+1/2숟가락'),
       (1645, '간장', '2숟가락'),
       (1645, '다진 마늘', '1/2숟가락'),
       (1645, '올리고당', '1숟가락'),
       (1645, '설탕', '1/2숟가락'),
       (1645, '매실액', '1숟가락'),
       (1645, '참기름', '1/2숟가락'),
       (1645, '후추', '약간'),

       (1646, '먹물 스파게티', '100g'),
       (1646, '오징어', '1마리'),
       (1646, '마늘', '3톨'),
       (1646, '버터', '2숟가락'),
       (1646, '방울토마토', '8개'),
       (1646, '올리브유', '적당량'),
       (1646, '소금', '약간'),
       (1646, '후추', '약간'),
       (1646, '면수', '1/2종이컵'),
       (1646, '그라노파다노', '약간'),

       (1647, '떡볶이떡', '250g'),
       (1647, '단호박', '200g'),
       (1647, '양파', '1/4개'),
       (1647, '베이컨', '3줄'),
       (1647, '편마늘', '1숟가락'),
       (1647, '브로콜리', '50g'),
       (1647, '우유', '1종이컵'),
       (1647, '생크림', '1종이컵'),
       (1647, '소금', '약간'),
       (1647, '후추', '약간'),
       (1647, '파마산치즈가루', '1숟가락'),
       (1647, '파슬리가루', '약간'),

       (1648, '꼬막', '1kg'),
       (1648, '쪽파', '10대'),
       (1648, '미나리', '10대'),
       (1648, '청양고추', '2~3개'),
       (1648, '밥', '3공기'),
       (1648, '참기름', '1숟가락'),
       (1648, '물', '6컵'),
       (1648, '굵은소금', '2숟가락'),
       (1648, '식초', '2숟가락'),
       (1648, '간장', '4숟가락'),
       (1648, '액젓', '1숟가락'),
       (1648, '생강술', '1숟가락'),
       (1648, '고춧가루', '1+1/2숟가락'),
       (1648, '매실청', '2숟가락'),
       (1648, '설탕', '1/2숟가락'),
       (1648, '다진 마늘', '1숟가락'),
       (1648, '다진 대파', '2숟가락'),
       (1648, '간 깨', '1숟가락'),

       (1649, '새우', '25마리'),
       (1649, '코코넛 롱', '1/2종이컵'),
       (1649, '밀가루', '7숟가락'),
       (1649, '달걀', '2개'),
       (1649, '소금', '약간'),
       (1649, '후추', '약간'),
       (1649, '식용유', '약간'),
       (1649, '마요네즈', '3숟가락'),
       (1649, '설탕', '1숟가락'),
       (1649, '올리고당', '1숟가락'),
       (1649, '레몬즙', '1숟가락'),
       (1649, '소금', '약간'),
       (1649, '후추', '약간'),

       (1650, '밥', '1공기'),
       (1650, '소시지', '1개'),
       (1650, '달걀', '3개'),
       (1650, '빨강파프리카', '1/4개'),
       (1650, '피망', '1/4개'),
       (1650, '양파', '1/4개'),
       (1650, '소금', '약간'),
       (1650, '후추', '약간'),
       (1650, '케첩', NULL);

-- 1651
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1651, '돌나물', '1봉'),
       (1651, '사과', '1/2개'),
       (1651, '고추장', '1숟가락'),
       (1651, '고춧가루', '1숟가락'),
       (1651, '식초', '2숟가락'),
       (1651, '매실액', '1숟가락'),
       (1651, '참기름', '1숟가락'),
       (1651, '통깨', '약간');

-- 1652
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1652, '조갯살', '1종이컵'),
       (1652, '무', '1/8개'),
       (1652, '쌀', '1종이컵'),
       (1652, '물', '1종이컵'),
       (1652, '청주', '1숟가락'),
       (1652, '간장', '2숟가락'),
       (1652, '대파', '1숟가락'),
       (1652, '양파', '1숟가락'),
       (1652, '홍고추', '1/2개'),
       (1652, '청양고추', '1/2개'),
       (1652, '다진마늘', '1/2숟가락'),
       (1652, '통깨', '약간'),
       (1652, '참기름', '1숟가락'),
       (1652, '설탕', '1/2숟가락'),
       (1652, '바지락', '2종이컵'),
       (1652, '마늘', '4알'),
       (1652, '페페론치노', '5개'),
       (1652, '화이트와인', '1/2종이컵'),
       (1652, '소금', '약간'),
       (1652, '후추', '약간'),
       (1652, '파스타면', '면수 1/2종이컵'),
       (1652, '올리브유', '3숟가락'),
       (1652, '링귀니면', '파스타면 80g'),
       (1652, '올리브유', '약간'),
       (1652, '미나리', '1줌'),
       (1652, '바지락살', '1종이컵'),
       (1652, '양파', '1/4개'),
       (1652, '청주', '1숟가락'),
       (1652, '통깨', '약간'),
       (1652, '소금', '약간'),
       (1652, '고추장', '3숟가락'),
       (1652, '식초', '2숟가락'),
       (1652, '다진마늘', '1/2숟가락'),
       (1652, '설탕', '1숟가락'),
       (1652, '물엿', '1숟가락'),
       (1652, '고춧가루', '1숟가락'),
       (1652, '참기름', '1숟가락'),
       (1652, '통깨', '약간');

-- 1653
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1653, '편의점 치킨', '2개'),
       (1653, '토마토소스', '1팩'),
       (1653, '우유', '1종이컵'),
       (1653, '방울토마토', '5개'),
       (1653, '모짜렐라치즈', '적당량'),
       (1653, '소금', '약간'),
       (1653, '후추', '약간');

-- 1654
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1654, '병아리콩', '1종이컵'),
       (1654, '양상추', '1/4통'),
       (1654, '빨간 파프리카', '1/2개'),
       (1654, '주황 파프리카', '1/2개'),
       (1654, '오이', '1/2개'),
       (1654, '꿀', '3숟가락'),
       (1654, '레몬즙', '3숟가락'),
       (1654, '그라노파다노 치즈', '약간'),
       (1654, '그릭요거트', '1/2종이컵'),
       (1654, '소금', '약간');

-- 1655
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1655, '식빵', '2개'),
       (1655, '소시지 바', '2개'),
       (1655, '모차렐라 치즈', '2봉지'),
       (1655, '콘푸라이트', '1개'),
       (1655, '옥수수 콘', '5숟가락'),
       (1655, '샐러드 채소', '1개'),
       (1655, '케첩', '적당량');

-- 1656
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1656, '순두부', '1봉지'),
       (1656, '다진돼지고기', '100g'),
       (1656, '양파', '1/4개'),
       (1656, '양송이버섯', '2개'),
       (1656, '페페론치노', '3개'),
       (1656, '다진 마늘', '1숟가락'),
       (1656, '모짜렐라치즈', '1종이컵'),
       (1656, '올리브유', '2숟가락'),
       (1656, '파슬리가루', '약간'),
       (1656, '토마토소스', '1종이컵');

-- 1657
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1657, '시판용 카스텔라 빵', '2개'),
       (1657, '밤 조림', '6개'),
       (1657, '밤 페이스트', '150g'),
       (1657, '생크림', '50g'),
       (1657, '생크림', '200g'),
       (1657, '설탕', '20g'),
       (1657, '물', '20g'),
       (1657, '설탕', '10g');

-- 1658
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1658, '춘설 앙금', '1kg'),
       (1658, '백옥 앙금', '500g'),
       (1658, '쑥가루', '적당량'),
       (1658, '비트가루', '적당량'),
       (1658, '백년초가루', '적당량'),
       (1658, '물엿', '약간');

-- 1659
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1659, '닭다리', '500g'),
       (1659, '떡국떡', '300g'),
       (1659, '대파', '1/2개'),
       (1659, '국간장', '4숟가락'),
       (1659, '양파', '1/2개'),
       (1659, '통후추', '5알'),
       (1659, '맛술', '1숟가락'),
       (1659, '다진마늘', '1숟가락'),
       (1659, '까나리액젓', '1/2숟가락'),
       (1659, '소금', '약간'),
       (1659, '후추', '약간');

-- 1660
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1660, '닭정육', '5조각'),
       (1660, '표고버섯', '3개'),
       (1660, '마늘', '5개'),
       (1660, '페페론치노', '7개'),
       (1660, '쪽파', '3줄기'),
       (1660, '통깨', '약간'),
       (1660, '식용유', '약간'),
       (1660, '춘장', '3숟가락'),
       (1660, '간장', '1숟가락'),
       (1660, '흑설탕', '2숟가락'),
       (1660, '물엿', '1숟가락'),
       (1660, '물', '5숟가락'),
       (1660, '참기름', '약간'),
       (1660, '후추', '약간'),
       (1660, '소금', '약간'),
       (1660, '후추', '약간'),
       (1660, '맛술', '1숟가락');

-- 1661
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1661, '오이', '1/2개'),
       (1661, '양파', '1/2개'),
       (1661, '빨간 파프리카', '1/2개'),
       (1661, '노란 파프리카', '1/2개'),
       (1661, '크래미', '2개'),
       (1661, '라면', '1개'),
       (1661, '슬라이스 햄', '2장'),
       (1661, '연겨자', '3숟가락'),
       (1661, '설탕', '3숟가락'),
       (1661, '식초', '3숟가락'),
       (1661, '간장', '1/2숟가락'),
       (1661, '참기름', '1/2숟가락');

-- 1662
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1662, '밥', '1공기'),
       (1662, '엿기름가루티백', '240g'),
       (1662, '설탕', '1종이컵'),
       (1662, '생강', '1개');

-- 1663
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1663, '감자', '20g'),
       (1663, '불린 쌀', '30g'),
       (1663, '물', '400ml'),
       (1663, '단호박', '20g'),
       (1663, '불린 쌀', '30g'),
       (1663, '물', '400ml'),
       (1663, '고구마', '20g'),
       (1663, '불린 쌀', '30g'),
       (1663, '물', '400ml');

-- 1664
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1664, '표고버섯', '무제한'),
       (1664, '느타리버섯', '무제한'),
       (1664, '팽이버섯', '무제한'),
       (1664, '불린 쌀', '2종이컵'),
       (1664, '버섯 불린 물', '2종이컵'),
       (1664, '대추', '5개'),
       (1664, '밤', '5개'),
       (1664, '말린 버섯', '1줌');

-- 1665
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1665, '청포묵', '150g'),
       (1665, '소고기 살코기', '20g'),
       (1665, '숙주', '20g'),
       (1665, '미나리', '10g'),
       (1665, '달걀', '1개'),
       (1665, '김', '1/4장'),
       (1665, '진간장', '20ml'),
       (1665, '깐마늘', '2쪽'),
       (1665, '대파', '1토막'),
       (1665, '검은 통후추', '1g'),
       (1665, '참기름', '5ml'),
       (1665, '설탕', '5g'),
       (1665, '깨소금', '5g'),
       (1665, '식초', '5ml'),
       (1665, '식용유', '10ml'),
       (1665, '소금', '5g');

-- 1666
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1666, '포도씨 오일', '50g'),
       (1666, '설탕', '50g'),
       (1666, '달걀', '25g'),
       (1666, '바닐라익스트랙', '약간'),
       (1666, '통밀가루', '50g'),
       (1666, '베이킹소다', '1/4t'),
       (1666, '베이킹파우더', '1/8t'),
       (1666, '소금', '1꼬집'),
       (1666, '오트밀', '50g'),
       (1666, '건포도', '30g'),
       (1666, '시리얼', '25g');

-- 1667
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1667, '물', '3종이컵'),
       (1667, '간장', '2숟가락'),
       (1667, '라면스프', '2숟가락'),
       (1667, '설탕', '1/2숟가락'),
       (1667, '참기름', '약간'),
       (1667, '사골 라면', '1개'),
       (1667, '돼지고기 안심', '30g'),
       (1667, '새우', '5개'),
       (1667, '해삼', '25g'),
       (1667, '죽순', '40g'),
       (1667, '새송이버섯', '30g'),
       (1667, '간생강', '약간'),
       (1667, '팽이버섯', '1/2봉'),
       (1667, '부추', '10g'),
       (1667, '대파', '1대'),
       (1667, '마늘', '1개'),
       (1667, '물', '1종이컵'),
       (1667, '굴소스', '1/2숟가락'),
       (1667, '맛술', '1숟가락'),
       (1667, '간장', '1숟가락'),
       (1667, '사골 스프', '1숟가락'),
       (1667, '전분', '2숟가락'),
       (1667, '물', '2숟가락');

-- 1668
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1668, '메밀가루', '1종이컵'),
       (1668, '달걀', '1개'),
       (1668, '소금', '약간'),
       (1668, '후추', '약간'),
       (1668, '우유', '1/2종이컵'),
       (1668, '물', '2/3종이컵'),
       (1668, '포도씨유', '1숟가락'),
       (1668, '샌드위치용 햄', '2장'),
       (1668, '달걀', '2개'),
       (1668, '모짜렐라치즈', '1/2종이컵'),
       (1668, '후추', '약간'),
       (1668, '파마산치즈가루', '약간');

-- 1669
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1669, '갓김치', '5줄기'),
       (1669, '돼지고기', '300g'),
       (1669, '새우젓', '1숟가락'),
       (1669, '다진 마늘', '1숟가락'),
       (1669, '설탕', '1숟가락'),
       (1669, '국간장', '1숟가락'),
       (1669, '식초', '1숟가락'),
       (1669, '대파', '1/2대'),
       (1669, '청양고추', '1개'),
       (1669, '굵은 고춧가루', '1숟가락'),
       (1669, '두부', '1/2모'),
       (1669, '밥', '1공기');

-- 1670
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1670, '굴', '100g'),
       (1670, '오징어', '1마리'),
       (1670, '표고버섯', '2개'),
       (1670, '대파', '1대'),
       (1670, '청경채', '2개'),
       (1670, '마늘', '3톨'),
       (1670, '물', '5종이컵'),
       (1670, '치킨스톡', '1숟가락'),
       (1670, '소금', '약간'),
       (1670, '후추', '약간'),
       (1670, '굴소스', '1숟가락'),
       (1670, '간장', '1숟가락'),
       (1670, '청주', '1숟가락'),
       (1670, '생면', '80g'),
       (1670, '참기름', '약간'),
       (1670, '식용유', '약간'),
       (1670, '건고추', '2개');

-- 1671
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1671, '젖은 멥쌀가루', '600g'),
       (1671, '설탕', '6큰술'),
       (1671, '물', '약간'),
       (1671, '팥배기', '30g'),
       (1671, '반건조고구마', '70g');

-- 1672
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1672, '닭가슴살', '1개'),
       (1672, '밥', '1공기'),
       (1672, '한방음료', '2캔'),
       (1672, '김', '1봉');

-- 1673
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1673, '시금치', '200g'),
       (1673, '새우', '300g'),
       (1673, '올리브유', '약간'),
       (1673, '쪽파', '3줄'),
       (1673, '다진마늘', '1숟가락'),
       (1673, '청주', '1숟가락'),
       (1673, '소금', '약간'),
       (1673, '후추', '약간'),
       (1673, '홍고추', '1개'),
       (1673, '참기름', '1숟가락'),
       (1673, '국간장', '1숟가락'),
       (1673, '참치액', '1숟가락');

-- 1674
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1674, '바게트', '1/2개'),
       (1674, '딸기', '8개'),
       (1674, '블루베리', '10개'),
       (1674, '크림치즈', '4숟가락'),
       (1674, '애플민트', '약간'),
       (1674, '딸기', '5개'),
       (1674, '레몬즙', '1숟가락'),
       (1674, '설탕', '1숟가락');

-- 1675
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1675, '오뚜기 어린이카레', '1봉'),
       (1675, '소고기', '100g'),
       (1675, '양파', '1/2개'),
       (1675, '감자', '1/2개'),
       (1675, '당근', '1/5개'),
       (1675, '물', '200ml'),
       (1675, '식용유', '약간'),
       (1675, '체다치즈', '약간'),
       (1675, '김', '1장'),
       (1675, '다시마', '1장');

-- 1676
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1676, '불린 쌀', '30g'),
       (1676, '단호박', '20g'),
       (1676, '양배추', '10g'),
       (1676, '물', '300ml');

-- 1677
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1677, '다진 소고기', '100g'),
       (1677, '미니새송이버섯', '4개'),
       (1677, '양파', '1/4개'),
       (1677, '청양고추', '1개'),
       (1677, '물', '1종이컵'),
       (1677, '된장', '4숟가락'),
       (1677, '고추장', '2숟가락'),
       (1677, '다진 대파', '1숟가락'),
       (1677, '다진 마늘', '1숟가락'),
       (1677, '참기름', '1숟가락'),
       (1677, '통깨', '약간');

-- 1678
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1678, '건표고버섯', '5개'),
       (1678, '소고기', '30g'),
       (1678, '두부', '15g'),
       (1678, '밀가루', '20g'),
       (1678, '달걀', '1개'),
       (1678, '대파', '1토막'),
       (1678, '후춧가루', '1g'),
       (1678, '참기름', '15ml'),
       (1678, '소금', '5g'),
       (1678, '깨소금', '5g'),
       (1678, '마늘', '1쪽'),
       (1678, '식용유', '20ml'),
       (1678, '간장', '5ml'),
       (1678, '설탕', '5g');

-- 1679
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1679, '오징어', '1마리'),
       (1679, '두부', '1/2모'),
       (1679, '숙주', '1줌'),
       (1679, '대파', '1/2대'),
       (1679, '양파', '1/4개'),
       (1679, '멸치다시마육수', '1/2종이컵'),
       (1679, '소금', '약간'),
       (1679, '후추', '약간'),
       (1679, '식용유', '약간'),
       (1679, '간장', '6숟가락'),
       (1679, '설탕', '3숟가락'),
       (1679, '고추장', '1숟가락'),
       (1679, '다진마늘', '1숟가락'),
       (1679, '소금', '약간'),
       (1679, '후추', '약간'),
       (1679, '참기름', '1숟가락');

-- 1680
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1680, '미트볼', '3개'),
       (1680, '반숙란 달걀', '2개'),
       (1680, '달걀', '1개'),
       (1680, '나쵸 과자', '1/2봉'),
       (1680, '밀가루', '적당량');

-- 1681
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1681, '맛밤', '300g'),
       (1681, '고구마', '150g'),
       (1681, '양파', '1/4개'),
       (1681, '샐러리', '1/2대'),
       (1681, '마늘', '1톨'),
       (1681, '버터', '3숟가락'),
       (1681, '치킨육수', '6종이컵'),
       (1681, '생크림', '1/2종이컵'),
       (1681, '소금', '약간');

-- 1682
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1682, '라면', '1개'),
       (1682, '물', '550ml'),
       (1682, '굴', '1종이컵'),
       (1682, '고춧가루', '약간'),
       (1682, '후추', '약간'),
       (1682, '사각어묵', '2장'),
       (1682, '라면', '1개'),
       (1682, '물', '550ml'),
       (1682, '다진 마늘', '1/2숟가락'),
       (1682, '대파', '1대'),
       (1682, '고추', '1개');

-- 1683
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1683, '순두부', '1봉'),
       (1683, '탈각 새우', '100g'),
       (1683, '양파', '1/4개'),
       (1683, '대파', '1/4개'),
       (1683, '마늘', '2개'),
       (1683, '생강', '1조각'),
       (1683, '치킨육수', '1종이컵'),
       (1683, '밥', '1공기'),
       (1683, '식용유', '약간'),
       (1683, '고춧가루', '1숟가락'),
       (1683, '간장', '2숟가락'),
       (1683, '두반장', '3숟가락'),
       (1683, '청주', '1숟가락'),
       (1683, '후추', '약간'),
       (1683, '소금', '약간'),
       (1683, '전분가루', '2숟가락'),
       (1683, '물', '3숟가락');

-- 1684
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1684, '발효 버터', '100g'),
       (1684, '설탕', '95g'),
       (1684, '달걀', '90g'),
       (1684, '박력분', '90g'),
       (1684, '베이킹파우더', '2g'),
       (1684, '얼그레이티백', '2g'),
       (1684, '사과', '1개'),
       (1684, '설탕', '15g'),
       (1684, '버터', '5g'),
       (1684, '레몬즙', '10g'),
       (1684, '시나몬파우더', '약간');

-- 1685
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1685, '막창', '200g'),
       (1685, '대창', '200g'),
       (1685, '대파', '1/2대'),
       (1685, '양파', '1/2개'),
       (1685, '양배추', '1/6개'),
       (1685, '깻잎', '5장'),
       (1685, '불린당면', '1줌'),
       (1685, '청양고추', '2개'),
       (1685, '청주', '1숟가락'),
       (1685, '소금', '약간'),
       (1685, '후추', '약간'),
       (1685, '식용유', '약간'),
       (1685, '설탕', '2숟가락'),
       (1685, '고춧가루', '4숟가락'),
       (1685, '고추장', '1숟가락'),
       (1685, '간장', '3숟가락'),
       (1685, '다진마늘', '1숟가락'),
       (1685, '들깨가루', '3숟가락'),
       (1685, '물', '2숟가락'),
       (1685, '후추', '약간'),
       (1685, '밥', '1공기'),
       (1685, '김가루', '적당량'),
       (1685, '참기름', '약간');

-- 1686
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1686, '감자', '1개'),
       (1686, '달걀', '2개'),
       (1686, '생크림', '1/4컵'),
       (1686, '베이컨', '6줄'),
       (1686, '시금치', '1줌'),
       (1686, '소금', '약간'),
       (1686, '후추', '약간'),
       (1686, '버터', '2숟가락'),
       (1686, '식용유', '약간');

-- 1687
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1687, '양파', '1개'),
       (1687, '소시지', '3개'),
       (1687, '다진소고기', '1종이컵'),
       (1687, '핫도그 빵', '3개'),
       (1687, '다진 마늘', '1숟가락'),
       (1687, '슈레드피자치즈', '1종이컵'),
       (1687, '케첩', '1종이컵'),
       (1687, '고춧가루', '1/2숟가락'),
       (1687, '소금', '약간'),
       (1687, '후추', '약간');

-- 1688
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1688, '불린 쌀', '30g'),
       (1688, '불린 기장', '12g'),
       (1688, '물', '400ml'),
       (1688, '불린 쌀', '30g'),
       (1688, '불린차조', '12g'),
       (1688, '물', '400ml'),
       (1688, '불린 쌀', '30g'),
       (1688, '불린 기장', '12g'),
       (1688, '물', '400ml'),
       (1688, '불린 쌀', '30g'),
       (1688, '불린 흑미', '3g'),
       (1688, '물', '400ml');

-- 1689
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1689, '새송이버섯', '4개'),
       (1689, '베이컨', '2줄'),
       (1689, '대파', '1/2개'),
       (1689, '빵가루', '적당량'),
       (1689, '파슬리가루', '약간'),
       (1689, '파마산치즈가루', '4숟가락'),
       (1689, '다진마늘', '2숟가락'),
       (1689, '버터', '5숟가락'),
       (1689, '소금', '약간'),
       (1689, '후추', '약간');

-- 1690
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1690, '버터', '90g'),
       (1690, '황설탕', '88g'),
       (1690, '설탕', '12g'),
       (1690, '사워크림', '10g'),
       (1690, '달걀', '100g'),
       (1690, '우유', '88g'),
       (1690, '박력분', '199g'),
       (1690, '베이킹파우더', '6g'),
       (1690, '소금', '1꼬집'),
       (1690, '곶감', '3개'),
       (1690, '호두', '27g'),
       (1690, '크림치즈', '99g'),
       (1690, '슈가파우더', '21g'),
       (1690, '황설탕', '적당량'),
       (1690, '곶감', '적당량'),
       (1690, '호두', '적당량');

-- 1691
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1691, '알리오올리오 스파게티 소스', '90g'),
       (1691, '오뚜기밥', '1개'),
       (1691, '식용유', '10g'),
       (1691, '고사리', '40g'),
       (1691, '베이컨', '40g'),
       (1691, '양파', '40g'),
       (1691, '양송이버섯', '30g'),
       (1691, '당근', '10g');

-- 1692
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1692, '두부', '1모'),
       (1692, '토마토', '1/2개'),
       (1692, '로메인상추', '2장'),
       (1692, '슬라이스치즈', '2장'),
       (1692, '닭가슴살', '1캔'),
       (1692, '마요네즈', '3숟가락'),
       (1692, '머스터드', '1+1/2숟가락'),
       (1692, '소금', '약간'),
       (1692, '후추', '약간');

-- 1693
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1693, '수제비면', '2줌'),
       (1693, '양파', '1/2개'),
       (1693, '생크림', '2+1/2종이컵'),
       (1693, '베이컨', '3줄'),
       (1693, '양송이버섯', '4개'),
       (1693, '편마늘', '3숟가락'),
       (1693, '소금', '약간'),
       (1693, '후추', '약간'),
       (1693, '올리브유', '1숟가락'),
       (1693, '페페론치노', '3개'),
       (1693, '파마산치즈가루', '2숟가락'),
       (1693, '파슬리가루', '약간');

-- 1694
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1694, '감자', '2개'),
       (1694, '명란젓', '1/2팩'),
       (1694, '쪽파', '2대'),
       (1694, '통깨', '약간');

-- 1695
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1695, '등갈비', '500g'),
       (1695, '월계수잎', '3장'),
       (1695, '청주', '1/4컵'),
       (1695, '마늘', '4개'),
       (1695, '생강', '1개'),
       (1695, '통후추', '10알'),
       (1695, '양파', '1/2개'),
       (1695, '대파흰대', '1개'),
       (1695, '된장', '1숟가락'),
       (1695, '스테이크 소스', '1/2컵'),
       (1695, '케찹', '3숟가락'),
       (1695, '설탕', '1숟가락'),
       (1695, '물엿', '1숟가락'),
       (1695, '간장', '1숟가락'),
       (1695, '우스터소스', '4숟가락'),
       (1695, '레드와인', '4숟가락'),
       (1695, '다진마늘', '1숟가락'),
       (1695, '맛술', '1숟가락'),
       (1695, '버터', '1숟가락'),
       (1695, '후추', '약간'),
       (1695, '모짜렐라치즈', '2컵'),
       (1695, '체다치즈', '2슬라이스'),
       (1695, '우유', '1/2종이컵'),
       (1695, '파마산치즈', '5숟가락');

-- 1696
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1696, '해시 브라운', '4조각'),
       (1696, '체다치즈', '2장'),
       (1696, '모짜렐라치즈', '1줌'),
       (1696, '베이컨', '4장');

-- 1697
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1697, '식용유', NULL),
       (1697, '돼지고기 다짐육', '200g'),
       (1697, '된장', '1숟가락'),
       (1697, '굵은 고춧가루', '1숟가락'),
       (1697, '고운 고춧가루', '1숟가락'),
       (1697, '진간장', '1숟가락'),
       (1697, '다진 마늘', '1숟가락'),
       (1697, '황설탕', '1숟가락'),
       (1697, '고추장', '1숟가락'),
       (1697, '물', '1/2종이컵'),
       (1697, '꽃소금', '1/4숟가락'),
       (1697, '후추', '약간'),
       (1697, '쥬키니 호박', '1/4개'),
       (1697, '양배추', '1장'),
       (1697, '양파', '1/2개'),
       (1697, '대파', '1대'),
       (1697, '냉동중화면', '2인분');

-- 1698
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1698, '한라봉', '적당량'),
       (1698, '소금', '적당량'),
       (1698, '한라봉칩', '적당량'),
       (1698, '화이트초콜릿', '1종이컵'),
       (1698, '밀크초콜릿', '1종이컵'),
       (1698, '초코팬', NULL),
       (1698, '스프링클', '적당량');

-- 1699
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1699, '제누와즈 1호', '1개'),
       (1699, '생크림', '400g'),
       (1699, '설탕', '40g'),
       (1699, '물', '70g'),
       (1699, '설탕', '35g'),
       (1699, '식용꽃', NULL),
       (1699, '허브류', NULL);

-- 1700
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1700, '닭', '1kg'),
       (1700, '양파', '1/2개'),
       (1700, '감자', '2개'),
       (1700, '대파', '1대'),
       (1700, '건고추', '2개'),
       (1700, '감자', '1/3개'),
       (1700, '중국당면', '100g'),
       (1700, '간장', '8숟가락'),
       (1700, '설탕', '5숟가락'),
       (1700, '맛술', '3숟가락'),
       (1700, '다진 마늘', '1숟가락'),
       (1700, '다진 생강', '1/3숟가락'),
       (1700, '물엿', '1숟가락'),
       (1700, '굴소스', '1숟가락'),
       (1700, '커피가루', '1/3숟가락'),
       (1700, '물', '350ml'),
       (1700, '닭다리살', '300g'),
       (1700, '양파', '1개'),
       (1700, '감자', '2개'),
       (1700, '버터', '2숟가락'),
       (1700, '우유', '500ml'),
       (1700, '생크림', '500ml'),
       (1700, '소금', '1/3숟가락'),
       (1700, '후추', '약간'),
       (1700, '브로콜리', '1/4개'),
       (1700, '파슬리가루', '약간'),
       (1700, '청주', '1숟가락'),
       (1700, '소금', '1/3숟가락'),
       (1700, '후추', '약간'),
       (1700, '다이제', '6개'),
       (1700, '버터', '45g'),
       (1700, '크림치즈', '227g'),
       (1700, '설탕', '125g'),
       (1700, '플레인요거트', '125g'),
       (1700, '달걀', '1개'),
       (1700, '전분', '8g');

-- 1701
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1701, '방울토마토', '15개'),
       (1701, '양파', '1/3개'),
       (1701, '발사믹비네거', '3숟가락'),
       (1701, '꿀', '1숟가락'),
       (1701, '레몬즙', '1/2숟가락'),
       (1701, '소금', '약간'),
       (1701, '후추', '약간'),
       (1701, '설탕', '약간'),
       (1701, '올리브유', '약간');

-- 1702
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1702, '크로와상', '5개'),
       (1702, '딸기', '적당량'),
       (1702, '딸기시럽', '4숟가락'),
       (1702, '슈가파우더', '적당량'),
       (1702, '생크림', '500g'),
       (1702, '크림치즈', '300g'),
       (1702, '설탕', '100g');

-- 1703
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1703, '떡국떡', '300g'),
       (1703, '굴', '1종이컵'),
       (1703, '표고버섯', '1개'),
       (1703, '멸치다시마육수', '5종이컵'),
       (1703, '달걀', '2개'),
       (1703, '다진 마늘', '1/2숟가락'),
       (1703, '국간장', '1/2숟가락'),
       (1703, '소금', '약간');

-- 1704
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1704, '새우', '30마리'),
       (1704, '전분가루', '적당량'),
       (1704, '소금', '약간'),
       (1704, '후추', '약간'),
       (1704, '식용유', '약간'),
       (1704, '고추기름', '1숟가락'),
       (1704, '굴소스', '2숟가락'),
       (1704, '설탕', '1숟가락'),
       (1704, '다진마늘', '1/2숟가락'),
       (1704, '맛술', '약간');

-- 1705
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1705, '사골육수', '1포'),
       (1705, '물', '350ml'),
       (1705, '대파', '약간'),
       (1705, '사골육수', '1포'),
       (1705, '물', '500ml'),
       (1705, '만두', '4개'),
       (1705, '대파', '약간'),
       (1705, '달걀', '1개'),
       (1705, '떡국떡', '1줌');

-- 1706
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1706, '감', '2개'),
       (1706, '쪽파', '1줄기'),
       (1706, '고춧가루', '1숟가락'),
       (1706, '멸치액젓', '1숟가락'),
       (1706, '다진 마늘', '1/2숟가락'),
       (1706, '통깨', '약간');

-- 1707
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1707, '무', '1/4개'),
       (1707, '알배추', '10장'),
       (1707, '홍고추', '1개'),
       (1707, '풋고추', '1개'),
       (1707, '소금', '1숟가락'),
       (1707, '튀김가루', '적당량'),
       (1707, '식용유', '적당량'),
       (1707, '튀김가루', '1종이컵'),
       (1707, '달걀', '1개'),
       (1707, '물', '2/3종이컵'),
       (1707, '소금', '약간');

-- 1708
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1708, '도라지', '170g'),
       (1708, '물', '1/3종이컵'),
       (1708, '조청', '50g'),
       (1708, '설탕', '100g'),
       (1708, '소금', '약간'),
       (1708, '설탕', '적당량');

-- 1709
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1709, '고등어', '2마리'),
       (1709, '김치', '1/2포기'),
       (1709, '물', '2종이컵'),
       (1709, '대파', '1대'),
       (1709, '청양고추', '1개'),
       (1709, '고추장', '1+1/2숟가락'),
       (1709, '고춧가루', '2숟가락'),
       (1709, '간장', '2숟가락'),
       (1709, '다진 마늘', '1숟가락'),
       (1709, '설탕', '1/3숟가락'),
       (1709, '맛술', '1숟가락'),
       (1709, '후추', '약간');

-- 1710
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1710, '배', '2개'),
       (1710, '생강', '1개'),
       (1710, '통후추', NULL),
       (1710, '잣', '약간'),
       (1710, '오미자', '1/4종이컵'),
       (1710, '물', '5종이컵'),
       (1710, '설탕', '2숟가락');

-- 1711
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1711, '쌀', '1종이컵'),
       (1711, '된장', '1숟가락'),
       (1711, '생크림', '1종이컵'),
       (1711, '차돌박이', '100g'),
       (1711, '맛술', '2숟가락'),
       (1711, '다진마늘', '1숟가락'),
       (1711, '청양고추', '1개'),
       (1711, '양파', '1/4개'),
       (1711, '소금', '약간'),
       (1711, '후추', '약간'),
       (1711, '올리브유', '1숟가락'),
       (1711, '치킨스톡', '3종이컵'),
       (1711, '파마산치즈가루', NULL);

-- 1712
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1712, '닭날개', '18개'),
       (1712, '견과류', '약간'),
       (1712, '맛술', '1숟가락'),
       (1712, '올리브유', '1숟가락'),
       (1712, '소금', '약간'),
       (1712, '후추', '약간'),
       (1712, '바질', '약간'),
       (1712, '간장', '3숟가락'),
       (1712, '다진마늘', '1숟가락'),
       (1712, '꿀', '3숟가락'),
       (1712, '맛술', '2숟가락'),
       (1712, '후추', '약간');

-- 1713
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1713, '떡국떡', '400g'),
       (1713, '다진소고기', '100g'),
       (1713, '대파', '1대'),
       (1713, '달걀', '2개'),
       (1713, '소금', '약간'),
       (1713, '멸치다시마육수', '5종이컵'),
       (1713, '간장', '1숟가락'),
       (1713, '참기름', '1숟가락'),
       (1713, '다진 마늘', '1/3숟가락'),
       (1713, '소금', '약간'),
       (1713, '후추', '약간');

-- 1714
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1714, '한우 불고기용 소고기', '200g'),
       (1714, '양파', '1/4개'),
       (1714, '대파', '1/4개'),
       (1714, '다진 마늘', '1/2숟가락'),
       (1714, '진간장', '3숟가락'),
       (1714, '황설탕', '1숟가락'),
       (1714, '참기름', '1숟가락'),
       (1714, '노추', '1/4숟가락'),
       (1714, '후추', '약간'),
       (1714, '물', '3숟가락'),
       (1714, '핫도그빵', '1개'),
       (1714, '스위트랠리쉬', '2숟가락'),
       (1714, '할라페뇨', '5개'),
       (1714, '케찹', NULL),
       (1714, '마요네즈', NULL);

-- 1715
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1715, '바게트빵', '2개'),
       (1715, '크림치즈', '적당량'),
       (1715, '다진마늘', '4숟가락'),
       (1715, '녹인버터', '1/2종이컵'),
       (1715, '설탕', '4숟가락'),
       (1715, '소금', '1/2숟가락'),
       (1715, '파슬리가루', '1숟가락');

-- 1716
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1716, '제누와즈', '3장'),
       (1716, '딸기', '10개'),
       (1716, '생크림', '300g'),
       (1716, '연유', '20g'),
       (1716, '설탕', '10g'),
       (1716, '딸기요거트', '40g'),
       (1716, '물', '50g'),
       (1716, '설탕', '25g');

-- 1717
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1717, '홍합', '500g'),
       (1717, '물', '500ml'),
       (1717, '실파', '3줄기'),
       (1717, '홍고추', '1개'),
       (1717, '마늘', '3알'),
       (1717, '연두', '1숟가락'),
       (1717, '연두 청양초', '3숟가락'),
       (1717, '올리브유', '1숟가락');

-- 1718
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1718, '곶감', '6개'),
       (1718, '호두', '2개'),
       (1718, '고추장', '1숟가락'),
       (1718, '간장', '1/3숟가락'),
       (1718, '꿀', '1/2숟가락'),
       (1718, '참기름', '1/2숟가락'),
       (1718, '통깨', '약간');

-- 1719
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1719, '살치살', '200g'),
       (1719, '소금', '약간'),
       (1719, '후추', '약간'),
       (1719, '올리브유', '약간'),
       (1719, '로즈마리', '2줄'),
       (1719, '버터', '60g'),
       (1719, '마늘', '4개'),
       (1719, '양파', '1/6개'),
       (1719, '레몬', '1/2개'),
       (1719, '로즈마리', '2줄'),
       (1719, '타임', '1줄');

-- 1720
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1720, '만두피', '넉넉히'),
       (1720, '크림소스', '적당량'),
       (1720, '피자치즈', '적당량'),
       (1720, '양파', '1/2개'),
       (1720, '양송이버섯', '3개'),
       (1720, '베이컨', '3줄'),
       (1720, '베이비채소', '적당량'),
       (1720, '리코타치즈', '약간'),
       (1720, '달걀', '1개'),
       (1720, '발사믹크림', '약간'),
       (1720, '석류알', '약간');

-- 1721
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1721, '무염버터', '150g'),
       (1721, '슈가파우더', '150g'),
       (1721, '소금', '1꼬집'),
       (1721, '달걀', '1개'),
       (1721, '바닐라익스트랙', '약간'),
       (1721, '박력분', '330g'),
       (1721, '아몬드파우더', '30g'),
       (1721, '무염버터', '150g'),
       (1721, '슈가파우더', '150g'),
       (1721, '소금', '1꼬집'),
       (1721, '달걀', '1개'),
       (1721, '박력분', '320g'),
       (1721, '아몬드가루', '30g'),
       (1721, '계피가루', '1t'),
       (1721, '생강가루', '1/2t'),
       (1721, '슈가파우더', '150g'),
       (1721, '달걀흰자', '15g'),
       (1721, '레몬즙', '7g'),
       (1721, '따뜻한 물', '약간'),
       (1721, '식용 색소', '약간'),
       (1721, '미니트리모형', NULL),
       (1721, '크리스마스오너먼트', NULL),
       (1721, '리본', NULL),
       (1721, '스프링클', NULL);

-- 1722
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1722, '송어', '20g'),
       (1722, '방울토마토', '2개'),
       (1722, '어린 무', '2개'),
       (1722, '아스파라거스', '2개'),
       (1722, '양송이 버섯', '1개'),
       (1722, '삶은 달걀', '1/2개'),
       (1722, '파프리카', '1/2개'),
       (1722, '홀그레인 머스타드', '1/4숟가락'),
       (1722, '허니머스타드', '1/2숟가락'),
       (1722, '레몬즙', '1/4숟가락'),
       (1722, '유자청', '1/4숟가락');

-- 1723
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1723, '김밥용 김', '1/4장'),
       (1723, '팬케이크 믹스', '3숟가락'),
       (1723, '볶은콩가루', '2숟가락'),
       (1723, '견과류 분태', '1숟가락'),
       (1723, '달걀', '1개'),
       (1723, '우유', '2숟가락');

-- 1724
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1724, '소고기다짐육', '1종이컵'),
       (1724, '고추장', '4숟가락'),
       (1724, '물', '3숟가락'),
       (1724, '간장', '1숟가락'),
       (1724, '캡사이신가루', '1숟가락'),
       (1724, '후추', '약간'),
       (1724, '설탕', '1숟가락'),
       (1724, '꿀', '1숟가락'),
       (1724, '당근', '1/2개'),
       (1724, '애호박', '2개'),
       (1724, '달걀', '2개'),
       (1724, '시금치', '1줌'),
       (1724, '표고버섯', '1개'),
       (1724, '밥', '적당량'),
       (1724, '불닭소스', NULL);

-- 1725
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1725, '딸기', '8개'),
       (1725, '방울토마토', '3개'),
       (1725, '무화과', '2개'),
       (1725, '자몽', '1/2개'),
       (1725, '키위', '2개'),
       (1725, '파인애플', '3조각'),
       (1725, '샐러드채소', '적당량'),
       (1725, '아몬드', '약간');

-- 1726
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1726, '등갈비', '500g'),
       (1726, '소금', '약간'),
       (1726, '후추', '약간'),
       (1726, '식용유', '약간'),
       (1726, '밀가루', '적당량'),
       (1726, '월계수잎', '2장'),
       (1726, '통후추', '5알'),
       (1726, '마늘', '2개'),
       (1726, '대파', '1/2대'),
       (1726, '양파', '1/4개'),
       (1726, '바베큐 소스', '6숟가락'),
       (1726, '간장', '2숟가락'),
       (1726, '설탕', '2숟가락'),
       (1726, '올리고당', '1숟가락'),
       (1726, '다진마늘', '1숟가락'),
       (1726, '식초', '1숟가락'),
       (1726, '케찹', '2숟가락'),
       (1726, '머스터드', '1숟가락'),
       (1726, '고추장', '1숟가락');

-- 1727
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1727, '샐러드채소', '1줌'),
       (1727, '새싹채소', '1줌'),
       (1727, '방울토마토', '8개'),
       (1727, '블랙올리브', '8개'),
       (1727, '큐브 치즈', '6개'),
       (1727, '삶은 달걀', '1개'),
       (1727, '그라나파다노치즈', '약간'),
       (1727, '플레인요거트', '4숟가락'),
       (1727, '마요네즈', '2숟가락'),
       (1727, '레몬즙', '1숟가락'),
       (1727, '다진 양파', '2숟가락'),
       (1727, '소금', '약간'),
       (1727, '후추', '약간'),
       (1727, '설탕', '1/2숟가락');

-- 1728
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1728, '무염버터', '155g'),
       (1728, '설탕', '125g'),
       (1728, '소금', '1꼬집'),
       (1728, '달걀', '140g'),
       (1728, '바닐라익스트랙', '약간'),
       (1728, '박력분', '125g'),
       (1728, '코코아파우더', '42g'),
       (1728, '베이킹파우더', '2g'),
       (1728, '초콜릿칩', '70g'),
       (1728, '무염버터', '450g'),
       (1728, '슈가파우더', '300g'),
       (1728, '바닐라익스트랙', '약간'),
       (1728, '식용색소', NULL),
       (1728, '아이스크림 콘', '6개'),
       (1728, '코코넛 슬라이스', '약간'),
       (1728, '스프링클', NULL),
       (1728, '초코볼', '약간'),
       (1728, '젤리', '약간');

-- 1729
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1729, '감자', '4개'),
       (1729, '소금', '약간'),
       (1729, '후추', '약간'),
       (1729, '파슬리가루', '약간'),
       (1729, '버터', '3숟가락'),
       (1729, '토마토소스', '1/2종이컵'),
       (1729, '쥬키니호박', '1개'),
       (1729, '넛맥', '2꼬집'),
       (1729, '소고기', '200g'),
       (1729, '빵가루', '2숟가락'),
       (1729, '다진 양파', '3숟가락'),
       (1729, '피자치즈', '1종이컵');

-- 1730
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1730, '목살', '300g'),
       (1730, '양파', '1/2개'),
       (1730, '청주', '1숟가락'),
       (1730, '후추', '약간'),
       (1730, '고추장', '4숟가락'),
       (1730, '설탕', '1숟가락'),
       (1730, '올리고당', '1숟가락'),
       (1730, '다진마늘', '1/2숟가락'),
       (1730, '간장', '1/2숟가락'),
       (1730, '후추', '약간'),
       (1730, '고수', '2줌'),
       (1730, '고춧가루', '2숟가락'),
       (1730, '식초', '2숟가락'),
       (1730, '설탕', '1숟가락'),
       (1730, '참기름', '약간'),
       (1730, '통깨', '약간');

-- 1731
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1731, '또띠아', '1장'),
       (1731, '모짜렐라치즈', '1종이컵'),
       (1731, '딸기', '6개'),
       (1731, '블루베리', '1/4종이컵'),
       (1731, '샐러드채소', '1줌'),
       (1731, '크림치즈', '2숟가락'),
       (1731, '꿀', '2숟가락'),
       (1731, '발사믹크림', '적당량');

-- 1732
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1732, '다크초콜릿 커버춰', '75g'),
       (1732, '무염버터', '48g'),
       (1732, '생크림', '65g'),
       (1732, '달걀노른자', '65g'),
       (1732, '설탕', '32g'),
       (1732, '달걀흰자', '72g'),
       (1732, '설탕', '68g'),
       (1732, '코코아파우더', '48g'),
       (1732, '박력분', '20g'),
       (1732, '옥수수전분', '10g');

-- 1733
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1733, '소고기', '300g'),
       (1733, '양송이버섯', '4개'),
       (1733, '양파', '1/2개'),
       (1733, '빨강 파프리카', '1개'),
       (1733, '피망', '1개'),
       (1733, '소금', '약간'),
       (1733, '후추', '약간'),
       (1733, '버터', '1숟가락'),
       (1733, '돈까스소스', '2숟가락'),
       (1733, '스테이크소스', '4숟가락'),
       (1733, '케첩', '2숟가락'),
       (1733, '올리고당', '2숟가락'),
       (1733, '다진 마늘', '1/2숟가락'),
       (1733, '올리브유', '1숟가락'),
       (1733, '소금', '약간'),
       (1733, '후추', '약간');

-- 1734
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1734, '스파게티면', '70g'),
       (1734, '굴', '10개'),
       (1734, '마늘', '2알'),
       (1734, '다진마늘', '1/2스푼'),
       (1734, '실파', '3줄기'),
       (1734, '물', '1L'),
       (1734, '소금', '1숟가락'),
       (1734, '연두', '1숟가락'),
       (1734, '면수', '1/4종이컵'),
       (1734, '올리브유', '3숟가락');

-- 1735
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1735, '레드벨벳 머핀 믹스', '340g'),
       (1735, '달걀', '1개'),
       (1735, '식용유', '120ml'),
       (1735, '우유', '120ml'),
       (1735, '따뜻한 물', '4T'),
       (1735, '버터', '60g'),
       (1735, '크림치즈', '120g'),
       (1735, '슈가파우더', '140g'),
       (1735, '마시멜로우', '6개'),
       (1735, '코코넛가루', '적당량'),
       (1735, '초코 펜', '적당량'),
       (1735, '초코볼', '적당량'),
       (1735, '막대과자', '적당량');

-- 1736
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1736, '밥', '1공기'),
       (1736, '통마늘', '6개'),
       (1736, '다진 마늘', '1숟가락'),
       (1736, '대파', '10Cm'),
       (1736, '소금', '약간'),
       (1736, '간장', '1숟가락'),
       (1736, '후추', '약간'),
       (1736, '참기름', '1/2숟가락'),
       (1736, '깨소금', '1숟가락');

-- 1737
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1737, '대패삼겹살', '200g'),
       (1737, '부추', '1줌'),
       (1737, '양파', '1/4개'),
       (1737, '물', '3종이컵'),
       (1737, '간장', '1숟가락'),
       (1737, '청주', '1숟가락'),
       (1737, '후추', '약간'),
       (1737, '청양고추', '3개'),
       (1737, '간장', '3숟가락'),
       (1737, '식초', '3숟가락'),
       (1737, '설탕', '2숟가락'),
       (1737, '참기름', '1/2숟가락');

-- 1738
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1738, '배', '1개'),
       (1738, '대추', '2개'),
       (1738, '생강', '1개'),
       (1738, '꿀', '2숟가락'),
       (1738, '잣', '1/2숟가락');

-- 1739
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1739, '마시멜로우', '11개'),
       (1739, '스틱과자', '11개'),
       (1739, '주황젤리', NULL),
       (1739, '초코팬', NULL),
       (1739, '분홍팬', NULL),
       (1739, '흰색팬', NULL),
       (1739, '눈모양아이싱', NULL),
       (1739, '마시멜로우', '5개'),
       (1739, '꼬치', '5개'),
       (1739, '프레즐', '5개'),
       (1739, '코팅초콜릿', '2종이컵'),
       (1739, '초코팬', NULL),
       (1739, '초콜릿', '5개'),
       (1739, '눈모양아이싱', NULL),
       (1739, '슈가파우더', '150g'),
       (1739, '달걀흰자', '15g'),
       (1739, '레몬즙', '7g'),
       (1739, '따뜻한 물', '약간'),
       (1739, '식용 색소', '약간');

-- 1740
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1740, '닭가슴살', '2장'),
       (1740, '스프링 치즈', '4개'),
       (1740, '타임', '1줄기'),
       (1740, '화이트와인', '1/3종이컵'),
       (1740, '토마토소스', '1종이컵'),
       (1740, '마늘', '2알'),
       (1740, '소금', '약간'),
       (1740, '후추', '약간'),
       (1740, '올리브유', '약간');

-- 1741
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1741, '새우', '13마리'),
       (1741, '마늘', '10톨'),
       (1741, '소금', '약간'),
       (1741, '후추', '약간'),
       (1741, '올리브유', '1종이컵'),
       (1741, '페페론치노', '4개'),
       (1741, '바게트빵', NULL);

-- 1742
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1742, '롤케이크', '1개'),
       (1742, '누텔라', '적당량'),
       (1742, '초콜릿', '적당량'),
       (1742, '초코송이', '적당량');

-- 1743
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1743, '북어포', '1마리'),
       (1743, '진간장', '20ml'),
       (1743, '대파', '1토막'),
       (1743, '마늘', '2쪽'),
       (1743, '고추장', '40g'),
       (1743, '설탕', '10g'),
       (1743, '깨소금', '5g'),
       (1743, '참기름', '15ml'),
       (1743, '후추', '2g'),
       (1743, '식용유', '10ml');

-- 1744
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1744, '닭볶음탕용 닭', '1마리'),
       (1744, '당근', '1/2개'),
       (1744, '양파', '1/2개'),
       (1744, '샐러리', '1대'),
       (1744, '마늘', '8개'),
       (1744, '레드와인', '4종이컵'),
       (1744, '월계수잎', '2장'),
       (1744, '로즈마리', '1개'),
       (1744, '통후추', '10알'),
       (1744, '닭육수', '1종이컵'),
       (1744, '베이컨', '3줄'),
       (1744, '다진양파', '3숟가락'),
       (1744, '양송이버섯', '2개'),
       (1744, '밀가루', '3숟가락'),
       (1744, '버터', '2숟가락');

-- 1745
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1745, '연어', '1Kg'),
       (1745, '케이퍼', '약간'),
       (1745, '무순', '약간'),
       (1745, '양파', NULL),
       (1745, '고추냉이', '1숟가락'),
       (1745, '마요네즈', '4숟가락'),
       (1745, '꿀', '1숟가락'),
       (1745, '레몬즙', '1숟가락'),
       (1745, '소금', '약간'),
       (1745, '후추', '약간'),
       (1745, '크림치즈', '3숟가락'),
       (1745, '플레인요거트', '4숟가락'),
       (1745, '홀스래디쉬', '1+1/2숟가락'),
       (1745, '레몬즙', '약간'),
       (1745, '꿀', '약간'),
       (1745, '소금', '약간'),
       (1745, '후추', '약간'),
       (1745, '간장', '1/3종이컵'),
       (1745, '청주', '1/4종이컵'),
       (1745, '맛술', '1/4종이컵'),
       (1745, '설탕', '1/3종이컵'),
       (1745, '마늘', '3톨'),
       (1745, '대파', '1대'),
       (1745, '초고추장', '5숟가락'),
       (1745, '불닭소스', '2숟가락');

-- 1746
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1746, '또띠아', '4장'),
       (1746, '막대 과자', '적당량'),
       (1746, '피자치즈', '적당량'),
       (1746, '아보카도', '1개'),
       (1746, '양파', '1/4개'),
       (1746, '토마토', '1개'),
       (1746, '레몬즙', '2숟가락'),
       (1746, '다진마늘', '1/2숟가락'),
       (1746, '소금', '약간'),
       (1746, '후추', '약간'),
       (1746, '자른 방울토마토', '적당량'),
       (1746, '자른 주황파프리카', '1/2개'),
       (1746, '자른 노란파프리카', '1/2개'),
       (1746, '블랙올리브', '적당량');

-- 1747
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1747, '달걀', '2개'),
       (1747, '물', '150ml'),
       (1747, '식용유', '48ml'),
       (1747, '오뚜기찹쌀미니도나스믹스', NULL),
       (1747, '슈레드치즈', '200g');

-- 1748
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1748, '대하', '10마리'),
       (1748, '대파', '1/2대'),
       (1748, '두반장', '3숟가락'),
       (1748, '다진돼지고기', '3숟가락'),
       (1748, '생강', '1쪽'),
       (1748, '건고추', '3개'),
       (1748, '식초', '2숟가락'),
       (1748, '청주', '1숟가락'),
       (1748, '설탕', '1숟가락'),
       (1748, '식용유', '약간'),
       (1748, '후추', '약간');

-- 1749
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1749, '달걀', '126g'),
       (1749, '설탕', '63g'),
       (1749, '박력분', '63g'),
       (1749, '버터', '18g'),
       (1749, '바닐라 익스트랙', '약간');

-- 1750
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1750, '가래떡', '3줄'),
       (1750, '사과', '1개'),
       (1750, '꿀', '2숟가락'),
       (1750, '버터', '1숟가락'),
       (1750, '견과류', '1종이컵'),
       (1750, '간장', '1숟가락'),
       (1750, '참기름', '1숟가락');

-- 1751
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1751, '링귀니면', '150g'),
       (1751, '고구마줄기', '200g'),
       (1751, '다진돼지고기', '150g'),
       (1751, '다진마늘', '1숟가락'),
       (1751, '소금', '약간'),
       (1751, '들깨가루', '2숟가락'),
       (1751, '맛술', '2숟가락'),
       (1751, '올리브유', '2숟가락'),
       (1751, '간장', '2숟가락'),
       (1751, '치킨파우더', '1숟가락'),
       (1751, '소금', '1/4숟가락'),
       (1751, '후추', '약간');

-- 1752
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1752, '된장', '2숟가락'),
       (1752, '참치', '1캔'),
       (1752, '다진마늘', '1숟가락'),
       (1752, '풋고추', '2개'),
       (1752, '고춧가루', '1+1/2숟가락'),
       (1752, '파채', '1줌'),
       (1752, '바지락', '1종이컵'),
       (1752, '물', '1+1/2종이컵');

-- 1753
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1753, '멥쌀가루', '500g'),
       (1753, '사과', '200g'),
       (1753, '소금', '1/4숟가락'),
       (1753, '설탕', '7숟가락'),
       (1753, '물', '2숟가락'),
       (1753, '시나몬 가루', '1/4숟가락'),
       (1753, '레몬즙', '1/2숟가락');

-- 1754
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1754, '돼지고기 목살', '200g'),
       (1754, '양파', '1/2개'),
       (1754, '대파', '1/2대'),
       (1754, '식용유', '약간'),
       (1754, '고추장', '3숟가락'),
       (1754, '고춧가루', '1숟가락'),
       (1754, '간장', '1숟가락'),
       (1754, '설탕', '1숟가락'),
       (1754, '청주', '1숟가락'),
       (1754, '다진마늘', '1숟가락'),
       (1754, '생강즙', '1/3숟가락'),
       (1754, '깨소금', '1/3숟가락'),
       (1754, '참기름', '1/3숟가락'),
       (1754, '후춧가루', '약간');

-- 1755
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1755, '불린 쌀', '30g'),
       (1755, '불린 찹쌀', '12g'),
       (1755, '물', '400ml');

-- 1756
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1756, '두부', '100g'),
       (1756, '굴', '30g'),
       (1756, '쪽파', '1줄기'),
       (1756, '홍고추', '1/2개'),
       (1756, '새우젓', '10g'),
       (1756, '마늘', '1쪽'),
       (1756, '참기름', '5ml'),
       (1756, '소금', '5g');

-- 1757
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1757, '우렁', '150g'),
       (1757, '표고버섯', '2개'),
       (1757, '애호박', '1/3개'),
       (1757, '양파', '1/2개'),
       (1757, '대파', '1대'),
       (1757, '청양고추', '1개'),
       (1757, '홍고추', '1개'),
       (1757, '쌀뜨물', '2/3종이컵'),
       (1757, '참기름', '1숟가락'),
       (1757, '된장', '4숟가락'),
       (1757, '고춧가루', '1숟가락'),
       (1757, '다진 마늘', '1숟가락');

-- 1758
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1758, '닭', '1마리'),
       (1758, '감자', '2개'),
       (1758, '당근', '1/2개'),
       (1758, '양파', '1/2개'),
       (1758, '대파', '1대'),
       (1758, '청양고추', '1개'),
       (1758, '홍고추', '1개'),
       (1758, '물', '2+1/2종이컵'),
       (1758, '카레', '4숟가락'),
       (1758, '설탕', '1+1/2숟가락'),
       (1758, '고춧가루', '2숟가락'),
       (1758, '간장', '3숟가락'),
       (1758, '올리고당', '1숟가락'),
       (1758, '맛술', '1숟가락');

-- 1759
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1759, '만두피', '12장'),
       (1759, '달걀', '1/2개'),
       (1759, '초코잼', '적당량');

-- 1760
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1760, '두부', '100g'),
       (1760, '굴', '30g'),
       (1760, '쪽파', '1줄기'),
       (1760, '홍고추', '1/2개'),
       (1760, '새우젓', '10g'),
       (1760, '마늘', '1쪽'),
       (1760, '참기름', '5ml'),
       (1760, '소금', '5g');

-- 1761
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1761, '병아리콩', '1종이컵'),
       (1761, '샐러리', '1/2대'),
       (1761, '양파', '1/2개'),
       (1761, '다진마늘', '1숟가락'),
       (1761, '쥬키니호박', '1/4개'),
       (1761, '토마토 퓨레', '2종이컵'),
       (1761, '파프리카 파우더', '1/4숟가락'),
       (1761, '물', '1+1/2종이컵'),
       (1761, '소금', '약간'),
       (1761, '후추', '약간'),
       (1761, '올리브유', '약간'),
       (1761, '그라노파다노', '약간');

-- 1762
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1762, '낙지', '1마리'),
       (1762, '쪽파', '적당량'),
       (1762, '고추장', '2숟가락'),
       (1762, '식초', '1숟가락'),
       (1762, '설탕', '1/2숟가락'),
       (1762, '통깨', '1숟가락');

-- 1763
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1763, '1호 사이즈 제누와즈', '1개'),
       (1763, '생크림', '400g'),
       (1763, '설탕', '40g'),
       (1763, '물', '70g'),
       (1763, '설탕', '35g'),
       (1763, '골드키위', '1개'),
       (1763, '그린 키위', '1개'),
       (1763, '허브', '약간');

-- 1764
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1764, '쌀국수', '100g'),
       (1764, '참기름', '15g'),
       (1764, '오이', '30g'),
       (1764, '마장면소스', '80g'),
       (1764, '오이', '300g'),
       (1764, '청양고추', '45g'),
       (1764, '다진마늘', '20g'),
       (1764, '설탕', '30g'),
       (1764, '식초', '50g'),
       (1764, '소금', '12g'),
       (1764, '조미료', '8g'),
       (1764, '지마장', '20g'),
       (1764, '오이 물', '40g'),
       (1764, '간장', '20g'),
       (1764, '참기름', '10g');

-- 1765
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1765, '닭가슴살', '2쪽'),
       (1765, '매운 감자칩', '1줌'),
       (1765, '감자칩', '1줌'),
       (1765, '소금', '약간'),
       (1765, '후추', '약간'),
       (1765, '달걀', '1개'),
       (1765, '칠리파우더', '1/2숟가락'),
       (1765, '파프리카파우더', '1/2숟가락'),
       (1765, '밀가루', '적당량'),
       (1765, '튀김기름', '적당량');

-- 1766
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1766, '버터', '83g'),
       (1766, '중력분', '108g'),
       (1766, '베이킹파우더', '3g'),
       (1766, '소금', '1꼬집'),
       (1766, '설탕', '73g'),
       (1766, '레몬제스트', '1개분'),
       (1766, '레몬즙', '11g'),
       (1766, '달걀', '70g'),
       (1766, '사워크림', '30g'),
       (1766, '버터', '98g'),
       (1766, '크림치즈', '148g'),
       (1766, '슈가파우더', '90g'),
       (1766, '라즈베리 퓨레', '53g');

-- 1767
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1767, '밥', '1공기'),
       (1767, '양파', '20g'),
       (1767, '당근', '20g'),
       (1767, '애호박', '20g'),
       (1767, '게맛살', '70g'),
       (1767, '슬라이스 체다치즈', '1장'),
       (1767, '소금', '약간'),
       (1767, '참기름', '1숟가락');

-- 1768
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1768, '스파게티', '1인분'),
       (1768, '물', '3종이컵'),
       (1768, '양파', '1/4개'),
       (1768, '양송이버섯', '2개'),
       (1768, '새우', '6마리'),
       (1768, '오징어다리', '1/4개'),
       (1768, '다진마늘', '1숟가락'),
       (1768, '올리브오일', '약간'),
       (1768, '토마토소스', '2종이컵'),
       (1768, '고추장', '1숟가락'),
       (1768, '고춧가루', '1/2숟가락');

-- 1769
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1769, '다진돼지고기', '1+1/2종이컵'),
       (1769, '시금치', '2뿌리'),
       (1769, '홍고추', '1개'),
       (1769, '청고추', '1개'),
       (1769, '양파', '1/4개'),
       (1769, '식용유', '약간'),
       (1769, '다진마늘', '1숟가락'),
       (1769, '굴소스', '1/2숟가락'),
       (1769, '간장', '1숟가락'),
       (1769, '맛술', '1숟가락'),
       (1769, '소금', '약간'),
       (1769, '후추', '약간');

-- 1770
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1770, '모닝빵', '6개'),
       (1770, '비엔나 소세지', '24개'),
       (1770, '토마토소스', '6숟가락'),
       (1770, '옥수수콘', '6숟가락'),
       (1770, '피자치즈', '6숟가락'),
       (1770, '파슬리', '적당량'),
       (1770, '케찹', '약간'),
       (1770, '마요네즈', '약간');

-- 1771
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1771, '불린 쌀', '30g'),
       (1771, '물', '300ml');

-- 1772
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1772, '라자냐면', '7개'),
       (1772, '토마토소스', '4숟가락'),
       (1772, '올리브유', '적당량'),
       (1772, '달걀', '1개'),
       (1772, '리코타치즈', '1종이컵'),
       (1772, '그라노파다노치즈', '1/2종이컵'),
       (1772, '소금', '약간'),
       (1772, '후추', '약간'),
       (1772, '피자치즈', '1종이컵'),
       (1772, '크러쉬드페퍼', '약간');

-- 1773
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1773, '새우', '200g'),
       (1773, '다진마늘', '2숟가락'),
       (1773, '후추', '1숟가락'),
       (1773, '그린빈', '5줄'),
       (1773, '양상추', '1/4통'),
       (1773, '올리브유', '1숟가락'),
       (1773, '올리브유', '4숟가락'),
       (1773, '국간장', '2숟가락'),
       (1773, '꿀', '1숟가락'),
       (1773, '소금', '약간'),
       (1773, '후추', '약간'),
       (1773, '물', '2숟가락'),
       (1773, '매운 홍고추', '2개');

-- 1774
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1774, '마른 북어포', '1마리'),
       (1774, '진간장', '30mL'),
       (1774, '설탕', '10g'),
       (1774, '대파 흰부분', '1토막'),
       (1774, '마늘', '2쪽'),
       (1774, '생강', '5g'),
       (1774, '후추', '2g'),
       (1774, '깨소금', '5g'),
       (1774, '참기름', '5ml'),
       (1774, '실고추', '1~2줄기');

-- 1775
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1775, '간장마요면', '1개'),
       (1775, '간장닭강정', '1개'),
       (1775, '모짜렐라치즈', '1개'),
       (1775, '달걀', '1개');

-- 1776
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1776, '소고기', '300g'),
       (1776, '양파', '1/2개'),
       (1776, '당근', '1/4개'),
       (1776, '느타리버섯', '1줌'),
       (1776, '표고버섯', '2개'),
       (1776, '팽이버섯', '1줌'),
       (1776, '불린당면', '1줌'),
       (1776, '대파', '1/4대'),
       (1776, '홍고추', '1개'),
       (1776, '멸치다시마육수', '3종이컵'),
       (1776, '진간장', '2숟가락'),
       (1776, '설탕', '1숟가락'),
       (1776, '맛술', '1/2숟가락'),
       (1776, '다진마늘', '1/2숟가락'),
       (1776, '참기름', '1숟가락'),
       (1776, '후추', '약간'),
       (1776, '국간장', '1숟가락'),
       (1776, '후추', '약간');

-- 1777
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1777, '고구마', '6개'),
       (1777, '고구마', '3개'),
       (1777, '식용유', '적당량');

-- 1778
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1778, '굴', '10개'),
       (1778, '양배추', '1/4개'),
       (1778, '크림파스타 소스', '1종이컵'),
       (1778, '유자청', '2숟가락'),
       (1778, '소금', '약간'),
       (1778, '후추', '약간'),
       (1778, '케이퍼', '1/2숟가락');

-- 1779
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1779, '배추', '2포기'),
       (1779, '굵은소금', '2+1/2종이컵'),
       (1779, '물', '15종이컵'),
       (1779, '무', '1/2개'),
       (1779, '쪽파', '1줌'),
       (1779, '고춧가루', '2종이컵'),
       (1779, '멸치액젓', '1/2종이컵'),
       (1779, '새우젓', '1종이컵'),
       (1779, '간 양파', '1/2개'),
       (1779, '다진 마늘', '4숟가락'),
       (1779, '매실액', '4숟가락'),
       (1779, '간 배', '1/3개'),
       (1779, '다진 생강', '1숟가락'),
       (1779, '찹쌀풀', '1종이컵'),
       (1779, '물', '1+1/2종이컵'),
       (1779, '찹쌀가루', '2숟가락');

-- 1780
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1780, '방어', '2토막'),
       (1780, '다진 방울토마토', '1숟가락'),
       (1780, '다진 양파', '1숟가락'),
       (1780, '다진 샐러리', '1숟가락'),
       (1780, '다진 오이', '1숟가락'),
       (1780, '땅콩잼', '4숟가락'),
       (1780, '간장', '1/2숟가락'),
       (1780, '식초', '1/2숟가락'),
       (1780, '참기름', '1/2숟가락'),
       (1780, '물', '6숟가락');

-- 1781
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1781, '밥', '1공기'),
       (1781, '김가루', '3숟가락'),
       (1781, '토마토소스', '1/2종이컵'),
       (1781, '브로콜리', '1/4개'),
       (1781, '베이컨', '100g'),
       (1781, '옥수수콘', '3숟가락'),
       (1781, '양파', '1/4개'),
       (1781, '피자치즈', '1종이컵'),
       (1781, '올리브오일', '약간');

-- 1782
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1782, '떡', '350g'),
       (1782, '식용유', '약간'),
       (1782, '떡', '250g'),
       (1782, '물', '300mL'),
       (1782, '양파', '1/4개'),
       (1782, '사각어묵', '2장'),
       (1782, '떡', '250g'),
       (1782, '우유', '150mL'),
       (1782, '양파', '1/4개'),
       (1782, '식용유', '약간');

-- 1783
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1783, '소고기', '150g'),
       (1783, '무', '1토막'),
       (1783, '콩나물', '100g'),
       (1783, '대파', '2대'),
       (1783, '물', '5종이컵'),
       (1783, '참기름', '1숟가락'),
       (1783, '국간장', '1숟가락'),
       (1783, '고춧가루', '1숟가락'),
       (1783, '다진 마늘', '1/2숟가락'),
       (1783, '소금', '약간'),
       (1783, '후추', '약간');

-- 1784
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1784, '오리고기', '400g'),
       (1784, '양파', '1/2개'),
       (1784, '대파', '1/2대'),
       (1784, '깻잎', '6장'),
       (1784, '청양고추', '1개'),
       (1784, '참기름', '1/2숟가락'),
       (1784, '통깨', '약간'),
       (1784, '고추장', '1+1/2숟가락'),
       (1784, '고춧가루', '2숟가락'),
       (1784, '간장', '1+1/2숟가락'),
       (1784, '설탕', '1/2숟가락'),
       (1784, '올리고당', '1숟가락'),
       (1784, '다진 마늘', '1숟가락'),
       (1784, '맛술', '2숟가락'),
       (1784, '소금', '약간'),
       (1784, '후추', '약간');

-- 1785
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1785, '비스퀵', '2개'),
       (1785, '닭다리살', '100g'),
       (1785, '소금', '약간'),
       (1785, '후추', '약간'),
       (1785, '맛술', '1숟가락'),
       (1785, '로메인', '4장'),
       (1785, '스리라차소스', '약간'),
       (1785, '딸기잼', '약간'),
       (1785, '튀김기름', '약간'),
       (1785, '달걀', '1개'),
       (1785, '빵가루', '5숟가락'),
       (1785, '밀가루', '4숟가락'),
       (1785, '칠리파우더', '1숟가락'),
       (1785, '파슬리', '약간');

-- 1786
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1786, '돼지목살', '600g'),
       (1786, '소금', '1숟가락'),
       (1786, '후추', '1숟가락'),
       (1786, '흑설탕', '1숟가락'),
       (1786, '파프리카가루', '1숟가락'),
       (1786, '오레가노', '1/4숟가락'),
       (1786, '바질', '1/4숟가락'),
       (1786, '양파', '1개'),
       (1786, '코우슬로', '적당량'),
       (1786, '피클', '적당량'),
       (1786, '바베큐소스', '적당량'),
       (1786, '모닝빵', '적당량'),
       (1786, '버터', '적당량');

-- 1787
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1787, '양파', '3개'),
       (1787, '물', '1/2종이컵'),
       (1787, '식초', '1종이컵'),
       (1787, '설탕', '1종이컵'),
       (1787, '소금', '1숟가락'),
       (1787, '소면', '1인분'),
       (1787, '고추장', '2숟가락'),
       (1787, '간장', '1숟가락'),
       (1787, '맛술', '1숟가락'),
       (1787, '설탕', '1숟가락'),
       (1787, '매실', '1숟가락'),
       (1787, '깨소금', '1숟가락'),
       (1787, '참기름', '1/2숟가락');

-- 1788
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1788, '고구마', '4개'),
       (1788, '찹쌀가루', '2종이컵'),
       (1788, '우유', '1/2종이컵'),
       (1788, '설탕', '1/3종이컵'),
       (1788, '시나몬가루', '2/3숟가락');

-- 1789
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1789, '닭봉', '400g'),
       (1789, '견과류', '1/2종이컵'),
       (1789, '청주', '2숟가락'),
       (1789, '소금', '약간'),
       (1789, '후추', '약간'),
       (1789, '전분', '2숟가락'),
       (1789, '건고추', '5개'),
       (1789, '간장', '4숟가락'),
       (1789, '설탕', '2숟가락'),
       (1789, '조청', '1숟가락'),
       (1789, '식초', '1숟가락'),
       (1789, '물', '4숟가락'),
       (1789, '후추', '약간');

-- 1790
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1790, '갈치', '300g'),
       (1790, '고구마줄기', '200g'),
       (1790, '양파', '1/4개'),
       (1790, '대파', '1/2대'),
       (1790, '청양고추', '2개'),
       (1790, '멸치다시마육수', '1+1/2종이컵'),
       (1790, '쌀뜨물', '적당량'),
       (1790, '청주', '2숟가락'),
       (1790, '소금', '약간'),
       (1790, '진간장', '3숟가락'),
       (1790, '고춧가루', '3숟가락'),
       (1790, '고추장', '1숟가락'),
       (1790, '설탕', '2숟가락'),
       (1790, '올리고당', '1숟가락'),
       (1790, '다진마늘', '1숟가락'),
       (1790, '후추', '약간');

-- 1791
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1791, '풋고추', '10개'),
       (1791, '어묵', '3장'),
       (1791, '달걀', '2개'),
       (1791, '단무지', '5개'),
       (1791, '당근', '1/2개'),
       (1791, '김', '5장'),
       (1791, '밥', '3공기'),
       (1791, '맛살', '3개'),
       (1791, '참기름', '2숟가락'),
       (1791, '참깨', '1숟가락'),
       (1791, '소금', '1/2숟가락'),
       (1791, '다진 마늘', '1/2숟가락'),
       (1791, '간장', '2숟가락'),
       (1791, '물', '2숟가락'),
       (1791, '올리고당', '1숟가락'),
       (1791, '고춧가루', '1/2숟가락');

-- 1792
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1792, '소고기', '250g'),
       (1792, '가래떡', '100g'),
       (1792, '표고버섯', '1개'),
       (1792, '대파', '1대'),
       (1792, '설탕', '1숟가락'),
       (1792, '간장', '2+1/2숟가락'),
       (1792, '맛술', '1숟가락'),
       (1792, '다진 마늘', '1/2숟가락'),
       (1792, '올리고당', '1+1/2숟가락'),
       (1792, '참기름', '1/2숟가락'),
       (1792, '후추', '약간');

-- 1793
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1793, '북어포', '1마리'),
       (1793, '소금', '5g'),
       (1793, '진간장', '5ml'),
       (1793, '흰설탕', '10g'),
       (1793, '참기름', '15ml'),
       (1793, '깨소금', '5g'),
       (1793, '고춧가루', '10g');

-- 1794
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1794, '순살 삼치', '400g'),
       (1794, '전분가루', '5숟가락'),
       (1794, '식용유', '1숟가락'),
       (1794, '청주', '1숟가락'),
       (1794, '소금', '약간'),
       (1794, '후추', '약간'),
       (1794, '스위트칠리소스', '4숟가락'),
       (1794, '설탕', '1숟가락'),
       (1794, '간장', '1숟가락'),
       (1794, '식초', '1숟가락'),
       (1794, '물', '2숟가락');

-- 1795
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1795, '김', '적당량'),
       (1795, '찹쌀가루', '1/2종이컵'),
       (1795, '물', '1/2종이컵'),
       (1795, '소금', '1/2작은술'),
       (1795, '설탕', '1/2작은술'),
       (1795, '통깨', '적당량'),
       (1795, '식용유', '넉넉히');

-- 1796
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1796, '밤', '먹을만큼');

-- 1797
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1797, '귤', '8개'),
       (1797, '베이킹소다', '약간');

-- 1798
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1798, '낙지', '2마리'),
       (1798, '곱창', '200g'),
       (1798, '칵테일새우', '10마리'),
       (1798, '양파', '1개'),
       (1798, '배추', '4장'),
       (1798, '청고추', '1개'),
       (1798, '홍고추', '1개'),
       (1798, '부추', '50g'),
       (1798, '깻잎', '3장'),
       (1798, '멸치다시마육수', '1+1/2종이컵'),
       (1798, '고추장', '2숟가락'),
       (1798, '고춧가루', '1숟가락'),
       (1798, '국간장', '2숟가락'),
       (1798, '다진 마늘', '1숟가락'),
       (1798, '맛술', '1숟가락'),
       (1798, '후추', '약간');

-- 1799
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1799, '다진 소고기', '1종이컵'),
       (1799, '다진 돼지고기', '2/3종이컵'),
       (1799, '다진 양파', '1/4개'),
       (1799, '빵가루', '2숟가락'),
       (1799, '소금', '약간'),
       (1799, '후추', '약간'),
       (1799, '아몬드', '1/2종이컵'),
       (1799, '마늘', '1통'),
       (1799, '빵가루', '2숟가락'),
       (1799, '화이트와인', '1/2종이컵'),
       (1799, '치킨파우더', '1/2숟가락'),
       (1799, '물', '1종이컵'),
       (1799, '올리브유', '2숟가락');

-- 1800
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1800, '소세지', '3개'),
       (1800, '콩나물', '1줌'),
       (1800, '우동', '1개'),
       (1800, '다진마늘', '1숟가락'),
       (1800, '물', '5숟가락'),
       (1800, '식용유', '약간');

-- 1801
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1801, '알배추', '1/4개'),
       (1801, '실파', '2줄기'),
       (1801, '연두', '1숟가락'),
       (1801, '설탕', '1숟가락'),
       (1801, '식초', '2숟가락'),
       (1801, '고춧가루', '2숟가락'),
       (1801, '무', '1/10개'),
       (1801, '물', '4숟가락'),
       (1801, '포도씨유', '1/2숟가락'),
       (1801, '연두', '1숟가락'),
       (1801, '깨', '1/2숟가락'),
       (1801, '참기름', '1/4숟가락');

-- 1802
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1802, '발효 버터', '79g'),
       (1802, '슈가파우더', '35g'),
       (1802, '소금', '1꼬집'),
       (1802, '달걀 노른자', '7g'),
       (1802, '박력분', '118g'),
       (1802, '호두', '69g');

-- 1803
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1803, '박력분', '180g'),
       (1803, '베이킹파우더', '6g'),
       (1803, '설탕', '15g'),
       (1803, '소금', '2g'),
       (1803, '버터', '70g'),
       (1803, '우유', '100g');

-- 1804
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1804, '크래커', '2개'),
       (1804, '말랑카우', '2개'),
       (1804, '초콜릿', '1조각'),
       (1804, '초코다이제', '2개'),
       (1804, '마시멜로우', '1개');

-- 1805
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1805, '해시브라운', '6조각'),
       (1805, '치킨너겟', '6조각'),
       (1805, '양상추', '3장'),
       (1805, '양파', '1/4개'),
       (1805, '토마토', '1/2개'),
       (1805, '베이컨', '3줄'),
       (1805, '슬라이스치즈', '3장'),
       (1805, '케찹', '적당량');

-- 1806
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1806, '만두', '8개'),
       (1806, '양파', '1/4개'),
       (1806, '대파', '1대'),
       (1806, '홍고추', '1개'),
       (1806, '달걀', '2개'),
       (1806, '멸치다시백', '1개'),
       (1806, '물', '4종이컵'),
       (1806, '다진 마늘', '1숟가락'),
       (1806, '국간장', '1숟가락'),
       (1806, '참치액', '1숟가락'),
       (1806, '후추', '약간'),
       (1806, '만개한알', '1알');

-- 1807
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1807, '연어', '2토막'),
       (1807, '양파', '1/2개'),
       (1807, '마늘', '2개'),
       (1807, '소금', '약간'),
       (1807, '후추', '약간'),
       (1807, '쪽파', '약간'),
       (1807, '참치액', '2숟가락'),
       (1807, '간장', '2숟가락'),
       (1807, '청주', '2숟가락'),
       (1807, '설탕', '1+1/2숟가락'),
       (1807, '올리고당', '2숟가락'),
       (1807, '물', '2숟가락');

-- 1808
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1808, '오뚜기 3일숙성카레 고형', '3조각'),
       (1808, '양파', '1/2개'),
       (1808, '순토마토퓨레', '3숟가락'),
       (1808, '이금기 치킨파우더', '1작은숟가락'),
       (1808, '양파', '1/2개'),
       (1808, '다진 마늘', '1숟가락'),
       (1808, '버터', '1숟가락'),
       (1808, '물', '2.5컵'),
       (1808, '밥', '2공기'),
       (1808, '슬라이스 치즈', '2장'),
       (1808, '가지', NULL),
       (1808, '당근', NULL),
       (1808, '연근', NULL),
       (1808, '옥수수', NULL),
       (1808, '브로콜리', NULL);

-- 1809
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1809, '식빵', '3장'),
       (1809, '슬라이스치즈', '4장'),
       (1809, '슬라이스햄', '4장'),
       (1809, '딸기잼', '적당량'),
       (1809, '달걀', '1개'),
       (1809, '빵가루', '1종이컵'),
       (1809, '식용유', '약간');

-- 1810
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1810, '오이', '1/2개'),
       (1810, '건표고버섯', '1개'),
       (1810, '대파', '1토막'),
       (1810, '마늘', '1쪽'),
       (1810, '소고기', '30g'),
       (1810, '식용유', '30ml'),
       (1810, '소금', '5g'),
       (1810, '진간장', '20ml'),
       (1810, '깨소금', '5g'),
       (1810, '참기름', '5ml'),
       (1810, '흰설탕', '5g'),
       (1810, '검은 후춧가루', '1g'),
       (1810, '실고추', '1~2줄기');

-- 1811
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1811, '편의점 치킨꼬치', '2개'),
       (1811, '크림스프 가루', '40g'),
       (1811, '뜨거운물', '2종이컵'),
       (1811, '옥수수콘', '1종이컵'),
       (1811, '모짜렐라 치즈', '2봉');

-- 1812
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1812, '닭', '1마리'),
       (1812, '가래떡', '300g'),
       (1812, '양파', '1/2개'),
       (1812, '감자', '2개'),
       (1812, '대파', '1대'),
       (1812, '청양고추', '1개'),
       (1812, '청주', '3숟가락'),
       (1812, '물', '3종이컵'),
       (1812, '고춧가루', '4숟가락'),
       (1812, '설탕', '2숟가락'),
       (1812, '다진 마늘', '1+1/2숟가락'),
       (1812, '간장', '3숟가락'),
       (1812, '맛술', '1숟가락'),
       (1812, '고추장', '2숟가락'),
       (1812, '후추', '약간');

-- 1813
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1813, '박력분', '100g'),
       (1813, '중력분', '80g'),
       (1813, '베이킹파우더', '1/2숟가락'),
       (1813, '설탕', '30g'),
       (1813, '소금', '1/4숟가락'),
       (1813, '달걀', '1개'),
       (1813, '우유', '1종이컵'),
       (1813, '녹인버터', '25g'),
       (1813, '바닐라에센스', '약간'),
       (1813, '양상추', '약간'),
       (1813, '베이컨', '5줄'),
       (1813, '토마토', '1/2개'),
       (1813, '양파', '1/2개'),
       (1813, '딸기잼', '2숟가락'),
       (1813, '후추', '약간');

-- 1814
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1814, '링귀니면', '80g'),
       (1814, '새우', '2마리'),
       (1814, '모시조개', '200g'),
       (1814, '생크림', '2종이컵'),
       (1814, '마늘', '3쪽'),
       (1814, '양파', '1/4개'),
       (1814, '화이트와인', '2숟가락'),
       (1814, '소금', '약간'),
       (1814, '후추', '약간'),
       (1814, '면수', '1/2종이컵'),
       (1814, '올리브유', '적당량');

-- 1815
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1815, '콩나물', '200g'),
       (1815, '낙지', '300g'),
       (1815, '바지락', '200g'),
       (1815, '양파', '1/2개'),
       (1815, '대파', '1대'),
       (1815, '홍고추', '1/2개'),
       (1815, '청고추', '1/2개'),
       (1815, '미나리', '30g'),
       (1815, '물', '2/3종이컵'),
       (1815, '참기름', '1숟가락'),
       (1815, '통깨', '약간'),
       (1815, '고추장', '1숟가락'),
       (1815, '고춧가루', '3숟가락'),
       (1815, '간장', '1숟가락'),
       (1815, '맛술', '1숟가락'),
       (1815, '매실액', '1숟가락'),
       (1815, '설탕', '1/2숟가락'),
       (1815, '다진 마늘', '1숟가락');

-- 1816
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1816, '가지', '2개'),
       (1816, '베이컨', '3줄'),
       (1816, '생크림', '1/3종이컵'),
       (1816, '빵가루', '3숟가락'),
       (1816, '파마산치즈가루', '3숟가락'),
       (1816, '피자치즈', '1줌'),
       (1816, '올리브유', '약간'),
       (1816, '소금', '약간'),
       (1816, '후추', '약간');

-- 1817
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1817, '밤', '300g'),
       (1817, '설탕', '60g'),
       (1817, '메이플시럽', '30g'),
       (1817, '물', '90g');

-- 1818
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1818, '생강', '적당량'),
       (1818, '생강', '2개'),
       (1818, '설탕', '1종이컵'),
       (1818, '꿀', '3숟가락');

-- 1819
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1819, '김', '20장'),
       (1819, '멸치다시마 육수', '300ml'),
       (1819, '찹쌀가루', '100g'),
       (1819, '참깨', '2숟가락'),
       (1819, '다시마', NULL),
       (1819, '멸치다시마 육수', '300ml'),
       (1819, '찹쌀가루', '100g'),
       (1819, '찹쌀 밥', '1/2종이컵'),
       (1819, '미역', NULL),
       (1819, '멸치다시마 육수', '300ml'),
       (1819, '찹쌀가루', '100g');

-- 1820
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1820, '병아리콩', '2종이컵'),
       (1820, '마늘', '3개'),
       (1820, '레몬즙', '5숟가락'),
       (1820, '마요네즈', '6숟가락'),
       (1820, '땅콩버터', '5숟가락'),
       (1820, '큐민파우더', '1/4숟가락'),
       (1820, '올리브유', '1+1/2종이컵'),
       (1820, '소금', '약간'),
       (1820, '후추', '약간'),
       (1820, '또띠아', '2장'),
       (1820, '양상추', '3장'),
       (1820, '크래미', '2개'),
       (1820, '빨강파프리카', '1/4개'),
       (1820, '청피망', '1/4개'),
       (1820, '노란파프리카', '1/4개');

-- 1821
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1821, '또띠아', '7개'),
       (1821, '다진소고기', '1종이컵'),
       (1821, '후추', '약간'),
       (1821, '양파', '1/4개'),
       (1821, '양송이버섯', '3개'),
       (1821, '토마토소스', '1+1/2종이컵'),
       (1821, '파마산 치즈', '1숟가락'),
       (1821, '피자치즈', '적당량'),
       (1821, '올리브유', '적당량'),
       (1821, '바질가루', '1/5숟가락'),
       (1821, '오레가노가루', '1/5숟가락');

-- 1822
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1822, '주꾸미 볶음면', '1봉'),
       (1822, '콩나물', '1줌'),
       (1822, '깻잎', '5장'),
       (1822, '양파', '1/4개'),
       (1822, '참기름', '1숟가락'),
       (1822, '밥', '1공기'),
       (1822, '김가루', '약간');

-- 1823
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1823, '가래떡', '2줄'),
       (1823, '계핏가루', '1숟가락'),
       (1823, '설탕', '3숟가락');

-- 1824
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1824, '찰 보리', '1종이컵'),
       (1824, '닭가슴살', '1쪽'),
       (1824, '빨간 파프리카', '1/4개'),
       (1824, '노란파프리카', '1/4개'),
       (1824, '블랙올리브', '2숟가락'),
       (1824, '방울토마토', '10개'),
       (1824, '올리브유', '4숟가락'),
       (1824, '레몬즙', '3숟가락'),
       (1824, '소금', '약간'),
       (1824, '후추', '약간'),
       (1824, '설탕', '1/2숟가락'),
       (1824, '베이비채소', '약간');

-- 1825
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1825, '무', '120g'),
       (1825, '미나리', '20g'),
       (1825, '대파', '1토막'),
       (1825, '마늘', '1쪽'),
       (1825, '소고기', '30g'),
       (1825, '식용유', '30ml'),
       (1825, '진간장', '50ml'),
       (1825, '깨소금', '5g'),
       (1825, '참기름', '5ml'),
       (1825, '흰설탕', '5g'),
       (1825, '검은 후춧가루', '1g'),
       (1825, '실고추', '1~2줄기');

-- 1826
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1826, '케이크 시트', '1cm두께 5장'),
       (1826, '생크림', '350g'),
       (1826, '설탕', '30g'),
       (1826, '스틱 과자', '40개'),
       (1826, '코팅용 초콜릿 {화이트}', '300g'),
       (1826, '초코펜', NULL),
       (1826, '스프링클', '적당량');

-- 1827
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1827, '된장', '1종이컵'),
       (1827, '다진양파', '1/2개'),
       (1827, '다진대파', '1/2대'),
       (1827, '청주', '2숟가락'),
       (1827, '설탕', '2숟가락'),
       (1827, '다진 마늘', '2숟가락'),
       (1827, '물', '6숟가락'),
       (1827, '시금치', '150g'),
       (1827, '대파', '1/2대'),
       (1827, '소금', '1/2숟가락'),
       (1827, '참기름', '1숟가락'),
       (1827, '통깨', '약간'),
       (1827, '고등어', '1마리'),
       (1827, '무', '1토막'),
       (1827, '양파', '1/2개'),
       (1827, '청고추', '1/2개'),
       (1827, '홍고추', '1/2개');

-- 1828
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1828, '발효 버터', '79g'),
       (1828, '슈가파우더', '35g'),
       (1828, '소금', '1꼬집'),
       (1828, '달걀 노른자', '7g'),
       (1828, '박력분', '118g'),
       (1828, '얼그레이티', '2g'),
       (1828, '설탕', '적당량');

-- 1829
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1829, '명란', '8개'),
       (1829, '설탕', '1숟가락'),
       (1829, '간장', '1/2숟가락'),
       (1829, '마요네즈', '5숟가락');

-- 1830
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1830, '스틱 과자', '30개'),
       (1830, '달걀흰자', '80g'),
       (1830, '설탕', '65g'),
       (1830, '색소', '적당량');

-- 1831 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1831, '사과', '2개'),
       (1831, '설탕', '240g'),
       (1831, '레몬즙', '1T'),
       (1831, '시나몬 스틱', '1개');

-- 1832 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1832, '가지', '1개'),
       (1832, '전분', '4숟가락'),
       (1832, '청양고추', '1개'),
       (1832, '홍고추', '1/2개'),
       (1832, '고추기름', '2숟가락'),
       (1832, '대파', '1/2대'),
       (1832, '다진마늘', '1숟가락'),
       (1832, '튀김기름', '적당량'),
       (1832, '깐풍소스', '1/3종이컵'),
       (1832, '땅콩가루', '1숟가락'),
       (1832, '간장', '8숟가락'),
       (1832, '물', '2/3종이컵'),
       (1832, '설탕', '6숟가락'),
       (1832, '식초', '6숟가락'),
       (1832, '간장', '8숟가락'),
       (1832, '물', '2/3종이컵'),
       (1832, '설탕', '6숟가락'),
       (1832, '식초', '6숟가락'),
       (1832, '가지', '1개'),
       (1832, '전분', '4숟가락'),
       (1832, '청양고추', '1개'),
       (1832, '홍고추', '1/2개'),
       (1832, '고추기름', '2숟가락'),
       (1832, '대파', '1/2대'),
       (1832, '다진마늘', '1숟가락'),
       (1832, '튀김기름', '적당량'),
       (1832, '깐풍소스', '1/3종이컵'),
       (1832, '땅콩가루', '1숟가락'),
       (1832, '양상추', '1/2개'),
       (1832, '닭다리살', '300g'),
       (1832, '소금', '약간'),
       (1832, '후추', '약간'),
       (1832, '청주', '1숟가락'),
       (1832, '맛술', '1숟가락'),
       (1832, '다진마늘', '1숟가락'),
       (1832, '대파', '1/2대'),
       (1832, '청양고추', '1개'),
       (1832, '홍고추', '1/2개'),
       (1832, '튀김기름', '적당량'),
       (1832, '깐풍소스', '1/4종이컵'),
       (1832, '전분', '1종이컵'),
       (1832, '물', '2/3종이컵'),
       (1832, '가자미', '2마리'),
       (1832, '소금', '약간'),
       (1832, '후추', '약간'),
       (1832, '청주', '약간'),
       (1832, '맛술', '2숟가락'),
       (1832, '대파', '3대'),
       (1832, '마늘', '3알'),
       (1832, '깐풍소스', '6숟가락'),
       (1832, '식용유', '4숟가락');

-- 1833번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1833, '뽕잎크림 스프레드', '2숟가락'),
       (1833, '우유', '200ml'),
       (1833, '생크림', '100ml');

-- 1834번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1834, '데친 고구마순', '200g'),
       (1834, '홍고추', '1/2개'),
       (1834, '쪽파', '2줄기'),
       (1834, '고춧가루', '2숟가락'),
       (1834, '국간장', '1숟가락'),
       (1834, '까나리액젓', '1/2숟가락'),
       (1834, '설탕', '1/2숟가락'),
       (1834, '다진마늘', '1/2숟가락'),
       (1834, '통깨', '약간'),
       (1834, '참기름', '약간');

-- 1835번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1835, '김', '2장'),
       (1835, '소시지', '2개'),
       (1835, '당근', '1/2개'),
       (1835, '단무지', '1개'),
       (1835, '김밥용 우엉', '4줄'),
       (1835, '마요네즈', '1숟가락'),
       (1835, '식용유', '약간'),
       (1835, '참기름', '약간'),
       (1835, '참깨', '약간'),
       (1835, '소금', '약간'),
       (1835, '달걀', '1개'),
       (1835, '소금', '1/6숟가락'),
       (1835, '소시지', '2개'),
       (1835, '간장', '1숟가락'),
       (1835, '물엿', '1숟가락'),
       (1835, '시금치', '50g'),
       (1835, '소금', '약간'),
       (1835, '참기름', '약간'),
       (1835, '밥', '2공기'),
       (1835, '참기름', '1숟가락'),
       (1835, '소금', '1/4숟가락');

-- 1836번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1836, '참깨', '1/2종이컵'),
       (1836, '포도씨유', '3숟가락'),
       (1836, '가지', '1개'),
       (1836, '타히니소스', '2숟가락'),
       (1836, '소금', '약간'),
       (1836, '올리브유', '1숟가락'),
       (1836, '다진마늘', '1/2숟가락'),
       (1836, '큐민파우더', '1/4숟가락'),
       (1836, '레몬즙', '2숟가락'),
       (1836, '펜네', '2종이컵');

-- 1837번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1837, '바나나', '적당량'),
       (1837, '설탕', '적당량'),
       (1837, '콘푸라이트', '적당량'),
       (1837, '우유', '적당량'),
       (1837, '바나나칩', '1/2종이컵'),
       (1837, '그래놀라', '1종이컵'),
       (1837, '견과류', '1/2종이컵'),
       (1837, '설탕', '5숟가락'),
       (1837, '물', '3숟가락'),
       (1837, '올리고당', '2숟가락');

-- 1838번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1838, '돼지고기', '400g'),
       (1838, '청주', '1/2종이컵'),
       (1838, '설탕', '1숟가락'),
       (1838, '후추', '약간'),
       (1838, '간장', '1/3종이컵'),
       (1838, '액젓', '1/2숟가락'),
       (1838, '설탕', '2숟가락'),
       (1838, '매실청', '2숟가락'),
       (1838, '맛술', '1숟가락'),
       (1838, '마늘', '3개'),
       (1838, '생강', '1개'),
       (1838, '건고추', '3개'),
       (1838, '참기름', '2숟가락'),
       (1838, '후추', '약간'),
       (1838, '청양고추', '4개');

-- 1839번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1839, '뽕잎가루', '20g'),
       (1839, '무염버터', '200g'),
       (1839, '박력분', '300g'),
       (1839, '슈가파우더', '80g'),
       (1839, '소금', '1g'),
       (1839, '초코칩', '50g');

-- 1840번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1840, '감자', '2개'),
       (1840, '게맛살', '100g'),
       (1840, '양파', '1/2개'),
       (1840, '피클', '6조각'),
       (1840, '모닝빵', '8개'),
       (1840, '마요네즈', '4숟가락'),
       (1840, '설탕', '1+1/2숟가락'),
       (1840, '머스터드', '1숟가락'),
       (1840, '소금', '약간'),
       (1840, '후추', '약간'),
       (1840, '파슬리가루', '약간');

-- 1841
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1841, '돼지고기', '400g'),
       (1841, '양파', '1/2개'),
       (1841, '당근', '1/4개'),
       (1841, '청양고추', '1/2개'),
       (1841, '홍고추', '1/2개'),
       (1841, '대파', '1/2대'),
       (1841, '통깨', '약간'),
       (1841, '물', '5숟가락'),
       (1841, '식용유', '약간'),
       (1841, '고추장', '2숟가락'),
       (1841, '고춧가루', '1+1/2숟가락'),
       (1841, '간장', '2숟가락'),
       (1841, '다진 마늘', '2숟가락'),
       (1841, '설탕', '1숟가락'),
       (1841, '매실액', '1숟가락'),
       (1841, '맛술', '1숟가락'),
       (1841, '소금', '약간'),
       (1841, '후추', '약간');

-- 1842
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1842, '사과', '3개'),
       (1842, '베이킹소다', '약간'),
       (1842, '사과', '3개'),
       (1842, '꿀', '400g'),
       (1842, '계피가루', '2숟가락');

-- 1843
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1843, '삼겹살', '300g'),
       (1843, '대파', '1대'),
       (1843, '통마늘', '8개'),
       (1843, '청양고추', '2개'),
       (1843, '맛술', '1숟가락'),
       (1843, '소금', '약간'),
       (1843, '후추', '약간'),
       (1843, '고추장', '2숟가락'),
       (1843, '올리고당', '3숟가락'),
       (1843, '식초', '2숟가락'),
       (1843, '맛술', '1숟가락'),
       (1843, '물', '1숟가락'),
       (1843, '다진 마늘', '1숟가락'),
       (1843, '후추', '약간');

-- 1844
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1844, '소고기', '200g'),
       (1844, '양파', '1/2개'),
       (1844, '빨강 파프리카', '1/2개'),
       (1844, '노랑 파프리카', '1/2개'),
       (1844, '팽이버섯', '1/2줌'),
       (1844, '깻잎', '10장'),
       (1844, '간장', '2숟가락'),
       (1844, '물', '1/2숟가락'),
       (1844, '식초', '1/2숟가락'),
       (1844, '설탕', '1/2숟가락'),
       (1844, '다진 마늘', '1/2숟가락'),
       (1844, '연겨자', '1/2숟가락'),
       (1844, '소금', '약간'),
       (1844, '후추', '약간');

-- 1845
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1845, '양파', '2개'),
       (1845, '다진소고기', '100g'),
       (1845, '토마토소스', '2숟가락'),
       (1845, '오레가노', '약간'),
       (1845, '소금', '약간'),
       (1845, '후추', '약간');

-- 1846
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1846, '도토리묵', '300g'),
       (1846, '묵말랭이', '300g'),
       (1846, '양파', '1/2개'),
       (1846, '당근', '1/4개'),
       (1846, '청고추', '1/2개'),
       (1846, '홍고추', '1/2개'),
       (1846, '통깨', '약간'),
       (1846, '식용유', '약간'),
       (1846, '멸치다시마육수', '1/2종이컵'),
       (1846, '국간장', '2숟가락'),
       (1846, '설탕', '1숟가락'),
       (1846, '맛술', '1숟가락'),
       (1846, '다진마늘', '1숟가락'),
       (1846, '소금', '약간'),
       (1846, '후추', '약간'),
       (1846, '참기름', '약간');

-- 1847
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1847, '대구', '200g'),
       (1847, '연두부', '2개'),
       (1847, '다진 대파', '2숟가락'),
       (1847, '다진 샐러리', '2숟가락'),
       (1847, '다진 양파', '2숟가락'),
       (1847, '다진 생강', '약간'),
       (1847, '칠리 소스', '2숟가락'),
       (1847, '느억맘 소스', '2숟가락'),
       (1847, '참기름', '1/2숟가락');

-- 1848
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1848, '편의점 치킨', '적당량'),
       (1848, '불닭소스', '5숟가락'),
       (1848, '양념치킨소스', '1개'),
       (1848, '감자샐러드', '1개'),
       (1848, '치즈나쵸', '1개');

-- 1849
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1849, '순살 고등어', '1개'),
       (1849, '다진 당근', '2숟가락'),
       (1849, '다진 양파', '2숟가락'),
       (1849, '옥수수콘', '2숟가락'),
       (1849, '양송이 버섯', '3개'),
       (1849, '굴소스', '1/2숟가락'),
       (1849, '버터', '20g'),
       (1849, '다진 마늘', '1/4숟가락'),
       (1849, '불린 쌀', '150g');

-- 1850
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1850, '편마늘', '1숟가락'),
       (1850, '곱창', '2/3종이컵'),
       (1850, '밥', '1공기'),
       (1850, '양파', '1/4개'),
       (1850, '부추', '2줄기'),
       (1850, '참기름', '1숟가락'),
       (1850, '통깨', '약간'),
       (1850, '고추장', '1숟가락'),
       (1850, '고춧가루', '1숟가락'),
       (1850, '간장', '1/2숟가락'),
       (1850, '맛술', '1/2숟가락'),
       (1850, '설탕', '1/4숟가락');

-- 1851번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1851, '도라지', '300g'),
       (1851, '대추', '10개'),
       (1851, '쌀조청', '400g~500g'),
       (1851, '시나몬 가루', '1/2숟가락'),
       (1851, '레몬즙', '1숟가락');

-- 1852번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1852, '김', '1+1/2장'),
       (1852, '밥', '1공기'),
       (1852, '참치', '1캔'),
       (1852, '묵은지', '3줄'),
       (1852, '우엉', '1줄'),
       (1852, '당근', '1/2개'),
       (1852, '단무지', '1줄'),
       (1852, '시금치', '10줄'),
       (1852, '달걀', '2개'),
       (1852, '소금', '약간'),
       (1852, '후추', '약간'),
       (1852, '통깨', '약간'),
       (1852, '참기름', '약간'),
       (1852, '식용유', '약간'),
       (1852, '마요네즈', '2숟가락'),
       (1852, '통깨', '약간'),
       (1852, '소금', '1/4숟가락'),
       (1852, '참기름', '약간'),
       (1852, '소금', '1/4숟가락'),
       (1852, '참기름', '약간');

-- 1853번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1853, '달걀', '70g'),
       (1853, '설탕', '70g'),
       (1853, '물엿', '25g'),
       (1853, '꿀', '25g'),
       (1853, '박력분', '70g'),
       (1853, '코코아파우더', '14g'),
       (1853, '베이킹파우더', '2g'),
       (1853, '소금', '약간'),
       (1853, '초코칩', '35g'),
       (1853, '무염버터', '81g'),
       (1853, '다크초콜릿 커버춰', '91g'),
       (1853, '슈가파우더', '150g'),
       (1853, '달걀흰자', '15g'),
       (1853, '레몬즙', '7g'),
       (1853, '따뜻한 물', '약간'),
       (1853, '식용 색소', '약간'),
       (1853, '코팅용화이트초콜릿', NULL),
       (1853, '오레오', NULL),
       (1853, '프레즐', NULL),
       (1853, '참깨스틱', NULL),
       (1853, '젤리', NULL),
       (1853, '로열아이싱', NULL),
       (1853, '초코펜', NULL),
       (1853, '초코볼', NULL),
       (1853, '롤리팝스틱', NULL);

-- 1854번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1854, '쌀조청', '1종이컵'),
       (1854, '호두', '1+1/2종이컵'),
       (1854, '땅콩', '1종이컵'),
       (1854, '아몬드', '1종이컵'),
       (1854, '아몬드 슬라이스', '1종이컵'),
       (1854, '해바라기씨', '1종이컵'),
       (1854, '건크렌베리', '1종이컵');

-- 1855번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1855, '어묵탕', '1개'),
       (1855, '자른김치', '1봉'),
       (1855, '밥', '1공기'),
       (1855, '콩나물', '1/2줌'),
       (1855, '조미김가루', '약간');

-- 1856번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1856, '불린 쌀', '30g'),
       (1856, '불린 차조', '10g'),
       (1856, '바나나', '10g'),
       (1856, '물', '400ml');

-- 1857번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1857, '불린 쌀', '150g'),
       (1857, '콩나물', '60g'),
       (1857, '소고기', '30g'),
       (1857, '대파', '1/2토막'),
       (1857, '마늘', '1쪽'),
       (1857, '진간장', '5ml'),
       (1857, '참기름', '5ml');

-- 1858번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1858, '부추', '1줌'),
       (1858, '물', '1종이컵'),
       (1858, '부침가루', '1종이컵'),
       (1858, '소금', '1/3숟가락'),
       (1858, '밥', '1공기'),
       (1858, '소금', '1/4숟가락'),
       (1858, '참기름', '1숟가락'),
       (1858, '통깨', '1/2숟가락'),
       (1858, '오징어', '1/2마리'),
       (1858, '식용유', '적당량'),
       (1858, '초고추장', '적당량');

-- 1859번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1859, '달걀', '4개'),
       (1859, '밥', '1/2공기'),
       (1859, '대파', '50g'),
       (1859, '당근', '50g'),
       (1859, '양파', '50g'),
       (1859, '소금', '약간');

-- 1860번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1860, '다진소고기', '2종이컵'),
       (1860, '양파', '1/2개'),
       (1860, '피망', '1/2개'),
       (1860, '다진마늘', '2숟가락'),
       (1860, '큐민 파우더', '1/2숟가락'),
       (1860, '파프리카파우더', '1/2숟가락'),
       (1860, '칠리파우더', '2숟가락'),
       (1860, '스위트콘', '1/2종이컵'),
       (1860, '강낭콩 통조림', '1/2종이컵'),
       (1860, '소금', '약간'),
       (1860, '후추', '약간'),
       (1860, '슈레드 체다치즈', '1종이컵'),
       (1860, '식용유', '약간'),
       (1860, '홀토마토', '1+1/2종이컵'),
       (1860, '파마산치즈가루', '2숟가락'),
       (1860, '사워크림', '적당량'),
       (1860, '또띠아', '3장');

-- 1861
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1861, '칼국수면', '1인분'),
       (1861, '김치', '2/3종이컵'),
       (1861, '바지락', '1종이컵'),
       (1861, '대파', '1/2대'),
       (1861, '청양고추', '1개'),
       (1861, '멸치다시마육수', '2+1/2종이컵'),
       (1861, '참기름', '1숟가락'),
       (1861, '국간장', '1숟가락'),
       (1861, '다진 마늘', '1/2숟가락'),
       (1861, '고춧가루', '1/2숟가락'),
       (1861, '소금', '약간'),
       (1861, '후추', '약간');

-- 1862
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1862, '소고기', '100g'),
       (1862, '콩나물', '100g'),
       (1862, '대파', '1/4대'),
       (1862, '무', '100g'),
       (1862, '홍고추', '1/2개'),
       (1862, '청고추', '1/2개'),
       (1862, '물', '4종이컵'),
       (1862, '참기름', '1/2숟가락'),
       (1862, '국간장', '1+1/2숟가락'),
       (1862, '다진 마늘', '1/2숟가락'),
       (1862, '소금', '약간'),
       (1862, '후추', '약간'),
       (1862, '국간장', '1/2숟가락'),
       (1862, '다진 마늘', '1/2숟가락'),
       (1862, '맛술', '1/2숟가락'),
       (1862, '참기름', '1/2숟가락'),
       (1862, '후추', '약간');

-- 1863
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name)
VALUES (1863, '반반한 라면 1봉'),
       (1863, '햄'),
       (1863, '대파');

-- 1864
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1864, '소고기', '400g'),
       (1864, '청주', '1/2종이컵'),
       (1864, '설탕', '1숟가락'),
       (1864, '후추', '약간'),
       (1864, '간장', '1/3종이컵'),
       (1864, '액젓', '1/2숟가락'),
       (1864, '설탕', '2숟가락'),
       (1864, '매실청', '2숟가락'),
       (1864, '맛술', '1숟가락'),
       (1864, '마늘', '3개'),
       (1864, '생강', '1개'),
       (1864, '건고추', '2개'),
       (1864, '후추', '약간'),
       (1864, '참기름', '2숟가락'),
       (1864, '청양고추', '4개');

-- 1865
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1865, '대패삼겹살', '200g'),
       (1865, '콩나물', '1줌'),
       (1865, '양파', '1/2개'),
       (1865, '청양고추', '1개'),
       (1865, '대파', '1대'),
       (1865, '참기름', '1숟가락'),
       (1865, '통깨', '약간'),
       (1865, '고추장', '2숟가락'),
       (1865, '맛술', '1+1/2숟가락'),
       (1865, '간장', '1+1/2숟가락'),
       (1865, '고춧가루', '1숟가락'),
       (1865, '설탕', '1/2숟가락'),
       (1865, '다진 마늘', '1/2숟가락'),
       (1865, '후추', '약간');

-- 1866
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1866, '무염버터', '86g'),
       (1866, '슈가파우더', '60g'),
       (1866, '달걀', '91g'),
       (1866, '호박 페이스트', '57g'),
       (1866, '꿀', '14g'),
       (1866, '박력분', '89g'),
       (1866, '아몬드파우더', '17g'),
       (1866, '베이킹파우더', '3g'),
       (1866, '단호박가루', '6g'),
       (1866, '시나몬파우더', '약간'),
       (1866, '넛맥', '약간'),
       (1866, '코팅용 화이트초콜릿', '적당량'),
       (1866, '단호박가루', '약간'),
       (1866, '호박씨', '약간'),
       (1866, '초코펜', null);

-- 1867
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name)
VALUES (1867, '불닭볶음밥 1개'),
       (1867, '달걀 1개'),
       (1867, '콘샐러드 1개'),
       (1867, '소시지바 1개');

-- 1868
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1868, '고구마', '3개'),
       (1868, '쌀조청', '1종이컵'),
       (1868, '검은깨', '약간');

-- 1869
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1869, '뽕 칼국수', '2인분'),
       (1869, '바지락', '2줌'),
       (1869, '물', '800ml'),
       (1869, '멸치다시마 육수', '1L'),
       (1869, '애호박', '1/4개'),
       (1869, '당근', '1/4개'),
       (1869, '감자', '1/2개'),
       (1869, '양파', '1/4개'),
       (1869, '대파', '1/2대'),
       (1869, '다진 마늘', '1숟가락'),
       (1869, '국간장', '1/2숟가락'),
       (1869, '소금', '약간'),
       (1869, '후추', '약간');

-- 1870
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1870, '새송이버섯', '4개'),
       (1870, '소금', '적당량'),
       (1870, '양조간장', '1숟가락'),
       (1870, '다진마늘', '1/2숟가락'),
       (1870, '들깨가루', '1숟가락'),
       (1870, '송송 썬 쪽파', '2숟가락'),
       (1870, '참기름', '1/2숟가락'),
       (1870, '소금', '약간');

-- 1871번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1871, '달걀', '70g'),
       (1871, '설탕', '70g'),
       (1871, '물엿', '25g'),
       (1871, '꿀', '25g'),
       (1871, '박력분', '70g'),
       (1871, '코코아파우더', '14g'),
       (1871, '베이킹파우더', '2g'),
       (1871, '소금', '약간'),
       (1871, '초코칩', '35g'),
       (1871, '무염버터', '81g'),
       (1871, '다크초콜릿커버춰', '91g'),
       (1871, '코팅용 화이트초콜릿', '적당량'),
       (1871, '마시멜로우', '적당량'),
       (1871, '초코펜', NULL);

-- 1872번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1872, '물', '900ml'),
       (1872, '쌀조청', '1.5kg'),
       (1872, '메주가루', '70g'),
       (1872, '고운고춧가루', '600g'),
       (1872, '소금', '130g');

-- 1873번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1873, '롤케이크', '1개'),
       (1873, '각종 과일', '적당량'),
       (1873, '얼음컵', '1개'),
       (1873, '크랜베리주스', '3/4종이컵'),
       (1873, '복숭아스파클링음료', '1/2종이컵'),
       (1873, '레몬나', '1포');

-- 1874번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1874, '낙지', '250g'),
       (1874, '양파', '1/4개'),
       (1874, '미나리', '8줄기'),
       (1874, '청양고추', '1개'),
       (1874, '고추장', '2숟가락'),
       (1874, '매실액', '1숟가락'),
       (1874, '설탕', '1숟가락'),
       (1874, '고춧가루', '1숟가락'),
       (1874, '식초', '3숟가락'),
       (1874, '다진 마늘', '1/2숟가락'),
       (1874, '참기름', '1/2숟가락'),
       (1874, '통깨', '약간');

-- 1875번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1875, '부침용 두부', '1모'),
       (1875, '삶은 단호박', '100g'),
       (1875, '새싹채소', '100g'),
       (1875, '포도씨유', '2숟가락'),
       (1875, '들기름', '1숟가락'),
       (1875, '데리야끼 소스', '2숟가락'),
       (1875, '굴소스', '1/2숟가락'),
       (1875, '발사믹글레이스', '1티스푼');

-- 1876번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1876, '바나나', '2개'),
       (1876, '견과류', '적당량'),
       (1876, '버터', '1숟가락'),
       (1876, '꿀', '2숟가락'),
       (1876, '계피가루', '1/2숟가락'),
       (1876, '아이스크림', '2스쿱'),
       (1876, '초코시럽', '적당량');

-- 1877번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1877, '불린 쌀', '100g'),
       (1877, '소고기', '20g'),
       (1877, '불린표고버섯', '1개'),
       (1877, '대파', '1조각'),
       (1877, '마늘', '1개'),
       (1877, '진간장', '10ml'),
       (1877, '깨소금', '5g'),
       (1877, '검은 후춧가루', '1g'),
       (1877, '참기름', '10ml'),
       (1877, '국간장', '10ml');

-- 1878번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1878, '묵은지', '1/2포기'),
       (1878, '두부', '1/2모'),
       (1878, '삼겹살', '200g'),
       (1878, '양파', '1/4개'),
       (1878, '대파', '1/3대'),
       (1878, '청양고추', '1개'),
       (1878, '멸치다시마육수', '1+1/2종이컵'),
       (1878, '고추장', '1숟가락'),
       (1878, '고춧가루', '1+1/2숟가락'),
       (1878, '다진 마늘', '1/2숟가락'),
       (1878, '간장', '1숟가락'),
       (1878, '설탕', '1/2숟가락'),
       (1878, '소금', '약간'),
       (1878, '후추', '약간');

-- 1879번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1879, '김치', '150g'),
       (1879, '양파', '1/4개'),
       (1879, '당근', '1/4개'),
       (1879, '대파', '1대'),
       (1879, '날치알', '4숟가락'),
       (1879, '밥', '2공기'),
       (1879, '간장', '1숟가락'),
       (1879, '소금', '약간'),
       (1879, '후추', '약간'),
       (1879, '맛술', '1숟가락');

-- 1880번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1880, '시판 카스텔라', '2개'),
       (1880, '생크림', '2T'),
       (1880, '코팅용 화이트초콜릿', '적당량'),
       (1880, '장식용 초콜릿', '약간'),
       (1880, '초코펜', NULL);

-- 1881
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1881, '까르보 불닭 라면', '1개'),
       (1881, '소시지 바', '1개'),
       (1881, '쌈무', '적당량'),
       (1881, '식빵', '1장'),
       (1881, '체다치즈', '1장'),
       (1881, '모짜렐라치즈', '1봉'),
       (1881, '케찹', '적당량');

-- 1882
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1882, '쌀밥', '1공기'),
       (1882, '시금치', '2줌'),
       (1882, '오징어', '1마리'),
       (1882, '새송이버섯', '2개'),
       (1882, '표고버섯', '3개'),
       (1882, '양파', '1/2개'),
       (1882, '당근', '1/2개'),
       (1882, '우유', '150ml'),
       (1882, '무염버터', '1숟가락'),
       (1882, '아기 슬라이스치즈', '1장'),
       (1882, '후추', '약간');

-- 1883
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1883, '바지락', '1종이컵'),
       (1883, '홍합', '2종이컵'),
       (1883, '새우', '4마리'),
       (1883, '칼국수면', '2인분'),
       (1883, '양파', '1/4개'),
       (1883, '청양고추', '1개'),
       (1883, '홍고추', '1개'),
       (1883, '멸치다시마육수', '5종이컵'),
       (1883, '소금', '약간'),
       (1883, '후추', '약간'),
       (1883, '다진 마늘', '1숟가락');

-- 1884
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1884, '박력분', '170g'),
       (1884, '버터', '40g'),
       (1884, '슈가파우더', '70g'),
       (1884, '달걀', '1개'),
       (1884, '바닐라에센스', '1/2숟가락'),
       (1884, '누텔라', '1종이컵'),
       (1884, '빨간색소', '약간'),
       (1884, '설탕', '적당량'),
       (1884, '소금', '약간');

INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1885, '두부', '1/2모'),
       (1885, '소불고기', '50g'),
       (1885, '양파', '1/8개'),
       (1885, '당근', '1/8개'),
       (1885, '표고버섯', '2개'),
       (1885, '새송이버섯', '1/2개'),
       (1885, '느타리버섯', '1줌'),
       (1885, '쪽파', '5줄기'),
       (1885, '포도씨유', '1숟가락'),
       (1885, '물', '500ml'),
       (1885, '연두', '2숟가락'),
       (1885, '물', '4숟가락'),
       (1885, '연두', '1+1/2숟가락'),
       (1885, '연두청양초', '1/2숟가락'),
       (1885, '식초', '1숟가락'),
       (1885, '깨', '약간'),
       (1885, '쪽파', '약간'),
       (1885, '물', '4숟가락'),
       (1885, '간장', '2숟가락'),
       (1885, '유자청', '1/2숟가락'),
       (1885, '식초', '1숟가락'),
       (1885, '쪽파', '약간');

INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1886, '홍합', '500g'),
       (1886, '양파', '1/4개'),
       (1886, '청양고추', '2개'),
       (1886, '대파', '1대'),
       (1886, '물', '2종이컵'),
       (1886, '고추기름', '1숟가락'),
       (1886, '국간장', '1숟가락'),
       (1886, '고춧가루', '1숟가락'),
       (1886, '다진 마늘', '1/2숟가락'),
       (1886, '소금', '약간'),
       (1886, '후추', '약간');

INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1887, '치즈떡', '150g'),
       (1887, '김말이튀김', '300g'),
       (1887, '피자치즈', '3줌'),
       (1887, '통깨', '약간'),
       (1887, '깻잎', '4장'),
       (1887, '고추장', '3숟가락'),
       (1887, '식용유', '1숟가락'),
       (1887, '고춧가루', '1숟가락'),
       (1887, '간장', '1숟가락'),
       (1887, '설탕', '2숟가락'),
       (1887, '물엿', '1숟가락'),
       (1887, '물', '3숟가락'),
       (1887, '케찹', '1숟가락');

INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1888, '달걀', '2개'),
       (1888, '대파', '1/4대'),
       (1888, '게살', '3개'),
       (1888, '밥', '1공기'),
       (1888, '포도씨유', '2숟가락'),
       (1888, '소금', '약간'),
       (1888, '계란 간장', '2숟가락'),
       (1888, '식초', '1숟가락'),
       (1888, '설탕', '1/2숟가락'),
       (1888, '전분', '1/2숟가락'),
       (1888, '물', '1/2종이컵');

INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1889, '무염버터', '114g'),
       (1889, '슈가파우더', '88g'),
       (1889, '달걀', '30g'),
       (1889, '바닐라익스트랙', '약간'),
       (1889, '중력분', '200g'),
       (1889, '베이킹파우더', '4g'),
       (1889, '소금', '1꼬집'),
       (1889, '슈가파우더', '150g'),
       (1889, '달걀흰자', '15g'),
       (1889, '레몬즙', '7g'),
       (1889, '따뜻한 물', '약간'),
       (1889, '식용 색소', '약간');

INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1890, '닭가슴살', '110g'),
       (1890, '숙주', '1줌'),
       (1890, '파프리카', '90g'),
       (1890, '당근', '20g'),
       (1890, '부추', '10g'),
       (1890, '깨소금', '약간'),
       (1890, '된장', '10g'),
       (1890, '연겨자', '10g'),
       (1890, '사과식초', '1+1/2숟가락'),
       (1890, '설탕', '8g'),
       (1890, '다진 마늘', '4g');

-- 1891번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1891, '낙지', '180g'),
       (1891, '양파', '1/2개'),
       (1891, '청양고추', '1개'),
       (1891, '대파', '1/2대'),
       (1891, '참기름', '1/4숟가락'),
       (1891, '통깨', '약간'),
       (1891, '밥', '2공기'),
       (1891, '고추장', '1숟가락'),
       (1891, '고춧가루', '2숟가락'),
       (1891, '간장', '1숟가락'),
       (1891, '설탕', '1/2숟가락'),
       (1891, '올리고당', '1숟가락'),
       (1891, '다진 마늘', '1숟가락'),
       (1891, '맛술', '1숟가락'),
       (1891, '후추', '약간');

-- 1892번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1892, '굴', '1종이컵'),
       (1892, '튀김가루', '1/2종이컵'),
       (1892, '카레가루', '1/2숟가락'),
       (1892, '달걀', '2개'),
       (1892, '빵가루', '적당량'),
       (1892, '소금', '1숟가락'),
       (1892, '식용유', '약간');

-- 1893번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1893, '단호박', '1통'),
       (1893, '돼지등갈비', '500g'),
       (1893, '소금', '약간'),
       (1893, '후추', '약간'),
       (1893, '전분가루', '5숟가락'),
       (1893, '식용유', '1숟가락'),
       (1893, '간장', '2숟가락'),
       (1893, '올리고당', '2숟가락'),
       (1893, '맛술', '1숟가락'),
       (1893, '굴소스', '1숟가락'),
       (1893, '후추', '약간');

-- 1894번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1894, '청양고추', '1개'),
       (1894, '청고추', '3개'),
       (1894, '송이 버섯', '100g'),
       (1894, '달걀', '2개'),
       (1894, '부침가루', '1/2종이컵'),
       (1894, '소금', '약간'),
       (1894, '후추', '약간'),
       (1894, '식용유', '약간');

-- 1895번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1895, '골뱅이', '230g'),
       (1895, '오이', '1/4개'),
       (1895, '양파', '1/4개'),
       (1895, '소면', '50g'),
       (1895, '파채', '1줌'),
       (1895, '통깨', '약간'),
       (1895, '참기름', '약간'),
       (1895, '고추장', '3숟가락'),
       (1895, '식초', '1+1/2숟가락'),
       (1895, '설탕', '1숟가락'),
       (1895, '고춧가루', '2숟가락'),
       (1895, '다진 마늘', '1/2숟가락'),
       (1895, '참기름', '1/2숟가락');

-- 1896번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1896, '닭가슴살', '350g'),
       (1896, '애호박', '50g'),
       (1896, '당근', '50g'),
       (1896, '양파', '1/2개'),
       (1896, '청양고추', '1개'),
       (1896, '맛술', '2숟가락'),
       (1896, '소금', '약간'),
       (1896, '후추', '약간'),
       (1896, '고춧가루', '2숟가락'),
       (1896, '간장', '2+1/2숟가락'),
       (1896, '설탕', '2/3숟가락'),
       (1896, '다진 마늘', '1숟가락');

-- 1897번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1897, '굴', '1/2종이컵'),
       (1897, '모양 어묵', '2종이컵'),
       (1897, '사각어묵', '6장'),
       (1897, '무', '250g'),
       (1897, '양파', '1/4개'),
       (1897, '대파', '1/2대'),
       (1897, '청양고추', '2개'),
       (1897, '물', '1L'),
       (1897, '국간장', '2숟가락'),
       (1897, '다진마늘', '1숟가락'),
       (1897, '후추', '약간'),
       (1897, '만개한알', '1알');

-- 1898번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1898, '참치', '2캔'),
       (1898, '감자', '50g'),
       (1898, '양파', '50g'),
       (1898, '완두콩', '4숟가락'),
       (1898, '홍고추', '50g'),
       (1898, '청고추', '50g'),
       (1898, '간장', '1/2숟가락'),
       (1898, '후추', '약간'),
       (1898, '물', '1종이컵'),
       (1898, '고추장', '3숟가락'),
       (1898, '케첩', '5숟가락'),
       (1898, '굴소스', '2숟가락');

-- 1899번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1899, '소고기', '300g'),
       (1899, '청경채', '2개'),
       (1899, '당근', '1/3개'),
       (1899, '양파', '1/2개'),
       (1899, '홍피망', '1개'),
       (1899, '소금', '약간'),
       (1899, '후추', '약간'),
       (1899, '전분물', '1숟가락'),
       (1899, '간장', '2숟가락'),
       (1899, '다진 마늘', '1/2숟가락'),
       (1899, '청주', '2숟가락'),
       (1899, '굴소스', '1숟가락'),
       (1899, '설탕', '1숟가락'),
       (1899, '참기름', '1/3숟가락'),
       (1899, '후추', '약간');

-- 1900번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1900, '흑미밥', '1공기 반'),
       (1900, '생 다시마', '2줌'),
       (1900, '김밥용김', '2장'),
       (1900, '오이', '1/2개'),
       (1900, '당근', '1/2개'),
       (1900, '달걀', '2개'),
       (1900, '물', '2종이컵'),
       (1900, '저염 간장', '1숟가락'),
       (1900, '설탕', '1/4숟가락'),
       (1900, '참기름', '1/2숟가락'),
       (1900, '통깨', '약간');


-- 1901번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1901, '감자과자', '1봉'),
       (1901, '모짜렐라치즈', '1봉'),
       (1901, '스트링치즈', '2개'),
       (1901, '체다치즈', '1장');

-- 1902번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1902, '두부', '1/2모'),
       (1902, '당근', '1/8개'),
       (1902, '양파', '1/4개'),
       (1902, '홍피망', '1/3개'),
       (1902, '청피망', '1/3개'),
       (1902, '노랑 파프리카', '1/2개'),
       (1902, '굵은 소금', '약간'),
       (1902, '식용유', '약간'),
       (1902, '간장', '2숟가락'),
       (1902, '설탕', '1숟가락'),
       (1902, '다진마늘', '1/2숟가락'),
       (1902, '깨소금', '1/2숟가락'),
       (1902, '참기름', '1/2숟가락'),
       (1902, '후추', '약간');

-- 1903번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1903, '박력분', '100g'),
       (1903, '코코넛가루', '20g'),
       (1903, '슈가파우더', '60g'),
       (1903, '달걀흰자', '1개'),
       (1903, '버터', '100g'),
       (1903, '다크초콜릿', '50g');

-- 1904번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1904, '두부', '1모'),
       (1904, '표고버섯', '1개'),
       (1904, '양파', '1/4개'),
       (1904, '당근', '1/4개'),
       (1904, '대파', '1/2대'),
       (1904, '달걀', '1개'),
       (1904, '빵가루', '6숟가락'),
       (1904, '전분', '3+1/2숟가락'),
       (1904, '소금', '약간'),
       (1904, '후추', '약간'),
       (1904, '양파', '1/4개'),
       (1904, '편마늘', '1숟가락'),
       (1904, '스테이크소스', '4숟가락'),
       (1904, '케첩', '2숟가락'),
       (1904, '굴소스', '2숟가락'),
       (1904, '물', '1/2종이컵'),
       (1904, '후추', '약간');

-- 1905번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1905, '모닝빵', '6개'),
       (1905, '양파', '1/2개'),
       (1905, '토마토', '1개'),
       (1905, '양상추', '1/6개'),
       (1905, '슬라이스치즈', '4장'),
       (1905, '피자치즈', '1줌'),
       (1905, '식용유', '적당량'),
       (1905, '토마토소스', '1/2종이컵'),
       (1905, '소고기다짐육', '3종이컵'),
       (1905, '달걀', '1/2개'),
       (1905, '소금', '1/3숟가락'),
       (1905, '후추', '약간'),
       (1905, '빵가루', '2숟가락'),
       (1905, '파마산치즈가루', '1숟가락');

-- 1906번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1906, '삼치', '1마리'),
       (1906, '소금', '약간'),
       (1906, '후추', '약간'),
       (1906, '맛술', '1숟가락'),
       (1906, '파슬리가루', '약간'),
       (1906, '마요네즈', '3숟가락'),
       (1906, '설탕', '1숟가락'),
       (1906, '홀그레인머스터드', '1숟가락'),
       (1906, '후추', '약간');

-- 1907번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1907, '소시지', '7개'),
       (1907, '피망', '1/2개'),
       (1907, '주황파프리카', '1/2개'),
       (1907, '빨간파프리카', '1/2개'),
       (1907, '양송이버섯', '2개'),
       (1907, '케찹', '4숟가락'),
       (1907, '고춧가루', '1숟가락'),
       (1907, '설탕', '2숟가락'),
       (1907, '소금', '약간'),
       (1907, '후추', '약간'),
       (1907, '식용유', '1숟가락');

-- 1908번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1908, '바게트', '1개'),
       (1908, '달걀', '4개'),
       (1908, '마요네즈', '4숟가락'),
       (1908, '설탕', '2숟가락'),
       (1908, '다진마늘', '1/2숟가락'),
       (1908, '소금', '약간'),
       (1908, '후추', '약간');

-- 1909번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1909, '치즈빵', '1봉지'),
       (1909, '소시지바', '4개'),
       (1909, '샐러드', '1팩'),
       (1909, '머스터드소스', '약간');

-- 1910번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1910, '간장 게장', '3개'),
       (1910, '당근', '1/4개'),
       (1910, '양파', '1/4개'),
       (1910, '대파', '1대'),
       (1910, '라면사리', '1개');

-- 1911번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1911, '샐러드', '1팩'),
       (1911, '포도', '적당량'),
       (1911, '방울토마토', '적당량'),
       (1911, '귤', '1개'),
       (1911, '요거트', '2개');

-- 1912번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1912, '양배추', '200g'),
       (1912, '돼지고기', '150g'),
       (1912, '양파', '1/3개'),
       (1912, '청양고추', '1개'),
       (1912, '홍고추', '1개'),
       (1912, '통깨', '약간'),
       (1912, '간장', '2숟가락'),
       (1912, '올리고당', '1+1/2숟가락'),
       (1912, '다진 마늘', '1/2숟가락'),
       (1912, '맛술', '1숟가락'),
       (1912, '참기름', '1숟가락'),
       (1912, '소금', '약간'),
       (1912, '후추', '약간');

-- 1913번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1913, '제육볶음', '1캔'),
       (1913, '밥', '1공기'),
       (1913, '조미김', '1개'),
       (1913, '슬라이스치즈', '1장');

-- 1914번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1914, '베이컨', '4줄'),
       (1914, '밥', '1공기'),
       (1914, '당근', '1/4개'),
       (1914, '양파', '1/4개'),
       (1914, '쪽파', '2줄'),
       (1914, '모짜렐라치즈', '70g'),
       (1914, '간장', '1숟가락'),
       (1914, '소금', '약간'),
       (1914, '후추', '약간'),
       (1914, '식용유', '약간');

-- 1915번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1915, '치아바타', '2개'),
       (1915, '양상추', '4장'),
       (1915, '양배추', '2장'),
       (1915, '닭다리살', '2개'),
       (1915, '간장', '1숟가락'),
       (1915, '청주', '1숟가락'),
       (1915, '다진 마늘', '1/2숟가락'),
       (1915, '후추', '약간'),
       (1915, '참기름', '1숟가락'),
       (1915, '전분가루', '2숟가락'),
       (1915, '삶은달걀', '2개'),
       (1915, '마요네즈', '3숟가락'),
       (1915, '레몬즙', '1숟가락'),
       (1915, '피클', '5개'),
       (1915, '후추', '약간'),
       (1915, '올리고당', '1숟가락');

-- 1916번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1916, '소고기', '600g'),
       (1916, '양파', '1/2개'),
       (1916, '식용유', '약간'),
       (1916, '송송 썬 쪽파', '약간'),
       (1916, '진간장', '4숟가락'),
       (1916, '설탕', '2숟가락'),
       (1916, '다진대파', '2숟가락'),
       (1916, '다진마늘', '2숟가락'),
       (1916, '참기름', '1숟가락'),
       (1916, '후추', '약간');

-- 1917번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1917, '식빵', '4장'),
       (1917, '바나나', '2개'),
       (1917, '초코잼', '2숟가락'),
       (1917, '땅콩버터', '2숟가락');

-- 1918번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1918, '무뼈닭발', '300g'),
       (1918, '소주', '3숟가락'),
       (1918, '통후추', '약간'),
       (1918, '대파', '1대'),
       (1918, '청양고추', '1개'),
       (1918, '식용유', '약간'),
       (1918, '간장', '3숟가락'),
       (1918, '고춧가루', '3숟가락'),
       (1918, '고추장', '2숟가락'),
       (1918, '설탕', '1숟가락'),
       (1918, '다진마늘', '1+1/2숟가락'),
       (1918, '다진생강', '1/2숟가락'),
       (1918, '소금', '1숟가락'),
       (1918, '청주', '1숟가락'),
       (1918, '물엿', '2숟가락'),
       (1918, '통깨', '약간');

-- 1919번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1919, '빨강 파프리카', '30g'),
       (1919, '주황 파프리카', '30g'),
       (1919, '돼지고기', '80g'),
       (1919, '소금', '1g'),
       (1919, '후추', '1g'),
       (1919, '밀가루', '5g'),
       (1919, '달걀', '10g'),
       (1919, '빵가루', '13g'),
       (1919, '노란 파프리카', '5g'),
       (1919, '마요네즈', '10g'),
       (1919, '꿀', '2g'),
       (1919, '파프리카', '1~2개'),
       (1919, '물', '1/2종이컵'),
       (1919, '설탕', '50g'),
       (1919, '소금', '20g'),
       (1919, '식초', '200ml'),
       (1919, '삼색 파프리카', '20g'),
       (1919, '마요네즈', '5g'),
       (1919, '식초', '2g'),
       (1919, '케찹', '2g'),
       (1919, '설탕', '2g'),
       (1919, '노란 파프리카', '1/2개'),
       (1919, '버거 번', '80g'),
       (1919, '토마토', '50g'),
       (1919, '적양파', '30g'),
       (1919, '청상추', '30g'),
       (1919, '치즈', '1장');

-- 1920번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1920, '나초 과자', '1봉'),
       (1920, '옥수수콘', '1종이컵'),
       (1920, '모짜렐라치즈', '1종이컵'),
       (1920, '스트링치즈', '3개'),
       (1920, '마요네즈', '5숟가락');

-- 1921
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1921, '밥', '1공기'),
       (1921, '토마토소스', '1+1/2종이컵'),
       (1921, '편마늘', '2숟가락'),
       (1921, '냉동해산물믹스', '1종이컵'),
       (1921, '물', '1종이컵'),
       (1921, '양파', '1/4개'),
       (1921, '소금', '약간'),
       (1921, '후추', '약간'),
       (1921, '올리브유', '1숟가락'),
       (1921, '맛술', '1숟가락'),
       (1921, '파마산치즈', '약간'),
       (1921, '파슬리가루', '약간');

-- 1922
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1922, '식빵', '2장'),
       (1922, '달걀', '1개'),
       (1922, '다진 호두', '3숟가락'),
       (1922, '크랜베리', '3숟가락'),
       (1922, '연유', '1숟가락'),
       (1922, '소금', '약간');

-- 1923
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1923, '순대', '200g'),
       (1923, '우동면', '1인분'),
       (1923, '양파', '1/4개'),
       (1923, '양배추', '2장'),
       (1923, '대파', '1/2개'),
       (1923, '마늘', '3개'),
       (1923, '깻잎', '3장'),
       (1923, '고추기름', '약간'),
       (1923, '고춧가루', '2숟가락'),
       (1923, '간장', '2숟가락'),
       (1923, '고추장', '1숟가락'),
       (1923, '굴소스', '2숟가락'),
       (1923, '올리고당', '2숟가락'),
       (1923, '설탕', '1숟가락'),
       (1923, '소금', '약간'),
       (1923, '후추', '약간');

-- 1924
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1924, '전어', '2마리'),
       (1924, '소금', '약간'),
       (1924, '케이퍼', '1숟가락'),
       (1924, '올리브유', '8숟가락'),
       (1924, '다진 양파', '1/4개'),
       (1924, '방울토마토', '5개'),
       (1924, '그린올리브', '6개');

-- 1925
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1925, '낙지', '300g'),
       (1925, '미나리', '4줄기'),
       (1925, '부추', '8줄기'),
       (1925, '생강', '1/2톨'),
       (1925, '육수', '5숟가락'),
       (1925, '참기름', '2숟가락'),
       (1925, '굴소스', '1숟가락'),
       (1925, '물녹말', '1숟가락');

-- 1926
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1926, '무', '100g'),
       (1926, '소금', '5g'),
       (1926, '고춧가루', '10g'),
       (1926, '설탕', '10g'),
       (1926, '식초', '5g'),
       (1926, '대파', '1조각'),
       (1926, '마늘', '1쪽'),
       (1926, '깨소금', '5g'),
       (1926, '생강', '5g');

-- 1927
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1927, '브로콜리', '1/3개'),
       (1927, '돼지고기', '200g'),
       (1927, '파프리카', '1/2개'),
       (1927, '편마늘', '3숟가락'),
       (1927, '간장', '1숟가락'),
       (1927, '굴소스', '2숟가락'),
       (1927, '다진 마늘', '1/2숟가락'),
       (1927, '맛술', '1숟가락'),
       (1927, '설탕', '1숟가락'),
       (1927, '후추', '약간'),
       (1927, '맛술', '1숟가락'),
       (1927, '소금', '약간'),
       (1927, '후추', '약간');

-- 1928
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1928, '슈가파우더', '1/2종이컵'),
       (1928, '파랑색소', '약간'),
       (1928, '레몬즙', '1숟가락'),
       (1928, '딸기아이스크림', '2종이컵'),
       (1928, '우유', '1/2종이컵'),
       (1928, '얼음', '1종이컵'),
       (1928, '냉동 블루베리', '1/2종이컵'),
       (1928, '휘핑크림', '적당량'),
       (1928, '스프링클', '약간');

-- 1929
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1929, '쌀', '1종이컵'),
       (1929, '다진 양파', '3숟가락'),
       (1929, '양송이버섯', '3개'),
       (1929, '표고버섯', '2개'),
       (1929, '다진마늘', '1숟가락'),
       (1929, '버터', '1숟가락'),
       (1929, '생크림', '2/3종이컵'),
       (1929, '뜨거운 물', '3종이컵'),
       (1929, '치킨파우더', '1숟가락'),
       (1929, '올리브유', '약간'),
       (1929, '후추', '약간'),
       (1929, '소금', '약간'),
       (1929, '그라노파다노치즈', '1숟가락');

-- 1930
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1930, '토마토', '2개'),
       (1930, '호두', '20g'),
       (1930, '삶은달걀', '1개'),
       (1930, '바질', '3장'),
       (1930, '발사믹크림', '약간'),
       (1930, '바질페스토', '2숟가락'),
       (1930, '올리브오일', '2숟가락'),
       (1930, '발사믹식초', '1숟가락'),
       (1930, '설탕', '1숟가락'),
       (1930, '소금', '약간'),
       (1930, '후추', '약간');

-- 1931번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1931, '바지락', '300g'),
       (1931, '사천 고추', '5개'),
       (1931, '마늘', '2알'),
       (1931, '생강', '1쪽'),
       (1931, '국간장', '1숟가락'),
       (1931, '설탕', '1숟가락'),
       (1931, '청주', '2숟가락'),
       (1931, '간장', '1숟가락'),
       (1931, '식용유', '약간'),
       (1931, '쪽파', '3줄');

-- 1932번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1932, '새우', '15마리'),
       (1932, '굵은소금', '2종이컵'),
       (1932, '레몬', '1/2개'),
       (1932, '초고추장', NULL);
-- 초고추장의 용량 정보가 주어지지 않았습니다.

-- 1933번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1933, '알감자', '400g'),
       (1933, '물', '1+1/2종이컵'),
       (1933, '물엿', '1+1/2숟가락'),
       (1933, '참기름', '1숟가락'),
       (1933, '통깨', '약간'),
       (1933, '간장', '4숟가락'),
       (1933, '설탕', '1숟가락'),
       (1933, '맛술', '2숟가락'),
       (1933, '고춧가루', '1/2숟가락'),
       (1933, '후추', '약간');

-- 1934번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1934, '콩가루', '1+1/2종이컵'),
       (1934, '핫케이크가루', '2숟가락'),
       (1934, '설탕', '1종이컵'),
       (1934, '우유', '2+1/2종이컵'),
       (1934, '소금', '약간'),
       (1934, '크래커', NULL);
-- 크래커의 용량 정보가 주어지지 않았습니다.

-- 1935번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1935, '차돌박이', '1줌'),
       (1935, '양배추', '1/6개'),
       (1935, '부침가루', '2종이컵'),
       (1935, '물', '1종이컵'),
       (1935, '마요네즈', '적당량'),
       (1935, '돈가스소스', '적당량'),
       (1935, '달걀', '1개'),
       (1935, '소금', '약간'),
       (1935, '식용유', '적당량'),
       (1935, '명란젓', '적당량'),
       (1935, '쪽파', '적당량'),
       (1935, '달걀', '2개');

-- 1936번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1936, '감자', '2개'),
       (1936, '양파', '1/2개'),
       (1936, '청양고추', '1개'),
       (1936, '물', '1종이컵'),
       (1936, '간장', '5숟가락'),
       (1936, '설탕', '2숟가락'),
       (1936, '다진 대파', '1숟가락'),
       (1936, '다진 마늘', '1/2숟가락'),
       (1936, '참기름', '1숟가락'),
       (1936, '통깨', '1/2숟가락');

-- 1937번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1937, '만두', '6개'),
       (1937, '팽이버섯', '100g'),
       (1937, '느타리버섯', '100g'),
       (1937, '김치', '100g'),
       (1937, '청경채', '100g'),
       (1937, '당근', '1/4개'),
       (1937, '숙주', '100g'),
       (1937, '멸치다시마육수', '3종이컵'),
       (1937, '두부', '1/2모'),
       (1937, '청양고추', '1개'),
       (1937, '홍고추', '1개'),
       (1937, '다진 마늘', '1숟가락'),
       (1937, '국간장', '2숟가락'),
       (1937, '멸치액젓', '1숟가락');

-- 1938번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1938, '쫄면', '200g'),
       (1938, '다진마늘', '1숟가락'),
       (1938, '간장', '2숟가락'),
       (1938, '설탕', '1숟가락'),
       (1938, '굴소스', '1숟가락'),
       (1938, '대패삼겹살', '100g'),
       (1938, '소금', '1/3숟가락'),
       (1938, '참기름', '1숟가락'),
       (1938, '후추', '약간'),
       (1938, '청주', '1숟가락'),
       (1938, '식초', '1숟가락'),
       (1938, '식용유', '약간'),
       (1938, '부추', '1줌'),
       (1938, '식초', '2숟가락'),
       (1938, '고춧가루', '1숟가락'),
       (1938, '설탕', '1숟가락'),
       (1938, '참기름', '1숟가락');

-- 1939번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1939, '식빵', '2장'),
       (1939, '새우', '10마리'),
       (1939, '토마토소스', '8숟가락'),
       (1939, '피망', '1/2개'),
       (1939, '양파', '1/4개'),
       (1939, '양송이버섯', '2개'),
       (1939, '피자치즈', '1/2종이컵'),
       (1939, '소금', '약간'),
       (1939, '후추', '약간');

-- 1940번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1940, '가지', '2개'),
       (1940, '소고기', '150g'),
       (1940, '송송 썬 쪽파', '2숟가락'),
       (1940, '소금', '약간'),
       (1940, '후추', '약간'),
       (1940, '식용유', '적당량'),
       (1940, '진간장', '2숟가락'),
       (1940, '설탕', '1숟가락'),
       (1940, '올리고당', '1숟가락'),
       (1940, '다진대파', '1숟가락'),
       (1940, '다진마늘', '1숟가락'),
       (1940, '참기름', '약간'),
       (1940, '후추', '약간');

-- 1941
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1941, '돼지고기앞다리살', '300g'),
       (1941, '인삼주', '1숟가락'),
       (1941, '후추', '약간'),
       (1941, '양파', '1/2개'),
       (1941, '빨강 파프리카', '1/3개'),
       (1941, '쪽파', '2대'),
       (1941, '통깨', '약간'),
       (1941, '고추장', '2숟가락'),
       (1941, '다진 마늘', '1숟가락'),
       (1941, '설탕', '1숟가락'),
       (1941, '고춧가루', '2숟가락'),
       (1941, '간장', '1숟가락'),
       (1941, '매실액', '1숟가락'),
       (1941, '참기름', '약간'),
       (1941, '후추', '약간');

-- 1942
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1942, '감자', '350g'),
       (1942, '찹쌀가루', '1/2종이컵'),
       (1942, '소금', '1/4숟가락'),
       (1942, '설탕', '2숟가락'),
       (1942, '꿀', '5숟가락'),
       (1942, '다진 견과류', '1/3종이컵');

-- 1943
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1943, '두부', '1모'),
       (1943, '통깨', '약간'),
       (1943, '소금', '약간'),
       (1943, '후추', '약간'),
       (1943, '간장', '2+1/2숟가락'),
       (1943, '고춧가루', '1/2숟가락'),
       (1943, '다진 마늘', '1/2숟가락'),
       (1943, '다진 대파', '1숟가락'),
       (1943, '참기름', '1숟가락'),
       (1943, '통깨', '약간');

-- 1944
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1944, '콩나물', '200g'),
       (1944, '소금', '1/3숟가락'),
       (1944, '쪽파', '2대'),
       (1944, '다진 마늘', '1/3숟가락'),
       (1944, '고춧가루', '1숟가락'),
       (1944, '간장', '1/3숟가락'),
       (1944, '참기름', '1/2숟가락'),
       (1944, '통깨', '약간');

-- 1945
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1945, '베이컨', '4장'),
       (1945, '표고버섯', '2개'),
       (1945, '고구마', '1개'),
       (1945, '아스파라거스', '2개'),
       (1945, '불린 쌀', '2컵'),
       (1945, '물', '2컵'),
       (1945, '식용유', '약간'),
       (1945, '버터', '1숟가락'),
       (1945, '간장', '2숟가락');

-- 1946
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1946, '통밀쿠키', '90g'),
       (1946, '녹인버터', '50g'),
       (1946, '설탕', '45g'),
       (1946, '크림치즈', '180g'),
       (1946, '생크림', '145g'),
       (1946, '플레인요거트', '40g'),
       (1946, '젤라틴', '6g'),
       (1946, '레몬즙', '10g'),
       (1946, '냉동 블루베리', '200g'),
       (1946, '설탕', '65g'),
       (1946, '레몬즙', '10g');

-- 1947
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1947, '밥', '1공기'),
       (1947, '양파', '30g'),
       (1947, '애호박', '30g'),
       (1947, '당근', '30g'),
       (1947, '달걀', '1개'),
       (1947, '멸치다시마육수', '2+1/2종이컵'),
       (1947, '소금', '약간'),
       (1947, '참기름', '약간'),
       (1947, '통깨', '약간');

-- 1948
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1948, '새송이버섯', '3개'),
       (1948, '꽈리고추', '4개'),
       (1948, '버터', '2숟가락'),
       (1948, '통깨', '약간'),
       (1948, '간장', '2숟가락'),
       (1948, '맛술', '1숟가락'),
       (1948, '올리고당', '1+1/2숟가락'),
       (1948, '후추', '약간');

-- 1949
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1949, '쌈채소', '1줌'),
       (1949, '오이', '1/3개'),
       (1949, '파인애플', '2조각'),
       (1949, '방울토마토', '1/2종이컵'),
       (1949, '올리브유', '3숟가락'),
       (1949, '설탕', '1/2숟가락'),
       (1949, '소금', '약간'),
       (1949, '식초', '1숟가락'),
       (1949, '후추', '약간'),
       (1949, '간 파인애플', '4숟가락'),
       (1949, '물', '2숟가락'),
       (1949, '피쉬소스', '1숟가락');

-- 1950
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1950, '아욱', '100g'),
       (1950, '멸치육수', '4종이컵'),
       (1950, '감자', '1개'),
       (1950, '애호박', '1/4개'),
       (1950, '청양고추', '1개'),
       (1950, '된장', '2+1/2숟가락'),
       (1950, '다진 마늘', '1/2숟가락'),
       (1950, '멸치액젓', '1/2숟가락'),
       (1950, '국간장', '1/2숟가락');

-- 1951번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1951, '스파게티면', '60g'),
       (1951, '삶은 고사리', '100g'),
       (1951, '양파', '1/8개'),
       (1951, '쪽파', '3줄'),
       (1951, '마늘', '6알'),
       (1951, '연두', '2숟가락'),
       (1951, '물', '100ml'),
       (1951, '후추', '1/4숟가락'),
       (1951, '포도씨유', '3숟가락'),
       (1951, '올리브유', '1/2숟가락'),
       (1951, '소금', '1/2숟가락');

-- 1952번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1952, '식빵', '5장'),
       (1952, '달걀', '4개'),
       (1952, '소금', '약간'),
       (1952, '마가린', '약간'),
       (1952, '딸기잼', NULL), -- 딸기잼의 용량 정보가 주어지지 않았습니다.
       (1952, '설탕', NULL);
-- 설탕의 용량 정보가 주어지지 않았습니다.

-- 1953번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1953, '돈까스', '1장'),
       (1953, '밥', '1공기'),
       (1953, '양파', '1/4개'),
       (1953, '달걀', '2개'),
       (1953, '송송 썬 쪽파', '2숟가락'),
       (1953, '식용유', '적당량'),
       (1953, '물', '1/2종이컵'),
       (1953, '진간장', '2숟가락'),
       (1953, '설탕', '2숟가락'),
       (1953, '맛술', '1숟가락'),
       (1953, '후추', '약간');

-- 1954번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1954, '치아바타', '2개'),
       (1954, '루꼴라', '2대'),
       (1954, '토마토', '1개'),
       (1954, '모짜렐라 치즈', '1개'),
       (1954, '바질 페이스트', '2숟가락'),
       (1954, '발사믹크림', '2숟가락');

-- 1955번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1955, '생크림', '2종이컵'),
       (1955, '우유', '1+1/2종이컵'),
       (1955, '얼그레이티백', '2개'),
       (1955, '설탕', '1/2종이컵'),
       (1955, '판젤라틴', '5장'),
       (1955, '바닐라 익스트렉', '약간'),
       (1955, '타피오카펄', '2종이컵'),
       (1955, '흑설탕', '1/2종이컵');

-- 1956번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1956, '차돌박이', '100g'),
       (1956, '부추', '1줌'),
       (1956, '쪽파', '20g'),
       (1956, '소금', '약간'),
       (1956, '후추', '약간'),
       (1956, '식용유', '적당량'),
       (1956, '튀김가루', '1종이컵'),
       (1956, '물', '1/3종이컵'),
       (1956, '달걀', '1개');

-- 1957번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1957, '콩나물', '70g'),
       (1957, '두부', '100g'),
       (1957, '멸치다시마육수', '4종이컵'),
       (1957, '대파', '1대'),
       (1957, '청양고추', '1개'),
       (1957, '다진 마늘', '1/2숟가락'),
       (1957, '국간장', '1/2숟가락'),
       (1957, '새우젓', '1/2숟가락'),
       (1957, '고춧가루', '1/3숟가락');

-- 1958번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1958, '톳', '150g'),
       (1958, '두부', '1/2모'),
       (1958, '국간장', '1숟가락'),
       (1958, '깨소금', '1숟가락'),
       (1958, '참기름', '1숟가락'),
       (1958, '다진마늘', '약간'),
       (1958, '소금', '약간');

-- 1959번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1959, '라이스페이퍼', '4장'),
       (1959, '튀김기름', '적당량'),
       (1959, '설탕', '2숟가락'),
       (1959, '소금', '1숟가락'),
       (1959, '파프리카가루', '1/2숟가락'),
       (1959, '파슬리', '약간');

-- 1960번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1960, '수제비', '2종이컵'),
       (1960, '어묵', '2장'),
       (1960, '양배추', '2장'),
       (1960, '양파', '1/4개'),
       (1960, '감자', '1/2개'),
       (1960, '대파', '1대'),
       (1960, '깻잎', '6장'),
       (1960, '청양고추', '1개'),
       (1960, '통깨', '약간'),
       (1960, '멸치육수', '3+1/2종이컵'),
       (1960, '통깨', '약간'),
       (1960, '고추장', '2숟가락'),
       (1960, '매실액', '1숟가락'),
       (1960, '간장', '1숟가락'),
       (1960, '멸치액젓', '1/2숟가락'),
       (1960, '설탕', '2숟가락'),
       (1960, '고춧가루', '1숟가락'),
       (1960, '다진 마늘', '1숟가락'),
       (1960, '삶은달걀', NULL);
-- 삶은달걀의 용량 정보가 주어지지 않았습니다.

-- 1961
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1961, '두부', '1/2모'),
       (1961, '김치', '1줌'),
       (1961, '통조림참치', '1/2캔'),
       (1961, '양파', '1/2개'),
       (1961, '대파', '1/2대'),
       (1961, '버터', '1숟가락'),
       (1961, '새우분말', '2/3숟가락'),
       (1961, '참기름', '약간'),
       (1961, '통깨', '약간'),
       (1961, '물', '2/3종이컵');

-- 1962
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1962, '순대', '500g'),
       (1962, '고추장', '1숟가락'),
       (1962, '케첩', '1숟가락'),
       (1962, '다진마늘', '1/2숟가락'),
       (1962, '올리고당', '1숟가락');

-- 1963
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1963, '양파', '1/2개'),
       (1963, '달걀', '1개'),
       (1963, '밀가루', '1/2종이컵'),
       (1963, '빵가루', '1종이컵'),
       (1963, '소금', '약간'),
       (1963, '후추', '약간'),
       (1963, '식용유', '적당량');

-- 1964
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1964, '달걀', '8개'),
       (1964, '양파', '1/2개'),
       (1964, '대파', '1/2대'),
       (1964, '소시지', '50g'),
       (1964, '소금', '약간'),
       (1964, '케첩', NULL);

-- 1965
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1965, '건멸치', '1/2종이컵'),
       (1965, '깻잎', '30장'),
       (1965, '양파', '1/2개'),
       (1965, '멸치육수', '1종이컵'),
       (1965, '간장', '2숟가락'),
       (1965, '액젓', '1/2숟가락'),
       (1965, '고춧가루', '1/2숟가락'),
       (1965, '매실액', '1/2숟가락'),
       (1965, '다진마늘', '1/2숟가락'),
       (1965, '다진 쪽파', '1숟가락'),
       (1965, '참기름', '1숟가락'),
       (1965, '멸치육수', '3큰술'),
       (1965, '청양고추', '1개');

-- 1966
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1966, '밥', '1인분'),
       (1966, '스팸', '1캔'),
       (1966, '달걀', '2개'),
       (1966, '양파', '1/2개'),
       (1966, '마요네즈', '약간'),
       (1966, '파슬리가루', '약간'),
       (1966, '물', '3숟가락'),
       (1966, '간장', '2숟가락'),
       (1966, '설탕', '1숟가락');

-- 1967
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1967, '소양지', '300g'),
       (1967, '무', '300g'),
       (1967, '숙주나물', '150g'),
       (1967, '고사리', '120g'),
       (1967, '느타리버섯', '120g'),
       (1967, '표고버섯', '3개'),
       (1967, '대파', '2대'),
       (1967, '소금', NULL),
       (1967, '대파', '1대'),
       (1967, '통마늘', '5개'),
       (1967, '양파', '1/2개'),
       (1967, '통후추', '1/2숟가락'),
       (1967, '다시마', '4장'),
       (1967, '청주 또는 소주', '1/3종이컵'),
       (1967, '물', '1.5L'),
       (1967, '고춧가루', '2숟가락'),
       (1967, '고추기름', '1숟가락'),
       (1967, '국간장', '3숟가락'),
       (1967, '다진 마늘', '2숟가락'),
       (1967, '후추', '약간'),
       (1967, '참기름', '1숟가락');

-- 1968
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1968, '두부', '1모'),
       (1968, '깻잎', '10장'),
       (1968, '밀가루', '1/3종이컵'),
       (1968, '달걀', '2개'),
       (1968, '소금', '약간'),
       (1968, '후추', '약간');

-- 1969
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1969, '도라지', '200g'),
       (1969, '다진 대파', '2숟가락'),
       (1969, '들깨가루', '2숟가락'),
       (1969, '물', '1/2종이컵'),
       (1969, '다진 마늘', '1숟가락'),
       (1969, '국간장', '1/2숟가락'),
       (1969, '소금', '약간');

-- 1970
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1970, '쪽파', '10줄'),
       (1970, '불고기용 소고기', '150g'),
       (1970, '소금', '약간'),
       (1970, '후추', '약간'),
       (1970, '식용유', '약간'),
       (1970, '간장', '1/2숟가락'),
       (1970, '설탕', '1숟가락'),
       (1970, '연겨자', '1/2숟가락'),
       (1970, '마요네즈', '2숟가락');

-- 1971번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1971, '꼬막', '300g'),
       (1971, '소금', '약간'),
       (1971, '부침가루', '1종이컵'),
       (1971, '달걀', '2개'),
       (1971, '다진파', '1숟가락'),
       (1971, '식용유', '적당량');

-- 1972번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1972, '연근', '250g'),
       (1972, '돼지고기다짐육', '300g'),
       (1972, '소고기다짐육', '300g'),
       (1972, '밀가루', '적당량'),
       (1972, '달걀', '2개'),
       (1972, '식용유', '약간'),
       (1972, '양조간장', '2숟가락'),
       (1972, '다진 쪽파', '2뿌리'),
       (1972, '다진마늘', '1숟가락'),
       (1972, '참기름', '약간'),
       (1972, '후추', '약간');

-- 1973번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1973, '도라지', '150g'),
       (1973, '오이', '1/2개'),
       (1973, '양파', '1/4개'),
       (1973, '오징어', '1/2마리'),
       (1973, '참기름', '1/2숟가락'),
       (1973, '참깨', '1숟가락'),
       (1973, '고추장', '3숟가락'),
       (1973, '고춧가루', '1숟가락'),
       (1973, '식초', '2숟가락'),
       (1973, '설탕', '1숟가락'),
       (1973, '올리고당', '1숟가락'),
       (1973, '다진 마늘', '1/2숟가락');

-- 1974번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1974, '돼지고기 등심', '400g'),
       (1974, '빵가루', '2종이컵'),
       (1974, '밀가루', '1종이컵'),
       (1974, '달걀', '2개'),
       (1974, '소금', '1/4작은술'),
       (1974, '후추', '1/4작은술'),
       (1974, '오뚜기경양식돈까스소스', '1종이컵');

-- 1975번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1975, '동태', '300g'),
       (1975, '소금', '약간'),
       (1975, '후추', '약간'),
       (1975, '달걀', '2개'),
       (1975, '부침가루', '1/2종이컵'),
       (1975, '쑥갓', NULL), -- 쑥갓의 용량 정보가 주어지지 않았습니다.
       (1975, '홍고추', NULL);
-- 홍고추의 용량 정보가 주어지지 않았습니다.

-- 1976번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1976, '복숭아 과육', '300g'),
       (1976, '설탕', '300g'),
       (1976, '올리고당', '적당량'),
       (1976, '복숭아청', '4숟가락'),
       (1976, '홍차', '1개'),
       (1976, '뜨거운물', '1/2종이컵'),
       (1976, '물', '1종이컵');

-- 1977번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1977, '새우', '2종이컵'),
       (1977, '버터', '10g'),
       (1977, '올리브오일', '적당량'),
       (1977, '마늘', '10개'),
       (1977, '소금', '약간'),
       (1977, '후추', '약간');

-- 1978번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1978, '통식빵', '1개'),
       (1978, '달걀노른자', '4개'),
       (1978, '우유', '1종이컵'),
       (1978, '생크림', '1종이컵'),
       (1978, '설탕', '3/5종이컵'),
       (1978, '전분', '1숟가락'),
       (1978, '흑설탕', '적당량');

-- 1979번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1979, '비빔면', '1봉지'),
       (1979, '라면스프', '1개'),
       (1979, '달걀노른자', '1개'),
       (1979, '마요네즈', '적당량'),
       (1979, '파마산치즈', '1숟가락');

-- 1980번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1980, '식빵', '5장'),
       (1980, '설탕', '5숟가락'),
       (1980, '식용유', '적당량');

-- 1981
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1981, '오징어', '1마리'),
       (1981, '꽈리고추', '8개'),
       (1981, '마늘', '3개'),
       (1981, '참기름', '1/2숟가락'),
       (1981, '통깨', '약간'),
       (1981, '간장', '2+1/2숟가락'),
       (1981, '올리고당', '3숟가락'),
       (1981, '다진 마늘', '1/2숟가락'),
       (1981, '후추', '약간');

-- 1982
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1982, '닭다리', '200g'),
       (1982, '빨간 파프리카', '1/2개'),
       (1982, '노란 파프리카', '1/2개'),
       (1982, '가지', '1/2개'),
       (1982, '소금', '약간'),
       (1982, '후추', '약간'),
       (1982, '고형 카레', '3블럭'),
       (1982, '홀토마토', '1종이컵'),
       (1982, '닭육수', '4종이컵'),
       (1982, '양파', '1개'),
       (1982, '버터', '1숟가락'),
       (1982, '월계수잎', '2장'),
       (1982, '소금', '약간'),
       (1982, '후추', '약간');

-- 1983
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1983, '소시지', '4개'),
       (1983, '사천 고추', '5개'),
       (1983, '마늘', '2알'),
       (1983, '설탕', '1/2숟가락'),
       (1983, '소금', '약간'),
       (1983, '후추', '약간'),
       (1983, '물엿', '1숟가락'),
       (1983, '식용유', '약간');

-- 1984
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1984, '가지', '1개'),
       (1984, '쌈채소', '1줌'),
       (1984, '오이', '1/3개'),
       (1984, '피망', '1/2개'),
       (1984, '간장', '3숟가락'),
       (1984, '고춧가루', '2숟가락'),
       (1984, '식초', '1+1/2숟가락'),
       (1984, '설탕', '2숟가락'),
       (1984, '액젓', '2숟가락'),
       (1984, '다진 마늘', '1/2숟가락'),
       (1984, '매실액', '1/2숟가락'),
       (1984, '참기름', '2숟가락'),
       (1984, '통깨', '약간');

-- 1985
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1985, '냉동 돈까스', '3장'),
       (1985, '식빵', '4장'),
       (1985, '양배추', '250g'),
       (1985, '마요네즈', '6숟가락'),
       (1985, '머스타드', '2숟가락');

-- 1986
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1986, '연두부', '2개'),
       (1986, '전분', '적당량'),
       (1986, '다시마육수', '1종이컵'),
       (1986, '맛술', '2숟가락'),
       (1986, '간장', '2숟가락'),
       (1986, '무', '1조각'),
       (1986, '김', '약간'),
       (1986, '튀김기름', '적당량');

-- 1987
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1987, '떡볶이떡', '12개'),
       (1987, '베이컨', '6줄'),
       (1987, '고추장', '1숟가락'),
       (1987, '올리고당', '3숟가락'),
       (1987, '다진 마늘', '1/2숟가락'),
       (1987, '케첩', '3숟가락'),
       (1987, '간장', '1/2숟가락'),
       (1987, '물', '3숟가락');

-- 1988
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1988, '김밥김', '2장'),
       (1988, '밥', '1+1/2공기'),
       (1988, '아보카도', '1개'),
       (1988, '양파', '1/4개'),
       (1988, '참치캔', '1/2캔'),
       (1988, '마요네즈', '4숟가락'),
       (1988, '간장', '1숟가락'),
       (1988, '깻잎', '4장'),
       (1988, '후추', '약간'),
       (1988, '소금', '1/4숟가락'),
       (1988, '참기름', '1/2숟가락');

-- 1989
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1989, '차돌박이', '1줌'),
       (1989, '감자', '1/2개'),
       (1989, '양파', '1/4개'),
       (1989, '애호박', '1/4개'),
       (1989, '청양고추', '1개'),
       (1989, '대파', '1대'),
       (1989, '두부', '1/3모'),
       (1989, '쌀뜨물', '3종이컵'),
       (1989, '된장', '2숟가락'),
       (1989, '고추장', '1숟가락'),
       (1989, '국간장', '1/2숟가락'),
       (1989, '다진마늘', '1/2숟가락');

-- 1990
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1990, '달걀', '4개'),
       (1990, '불린 당면', '1줌'),
       (1990, '김', '1장'),
       (1990, '간장', '1숟가락'),
       (1990, '설탕', '1/2숟가락'),
       (1990, '후추', '약간'),
       (1990, '참기름', '1/2숟가락'),
       (1990, '소금', '약간'),
       (1990, '식용유', '약간');

-- 1991번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1991, '만두피', '14장'),
       (1991, '올리브유', '약간'),
       (1991, '버터', '3숟가락'),
       (1991, '후추', '약간'),
       (1991, '베이컨', '2줄'),
       (1991, '양송이', '2개'),
       (1991, '양파', '1/4개'),
       (1991, '달걀', '1개'),
       (1991, '리코타치즈', '2종이컵'),
       (1991, '그라노파다노치즈', '1/2종이컵'),
       (1991, '소금', '약간'),
       (1991, '후추', '약간');

-- 1992번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1992, '야채튀김', '8개'),
       (1992, '식용유', '약간'),
       (1992, '고추장', '3숟가락'),
       (1992, '케첩', '4숟가락'),
       (1992, '물엿', '2숟가락'),
       (1992, '다진 마늘', '1숟가락'),
       (1992, '다진 양파', '1숟가락'),
       (1992, '물', '1/2종이컵'),
       (1992, '후추', '약간');

-- 1993번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1993, '콩나물', '200g'),
       (1993, '불린 쌀', '2+1/2종이컵'),
       (1993, '물', '2종이컵'),
       (1993, '대패삼겹살', '200g'),
       (1993, '소금', '1/4숟가락'),
       (1993, '후추', '약간'),
       (1993, '참기름', '1/2숟가락'),
       (1993, '다진마늘', '1/3숟가락'),
       (1993, '간장', '3숟가락'),
       (1993, '설탕', '약간'),
       (1993, '고춧가루', '1숟가락'),
       (1993, '참기름', '1숟가락'),
       (1993, '깨소금', '약간'),
       (1993, '다진 대파', '2숟가락'),
       (1993, '다진 홍고추', '1/2개'),
       (1993, '다진 청양고추', '1/2개');

-- 1994번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1994, '무뼈닭발', '500g'),
       (1994, '소주', '3숟가락'),
       (1994, '다진생강', '1/4숟가락'),
       (1994, '다진마늘', '1숟가락'),
       (1994, '소금', '약간'),
       (1994, '후추', '약간'),
       (1994, '전분', '1종이컵'),
       (1994, '물', '2/3종이컵'),
       (1994, '전분', '2종이컵');

-- 1995번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1995, '라면', '1개'),
       (1995, '설탕', '2숟가락'),
       (1995, '올리고당', '3숟가락'),
       (1995, '짜장가루', '2숟가락'),
       (1995, '고추장', '1+1/2숟가락'),
       (1995, '케첩', '2숟가락'),
       (1995, '물', '2숟가락'),
       (1995, '후추', '약간');

-- 1996번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1996, '손질 생새우', '15마리'),
       (1996, '밥', '1공기'),
       (1996, '맛술', '1숟가락'),
       (1996, '소금', '약간'),
       (1996, '후추', '약간'),
       (1996, '양파', '1/2개'),
       (1996, '파슬리가루', '약간'),
       (1996, '케첩', '2숟가락'),
       (1996, '칠리소스', '1+1/2숟가락'),
       (1996, '고춧가루', '1/2숟가락'),
       (1996, '간장', '1숟가락'),
       (1996, '다진 마늘', '1숟가락'),
       (1996, '설탕', '1숟가락'),
       (1996, '물', '3숟가락');

-- 1997번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1997, '스파게티면', '1인분'),
       (1997, '참기름', '1숟가락'),
       (1997, '데친 고사리', '50g'),
       (1997, '마늘', '2개'),
       (1997, '양파', '1/4개'),
       (1997, '면수', '4숟가락'),
       (1997, '굴소스', '1/2숟가락'),
       (1997, '간장', '1/2숟가락'),
       (1997, '올리고당', '1/2숟가락'),
       (1997, '맛술', '1숟가락'),
       (1997, '소금', '약간'),
       (1997, '후추', '약간');

-- 1998번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1998, '시판호떡믹스', '1봉'),
       (1998, '따뜻한물', '1+1/4종이컵'),
       (1998, '스트링치즈', NULL),
       (1998, '모짜렐라치즈', NULL),
       (1998, '파마산치즈가루', NULL),
       (1998, '파슬리가루', '약간');

-- 1999번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (1999, '밥', '1공기'),
       (1999, '베이컨', '7줄'),
       (1999, '양파', '1/4개'),
       (1999, '당근', '1/4개'),
       (1999, '대파', '1대'),
       (1999, '소금', '약간'),
       (1999, '후추', '약간');

-- 2000번 레시피의 재료와 용량을 분리하여 데이터베이스에 삽입
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (2000, '새우', '12마리'),
       (2000, '마늘', '5알'),
       (2000, '사천 고추', '4개'),
       (2000, '올리브유', '2종이컵'),
       (2000, '마라소스', '3숟가락'),
       (2000, '소금', '약간'),
       (2000, '후추', '약간'),
       (2000, '불린 납작당면', '약간');

-- 2001
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (2001, '밥', '1인분'),
       (2001, '고추참치', '1캔'),
       (2001, '옥수수콘', '4숟가락'),
       (2001, '달걀', '1개'),
       (2001, '소금', '약간'),
       (2001, '후추', '약간'),
       (2001, '식용유', '약간'),
       (2001, '청양고추', '약간');

-- 2002
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (2002, '식빵', '5장'),
       (2002, '새우살', '180g'),
       (2002, '달걀흰자', '3~4숟가락'),
       (2002, '감자전분', '2숟가락'),
       (2002, '올리브유', '1숟가락'),
       (2002, '맛술', '1/2숟가락'),
       (2002, '소금', '약간'),
       (2002, '후추', '약간');

-- 2003
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (2003, '새우', '5개'),
       (2003, '콩물', '300ml'),
       (2003, '완두콩', '1숟가락'),
       (2003, '불린 젤라틴', '2숟가락'),
       (2003, '생와사비', '1작은숟가락'),
       (2003, '오리엔탈소스', NULL);

-- 2004
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (2004, '식빵', '4장'),
       (2004, '달걀', '3개'),
       (2004, '슬라이스햄', '4장'),
       (2004, '청상추', '4장'),
       (2004, '양배추', '3장'),
       (2004, '당근', '1/4개'),
       (2004, '감자', '1/3개'),
       (2004, '양파', '1/4개'),
       (2004, '청양고추', '1개'),
       (2004, '마가린', '약간'),
       (2004, '소금', '약간'),
       (2004, '후추', '약간'),
       (2004, '케첩', '2숟가락');

-- 2005
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (2005, '김밥용김', '3장'),
       (2005, '맛살', '12개'),
       (2005, '슬라이스치즈', '3장'),
       (2005, '깻잎', '6장'),
       (2005, '튀김가루', '1종이컵'),
       (2005, '물', '1/2종이컵');

-- 2006
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (2006, '꽃게 순살', '100g'),
       (2006, '크림스프 분말', '40g'),
       (2006, '물', '500ml'),
       (2006, '감자', '1개'),
       (2006, '양파', '1개'),
       (2006, '브로콜리', '5쪽'),
       (2006, '땅콩잼', '2숟가락');

-- 2007
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (2007, '삶은 고구마', '2개'),
       (2007, '통조림옥수수', '4숟가락'),
       (2007, '베이컨', '6줄'),
       (2007, '꿀', '1숟가락'),
       (2007, '버터', '2숟가락'),
       (2007, '후추', '약간');

-- 2008
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (2008, '통조림 옥수수', '1캔'),
       (2008, '다진청양고추', '2개'),
       (2008, '다진양파', '1/4개'),
       (2008, '파슬리가루', '약간'),
       (2008, '나초', '2줌'),
       (2008, '버터', '2숟가락'),
       (2008, '슬라이스치즈', '2장'),
       (2008, '피자치즈', '2종이컵'),
       (2008, '마요네즈', '3숟가락'),
       (2008, '설탕', '1+1/2숟가락'),
       (2008, '후추', '약간');

-- 2009
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (2009, '수블수블 막걸리', '250ml'),
       (2009, '오이', '20g'),
       (2009, '레몬', '3쪽'),
       (2009, '애플민트', '3g'),
       (2009, '꿀', '1숟가락');

-- 2010
INSERT INTO recipe_ingredient_tb (recipe_id, recipe_ingr_name, recipe_ingr_amount)
VALUES (2010, '깻잎', '4장'),
       (2010, '김밥용 단무지', '2줄'),
       (2010, '김밥용 햄', '2줄'),
       (2010, '김밥용 우엉', '적당량'),
       (2010, '채 썬 당근', '1줌'),
       (2010, '달걀', '2개'),
       (2010, '김밥김', '2장'),
       (2010, '맛술', '1숟가락'),
       (2010, '소금', '적당량'),
       (2010, '참깨', '약간'),
       (2010, '식용유', '적당량'),
       (2010, '밥', '1+1/2공기'),
       (2010, '약고추장', '3숟가락'),
       (2010, '참기름', '약간');
