import 'package:fe/store/userstore.dart';
import 'package:flutter/material.dart';
import 'package:provider/provider.dart';

class Policycheck extends StatefulWidget {
  const Policycheck({super.key});

  @override
  State<Policycheck> createState() => _PolicycheckState();
}

class _PolicycheckState extends State<Policycheck> {
  @override
  Widget build(BuildContext context) {
    return Text('''
<총 칙>

채움(이하 “회사”)은 이용자의 동의를 기반으로 개인정보를 수집, 이용 및 제공하고 있으며, "정보통신망 이용촉진 및 정보보호 등에 관한 법률" 상의 개인정보 보호규정을 준수하고 있습니다.
-본 개인정보처리방침은 회사가 제공하는 앱에 적용됩니다.

1. 개인정보 수집항목 및 이용 목적
가. "회사"는 회원님에게 식재료 및 레시피 추천 서비스를 제공하고, 통계 및 맞춤형 추천을 위해 필요한 최소한의 정보를 수집하고 있습니다.
나. "회사"는 회원님의 개인정보를 다음과 같이 수집합니다.
- 필수 정보 : 이메일, 비밀번호, 생년월일, 알러지여부, 비건여부 
다. 수집한 개인 정보는 다음과 같은 목적으로 사용됩니다.
- 필수 정보 : 서비스 이용에 따른 본인 식별 또는 인증절차, 서비스 제공 및 개선, 추후 신규 서비스 개발을 위해 사용합니다.

2. 개인정보의 보유 및 이용기간
"회사"는 고객님의 서비스 가입일로부터 고객님계 서비스를 제공하는 기간 동안에 한하여 고객님의 개인정보를 보유 및 이용하게 됩니다. 회원 탈퇴를 요청하거나 개인정보의 수집 및 이용에 대한 동의를 철회하는 경우, 수집/이용 목적을 달성하거나 보유/이용 기간이 종료한 경우, 사업폐지 등의 사유 발생시 당해 개인정보를 지체없이 파기합니다.
가. 홈페이지 회원 가입 및 관리 : 개인 홈페이지 탈퇴시까지 혹은 서비스 종료시까지 회원정보를 보관합니다.

3. 개인정보의 파기 절차 및 방법
회원님의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 내부 방침 및 기타 관련 법령에 의한 정보보호 방침에 의해 삭제되거나 파기합니다. 일반적으로 회원탈퇴 시점에 바로 삭제됩니다.
가. 파기 절차
- 회원님의 회원가입 등을 위해 입력한 정보는 회원 탈퇴시 바로 삭제 됩니다.
나. 파기 방법
- 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.
- 그 외의 기록물, 인쇄물, 서면 등의 경우 분쇄하거나 소각하여 파기합니다.


4. 개인정보 제공
본 회사는 이용자의 별도 돋의가 있는 경우나 법령에 규정된 경우를 제외하고는 이용자의 개인정보를 제3자에게 제공하지 않습니다.

5. 기타

개인정보 보호책임자 및 담당부서
책임자: 이지혁
담당 부서: 채움 담당자
문의: 010-8480-9400
개인정보처리방침이 변경되는 경우
법률이나 서비스의 변경사항을 반영하기 위한 목적 등으로 개인정보처리방침을 수정할 수 있습니다.

개인정보처리방침이 변경되는 경우 본 회사는 변경 사항을 게시하며, 변경된 개인정보처리방침은 게시한 날로부터 7일 후부터 효력이 발생합니다.

다만, 수집하는 개인정보의 항목, 이용목적의 변경 등과 같이 이용자 권리의 중대한 변경이 발생할 때에는 최소 30일 전에 미리 알려드리겠습니다.
''');
  }
}
